[
  {
    "number": "000.",
    "text": "Golden and Silver Rules"
  },
  {
    "number": "001.",
    "text": "Golden Rule"
  },
  {
    "number": "002.",
    "text": "Card text supersedes rules text. Whenever a card fundamentally contradicts the rules, the card's indication is what is true."
  },
  {
    "number": "050.",
    "text": "Silver Rule"
  },
  {
    "number": "051.",
    "text": "Card text uses different terminology than rules. Card text should be interpreted according to these rules, not as though it were text within these rules."
  },
  {
    "number": "052.",
    "text": "Card, when written in card effects, is shorthand for \"Main Deck card.\" Runes, legends, and battlefields are not considered cards when executing the abilities and effects of game objects. They are considered cards for the purposes of these rules."
  },
  {
    "number": "053.",
    "text": "Cards refer to themselves in the first person."
  },
  {
    "number": "053.1.",
    "text": "* Units and legends say \"I,\" \"me,\" etc."
  },
  {
    "number": "053.2.",
    "text": "* Gear and spells say \"this.\""
  },
  {
    "number": "053.3.",
    "text": "* Battlefields say \"here.\""
  },
  {
    "number": "054.",
    "text": "“Can’t beats Can”"
  },
  {
    "number": "054.1.",
    "text": "Cards that forbid actions or effects, as a broad method of determination, supersede cards that allow or permit that same action or effect."
  },
  {
    "number": "055.",
    "text": "When executing card text, do as much as you can, ignoring impossible instructions."
  },
  {
    "number": "055.1.",
    "text": "If all of a card’s instructions are impossible, it is still played and resolved, but nothing happens."
  },
  {
    "number": "100.",
    "text": "Game Concepts"
  },
  {
    "number": "101.",
    "text": "Deck Construction"
  },
  {
    "number": "102.",
    "text": "Riftbound is a Trading Card Game where a player must provide their own cards to play against other players."
  },
  {
    "number": "103.",
    "text": "To play Riftbound, a player must have two Decks, a Champion Legend, and a number of Battlefields determined by the Mode of Play."
  },
  {
    "number": "103.1.",
    "text": "1 Champion Legend"
  },
  {
    "number": "103.1.a.",
    "text": "This is placed in the Legend Zone at the start of the game."
  },
  {
    "number": "103.1.b.",
    "text": "This will dictate the Domain Identity of the Main Deck."
  },
  {
    "number": "103.1.b.1.",
    "text": "Cards included in your Deck must abide by your Domain Identity."
  },
  {
    "number": "103.1.b.2.",
    "text": "Your deck’s Domain Identity is dictated by the domains of your Champion Legend. In the default card frame, these domains appear as symbols in the legend’s upper left corner."
  },
  {
    "number": "103.1.b.3.",
    "text": "If a card has a single Domain, then that card is permitted in the Domain Identity that corresponds to the same Domain."
  },
  {
    "number": "103.1.b.4.",
    "text": "If a card has more than one Domain, then that card is permitted only in a Domain Identity that contains all of the indicated Domains on that card."
  },
  {
    "number": "103.2.",
    "text": "A Main Deck of at least 40 cards 1 Chosen Champion Unit Units Gear Spells"
  },
  {
    "number": "103.2.a.",
    "text": "Chosen Champion"
  },
  {
    "number": "103.2.a.1.",
    "text": "This will be placed in the Champion Zone at the start of the game."
  },
  {
    "number": "103.2.a.2.",
    "text": "Must be a champion unit with a champion tag that matches the tag on your Champion Legend. Example: Loose Cannon has the tag Jinx. Therefore, a player could choose Jinx, Rebel or Jinx, Demolitionist as their Chosen Champion, because they also have the tag Jinx. Example: Tibbers has the tag Annie, but it is a signature unit, not a champion unit. It cannot be your Chosen Champion, even if your Champion Legend has the tag Annie."
  },
  {
    "number": "103.2.a.3.",
    "text": "A player’s Chosen Champion is both the specific card chosen for this slot during Deck Building and also any Champion Unit with the same name as the specific card selected for this specific slot during the course of play. Example: A player chose Jinx, Rebel as their Chosen Champion. One copy of Jinx, Rebel starts the game in their Chosen Champion zone. Any additional copies of Jinx, Rebel in their Main Deck, their hand, their trash, or on the board also count as their Chosen Champion for any game rules and effects that care about Chosen Champion status during the game."
  },
  {
    "number": "103.2.b.",
    "text": "Your Main Deck can include up to 3 copies of the same named card."
  },
  {
    "number": "103.2.b.1.",
    "text": "This includes your Chosen Champion. Example: A deck could include Volibear, Furious as its Chosen Champion and still include 2 more copies of Volibear, Furious."
  },
  {
    "number": "103.2.b.2.",
    "text": "Cards have different names even if they represent the same character. Example: A deck could include 3 copies of Yasuo, Remorseful and 3 copies of Yasuo, Windrider, because they have different names."
  },
  {
    "number": "103.2.c.",
    "text": "Subject to Domain Identity."
  },
  {
    "number": "103.2.d.",
    "text": "Your deck may only contain 3 total Signature cards that have the same Champion tag as your Champion Legend."
  },
  {
    "number": "103.2.d.1.",
    "text": "Regardless of name, a deck may only contain a sum total of 3 Signature cards."
  },
  {
    "number": "103.2.d.2.",
    "text": "All of the Signature cards must have the Champion tag that corresponds to the Champion Legend of the deck."
  },
  {
    "number": "103.2.d.3.",
    "text": "Signature cards are not Champion units and cannot be placed in the Champion Zone."
  },
  {
    "number": "103.2.e.",
    "text": "During Gameplay, the Main Deck is Secret Information."
  },
  {
    "number": "103.2.e.1.",
    "text": "It cannot be looked through or revealed unless instructed by a card effect."
  },
  {
    "number": "103.3.",
    "text": "Rune Deck"
  },
  {
    "number": "103.3.a.",
    "text": "12 Rune Cards"
  },
  {
    "number": "103.3.a.1.",
    "text": "Cards in this deck must be of the Domain Identity of your Champion Legend."
  },
  {
    "number": "103.3.b.",
    "text": "Must be shuffled and kept separate from the Main Deck."
  },
  {
    "number": "103.4.",
    "text": "Battlefields"
  },
  {
    "number": "103.4.a.",
    "text": "The number will be dictated by your Mode of Play."
  },
  {
    "number": "103.4.b.",
    "text": "Subject to Domain Identity if applicable."
  },
  {
    "number": "103.4.c.",
    "text": "Cannot include more than one of a Battlefield of the same name when there are more than one required for the deck."
  },
  {
    "number": "104.",
    "text": "Setup"
  },
  {
    "number": "105.",
    "text": "Spaces"
  },
  {
    "number": "106.",
    "text": "The Play Area includes a space for Game Objects referred to as The Board."
  },
  {
    "number": "106.1.",
    "text": "The Board is divided into several Zones."
  },
  {
    "number": "106.2.",
    "text": "The Base"
  },
  {
    "number": "106.2.a.",
    "text": "One per player."
  },
  {
    "number": "106.2.b.",
    "text": "The space each player always has access to play their Units and Gear to."
  },
  {
    "number": "106.2.c.",
    "text": "Each Base is a Location."
  },
  {
    "number": "106.2.d.",
    "text": "Other players cannot have Game Objects they control in another player's Base."
  },
  {
    "number": "106.2.e.",
    "text": "The Base also houses each player's Runes that are on The Board."
  },
  {
    "number": "106.3.",
    "text": "The Battlefield Zone"
  },
  {
    "number": "106.3.a.",
    "text": "Multiple Battlefields will be here, typically one per player, but occasionally less."
  },
  {
    "number": "106.3.b.",
    "text": "The space where Battlefields are located during gameplay."
  },
  {
    "number": "106.3.c.",
    "text": "Each Battlefield is individually a Location."
  },
  {
    "number": "106.4.",
    "text": "The Facedown Zones"
  },
  {
    "number": "106.4.a.",
    "text": "Each Battlefield is associated with a sub-zone called a Facedown Zone, a single logical space that a card can be put facedown in through various Game Effects."
  },
  {
    "number": "106.4.b.",
    "text": "Each Facedown Zone has a maximum occupancy of one card."
  },
  {
    "number": "106.4.c.",
    "text": "Cards can only be placed in or occupy the Facedown Zone if the controller of the card also controls the associated Battlefield."
  },
  {
    "number": "106.4.d.",
    "text": "If the Hidden card's controller loses Control of the Battlefield, the card in the Facedown Zone is removed during the next Cleanup.\nSee rule 318. Cleanups for more information.\nSee rule 408. Hide for more information."
  },
  {
    "number": "106.4.e.",
    "text": "Facedown Zones are not locations."
  },
  {
    "number": "106.5.",
    "text": "The Legend Zone"
  },
  {
    "number": "106.5.a.",
    "text": "The space for each player's Champion Legend."
  },
  {
    "number": "106.5.b.",
    "text": "This is not a location."
  },
  {
    "number": "106.5.c.",
    "text": "The Champion Legend here is a Game Object.\nSee rule 119. Game Objects for more information."
  },
  {
    "number": "106.5.d.",
    "text": "The Champion Legend cannot be removed, moved, or displaced from this zone."
  },
  {
    "number": "107.",
    "text": "The Play Area also includes Non-Board Zones."
  },
  {
    "number": "107.1.",
    "text": "The Trash"
  },
  {
    "number": "107.1.a.",
    "text": "This space is where cards are placed when they are killed or discarded, when they finish being executed as spells, when they are moved to the trash as an effect, etc."
  },
  {
    "number": "107.1.b.",
    "text": "Represents cards that have been used or spent."
  },
  {
    "number": "107.1.c.",
    "text": "Each player has a separate trash."
  },
  {
    "number": "107.1.d.",
    "text": "A card owned by a player can never, for any reason, be put into a trash of another player. If it would be, it's put into its owner's trash instead."
  },
  {
    "number": "107.1.e.",
    "text": "The cards in the Trash are unordered. Their sequence does not matter, and they may be reorganized."
  },
  {
    "number": "107.1.f.",
    "text": "The cards in any player's Trash are Public Information.\nSee rule 127. Privacy for more information."
  },
  {
    "number": "107.2.",
    "text": "The Champion Zone"
  },
  {
    "number": "107.2.a.",
    "text": "The space each player puts their Chosen Champion at the start of the game."
  },
  {
    "number": "107.2.b.",
    "text": "The Chosen Champion here cannot be returned to this zone by normal means."
  },
  {
    "number": "107.2.b.1.",
    "text": "If a Chosen Champion is instructed to be returned to this zone, it can only do so if there is not a card already in this zone."
  },
  {
    "number": "107.2.c.",
    "text": "The Chosen Champion can be played from here as normal, following the rules of Playing a Card.\nSee rule 346. Playing Cards for more information."
  },
  {
    "number": "107.3.",
    "text": "The Main Deck Zone"
  },
  {
    "number": "107.3.a.",
    "text": "The space for the player's Main Deck."
  },
  {
    "number": "107.3.b.",
    "text": "Primarily houses the face-down deck during gameplay."
  },
  {
    "number": "107.3.c.",
    "text": "The order of cards in the deck is Secret Information during the course of play.\nSee rule 127. Privacy for more information."
  },
  {
    "number": "107.4.",
    "text": "The Rune Deck Zone"
  },
  {
    "number": "107.4.a.",
    "text": "The space for the player's Rune Deck."
  },
  {
    "number": "107.4.b.",
    "text": "Primarily houses the face-down runes during gameplay."
  },
  {
    "number": "107.4.c.",
    "text": "The order of runes in the deck is Secret Information during the course of play.\nSee rule 127. Privacy for more information."
  },
  {
    "number": "107.5.",
    "text": "Banishment"
  },
  {
    "number": "107.5.a.",
    "text": "This space is where cards are placed when they are banished by a spell or effect."
  },
  {
    "number": "107.5.b.",
    "text": "Represents cards that have been removed from play in a more difficult-to-recover way, or a temporary space to hold cards while effects are being processed."
  },
  {
    "number": "107.5.c.",
    "text": "Each player has a separate banishment."
  },
  {
    "number": "107.5.d.",
    "text": "A card owned by a player can never, for any reason, be put into the banishment of another player. If it would be, it's put into its owner's banishment instead."
  },
  {
    "number": "107.5.e.",
    "text": "The cards in the banishment are unordered. Their sequence does not matter, and they may be reorganized."
  },
  {
    "number": "107.5.f.",
    "text": "The cards in any player's Banishment are Public Information.\nSee rule 127. Privacy for more information."
  },
  {
    "number": "107.5.g.",
    "text": "Some spells or effects may reference cards placed into banishment directly."
  },
  {
    "number": "107.5.h.",
    "text": "Effects that reference cards in banishment only do so by means of also putting the cards there."
  },
  {
    "number": "107.5.i.",
    "text": "The effects or references to cards in banishment do not count as Choosing."
  },
  {
    "number": "107.5.j.",
    "text": "The effects or references to cards in banishment do not count as Attachment."
  },
  {
    "number": "107.6.",
    "text": "The Hand"
  },
  {
    "number": "107.6.a.",
    "text": "Each player has a collection of cards they may Play cards from."
  },
  {
    "number": "107.6.b.",
    "text": "This is the location cards go when Drawn."
  },
  {
    "number": "107.6.c.",
    "text": "The cards in a player's hand are Private Information."
  },
  {
    "number": "107.6.d.",
    "text": "The number of cards in a player's hand is Public Information."
  },
  {
    "number": "107.6.e.",
    "text": "The hand can be targeted as a zone, and cards there can be affected by spells and effects when specified."
  },
  {
    "number": "107.6.f.",
    "text": "A card owned by a player can never, for any reason, be put into the hand of another player. If it would be, it's put into its owner's hand instead."
  },
  {
    "number": "108.",
    "text": "All Game Objects in the collective Play Areas are Public Information."
  },
  {
    "number": "108.1.",
    "text": "Any player may view, or be provided with the details of the face-up information printed on the cards in the Play Area."
  },
  {
    "number": "108.2.",
    "text": "The State of all Game Objects in the Play Area is also Public Information.\nExamples:\nIf a Unit is Buffed\nIf a Gear is Exhausted\nEtc."
  },
  {
    "number": "109.",
    "text": "Whenever a Game Object changes zones to or from a Non-Board Zone, all Temporary Modifications of all kinds cease to be tracked on it in all capacities.\nExamples:\nDamage is cleared.\nBuffs are removed.\nTemporarily granted Keywords are no longer granted."
  },
  {
    "number": "110.",
    "text": "Setup Process"
  },
  {
    "number": "111.",
    "text": "Each player separates their Champion Legend and places it in the Legend Zone."
  },
  {
    "number": "112.",
    "text": "Each player separates their Chosen Champion and places it in the Champion Zone."
  },
  {
    "number": "113.",
    "text": "Each player sets aside their Battlefields."
  },
  {
    "number": "113.1.",
    "text": "Your Mode of Play will dictate how these are used and placed into the Battlefield Zone.\nSee rule 458. Modes of Play for more information."
  },
  {
    "number": "114.",
    "text": "Each player shuffles their decks, separately, then places them into their respective Zones."
  },
  {
    "number": "114.1.",
    "text": "The Main Deck is placed in the Main Deck Zone."
  },
  {
    "number": "114.2.",
    "text": "The Rune Deck is placed in the Rune Deck Zone."
  },
  {
    "number": "115.",
    "text": "Determine Turn Order using any fair random method agreed on by all players."
  },
  {
    "number": "115.1.",
    "text": "Turn Order is established as a repeating set of the players."
  },
  {
    "number": "115.1.a.",
    "text": "The Mode of Play will specify how to determine a First Player."
  },
  {
    "number": "115.1.b.",
    "text": "If not otherwise specified, Seating then determines the sequence, play proceeding clockwise from the First Player."
  },
  {
    "number": "115.1.b.1.",
    "text": "The First Player is the player who becomes the Turn Player first."
  },
  {
    "number": "115.1.c.",
    "text": "Turn Order repeats until the game ends."
  },
  {
    "number": "115.2.",
    "text": "See the selected Mode of Play for any adjustments to each player's first turn.\nSee rule 458. Modes of Play for more information."
  },
  {
    "number": "116.",
    "text": "Players each draw 4."
  },
  {
    "number": "117.",
    "text": "In turn order, players perform their Mulligan."
  },
  {
    "number": "117.1.",
    "text": "A player may choose up to two cards in their hand. They set those cards aside."
  },
  {
    "number": "117.2.",
    "text": "Then, that player draws as many cards as they set aside."
  },
  {
    "number": "117.3.",
    "text": "Finally, that player Recycles the cards that were set aside.\nSee rule 403. Recycle for more information."
  },
  {
    "number": "118.",
    "text": "Begin play with the First Player taking their turn."
  },
  {
    "number": "119.",
    "text": "Game Objects"
  },
  {
    "number": "120.",
    "text": "A Game Object is any game piece that can produce one or more Game Effects or grant prerequisites for players to take Game Actions."
  },
  {
    "number": "121.",
    "text": "A Game Object does not include nor preclude any inherent properties beyond the ability to produce, or act as the prerequisite for, Game Effects and Game Actions."
  },
  {
    "number": "122.",
    "text": "A Game Object can be a literal object or a logical object."
  },
  {
    "number": "123.",
    "text": "Game Objects include, but are not limited to, the following:\nMain Deck cards in any zone\nRunes in any zone\nLegends\nBattlefields\nTokens\nAbilities of any type on the chain\nBuffs and other status markers"
  },
  {
    "number": "124.",
    "text": "Cards"
  },
  {
    "number": "125.",
    "text": "Riftbound games are composed of players playing the cards in their respective decks."
  },
  {
    "number": "126.",
    "text": "Ownership"
  },
  {
    "number": "126.1.",
    "text": "For gameplay purposes, a card's Owner is the player who brought it into the game, either as their Champion Legend, one of their Battlefields, or part of their Main Deck or Rune Deck. The legal owner of a card doesn't matter during gameplay.\nExample: Bo didn't bring a deck, so Alice loans him a deck. During the game, Bo is considered the owner of those cards, even though legally they belong to Alice."
  },
  {
    "number": "127.",
    "text": "Privacy"
  },
  {
    "number": "127.1.",
    "text": "A card will always exist in one of the many Zones described during Setup."
  },
  {
    "number": "127.2.",
    "text": "A card will have a different level of Privacy based on where it resides at a given time"
  },
  {
    "number": "127.3.",
    "text": "Secret: This level of Privacy indicates that neither player may read or look at the face of the card."
  },
  {
    "number": "127.4.",
    "text": "Private: This level of Privacy indicates that only the controller of a card on the board or the owner of a card in any other zone may read or look at the face of the card.\nExample: Cards in a player's hand are owned by that player. Only that player may read or look at their faces.\nExample: If a player controls a facedown card at a battlefield, that player and only that player may read or look at that card's face, regardless of who owns that card."
  },
  {
    "number": "127.5.",
    "text": "Public: This level of Privacy indicates that any player may read or look at the face of the card."
  },
  {
    "number": "128.",
    "text": "Back Side"
  },
  {
    "number": "128.1.",
    "text": "The back side of a card is the side with the Riftbound logo."
  },
  {
    "number": "128.2.",
    "text": "There is a unique pattern of back side for each of the three categories of card: Main Deck cards, Rune Deck cards, and Battlefields and Champion Legends."
  },
  {
    "number": "128.3.",
    "text": "The back side of a card is presented to conceal information for Private and Secret information cards. For example, cards in the Main Deck and cards in hand have their back side presented."
  },
  {
    "number": "128.4.",
    "text": "The term facedown is used to describe the state during regular play of having a card's back side presented on the Board. A facedown card’s front side is considered Private Information."
  },
  {
    "number": "129.",
    "text": "Front Side"
  },
  {
    "number": "129.1.",
    "text": "The front side of a card is the opposite of its back."
  },
  {
    "number": "129.2.",
    "text": "This is also referred to as a front face."
  },
  {
    "number": "129.3.",
    "text": "This can be identified in situations where the back is not easily discernible by the presence of the Play Cost in the upper left corner of the card."
  },
  {
    "number": "129.4.",
    "text": "Cards, when played, are played with their front face presented."
  },
  {
    "number": "129.5.",
    "text": "The term face up is used to describe the state during regular play of having a card's front face presented"
  },
  {
    "number": "129.6.",
    "text": "Cards are considered to be Public Information while in this state, even if obscured by other cards in a pile. Example: The Trash is Public Information because all cards there have their front face presented even while stacked."
  },
  {
    "number": "130.",
    "text": "Cost"
  },
  {
    "number": "130.1.",
    "text": "Main Deck cards have a Cost, listed in the upper left corner of the front face of the card.\nSee rule 161. Rune Pools for more information."
  },
  {
    "number": "130.2.",
    "text": "Energy Cost"
  },
  {
    "number": "130.2.a.",
    "text": "The numeral listed in the Cost element in the upper left corner of the card."
  },
  {
    "number": "130.3.",
    "text": "Power cost"
  },
  {
    "number": "130.3.a.",
    "text": "The symbols, listed vertically, in the Cost element in the upper left corner of the card."
  },
  {
    "number": "130.3.b.",
    "text": "This section may not be present on every card."
  },
  {
    "number": "130.4",
    "text": "Effects that need to determine a card’s cost for any purpose always use its base cost, even if that cost is altered or ignored as the card is played.\nExample: Sky Splitter is a spell that costs 8 Energy and says in part “This spell's Energy cost is reduced by the highest Might among units you control.” Lux, Illuminated is a unit that says “When you play a spell that costs 5 or more, give me +3 [M] this turn.” If a player who controls Lux plays Sky Splitter, Lux’s ability will trigger, regardless of how much was actually paid for Sky Splitter."
  },
  {
    "number": "131.",
    "text": "Name"
  },
  {
    "number": "131.1.",
    "text": "Each card has a name that identifies it uniquely."
  },
  {
    "number": "131.2.",
    "text": "This is usually located in the middle of the card."
  },
  {
    "number": "131.3.",
    "text": "Cards that are printed in different languages but represent the same card are considered to have the same name for the purposes of deckbuilding and gameplay.\nExample: Chemtech Enforcer in English and its counterpart in Chinese are considered the same card, despite the Name element on the card reading differently."
  },
  {
    "number": "131.4",
    "text": "Some cards have both a short name and a subtitle. For all purposes, including rules and deckbuilding, such a card’s name is “[Short Name], [Subtitle]”. Example: Kai’Sa, Evolutionary and Kai’Sa, Survivor both have the short name Kai’Sa, but they have different names. You can include 3 of each in your deck under normal deckbuilding rules. If one of them is your Chosen Champion, the other is not."
  },
  {
    "number": "132.",
    "text": "Category"
  },
  {
    "number": "132.1.",
    "text": "A card can have one or more Categories and Sub-Categories based on the properties of its front and back sides."
  },
  {
    "number": "132.2.",
    "text": "These Categories and Sub-Categories dictate the behaviors of the card during play."
  },
  {
    "number": "132.3.",
    "text": "Spells and other effects can refer to categories, sub-categories, supertypes, card types, tags, and other characteristics inclusively or exclusively.\nExample: A \"non-unit card\" is any card that is not a unit.\nExample: A \"unit\" is any game object that is a unit, regardless of any other categories it belongs to."
  },
  {
    "number": "132.4.",
    "text": "Main Deck Cards begin the game in the Main Deck or (in the case of a Chosen Champion) the Champion Zone."
  },
  {
    "number": "132.4.a.",
    "text": "Permanents"
  },
  {
    "number": "132.4.a.1.",
    "text": "An umbrella sub-category encompassing Main Deck Game Objects that remain on the board after being played."
  },
  {
    "number": "132.4.a.2.",
    "text": "Unit and Gear are permanent types."
  },
  {
    "number": "132.4.b.",
    "text": "Spells"
  },
  {
    "number": "132.4.b.1.",
    "text": "A sub-category encompassing Main Deck cards with the spell type, which do not remain on the board after being played."
  },
  {
    "number": "132.5.",
    "text": "Rune Deck Cards begin the game in the Rune Deck."
  },
  {
    "number": "132.5.a.",
    "text": "Runes"
  },
  {
    "number": "132.5.a.1.",
    "text": "A sub-category encompassing cards with the rune type. These are channeled rather than played. They remain on the board after being channeled, but they are not permanents, as they are not Main Deck cards."
  },
  {
    "number": "132.6.",
    "text": "Non-Deck Cards are not part of any deck and begin the game in a zone determined by their type."
  },
  {
    "number": "132.6.a.",
    "text": "Battlefields"
  },
  {
    "number": "132.6.a.1.",
    "text": "A sub-category encompassing cards with the battlefield type. They are not played or channeled. They start the game on the board."
  },
  {
    "number": "132.6.b.",
    "text": "Legends"
  },
  {
    "number": "132.6.b.1.",
    "text": "A sub-category encompassing cards with the legend type. They are not played or channeled. They start the game in the Legend Zone and cannot leave it during play."
  },
  {
    "number": "132.7.",
    "text": "Supertypes are Categories that may apply to game objects of multiple types. They are listed before a card’s type."
  },
  {
    "number": "132.7.a.",
    "text": "Champion is a supertype that applies exclusively to units. It impacts the rules for deckbuilding.\nSee rule 103.2.a. Chosen Champion for more information."
  },
  {
    "number": "132.7.b.",
    "text": "Signature is a supertype that may apply to game objects of any card type. It impacts the rules for deckbuilding.\nSee rule 103.2.d. for more information about Signature cards."
  },
  {
    "number": "132.7.c.",
    "text": "Token is a supertype applied to temporary game objects of any card type.\nSee rule 173. Tokens for more information."
  },
  {
    "number": "132.8.",
    "text": "Tags are Categories that may apply to game objects of multiple types. They are listed after a card’s type."
  },
  {
    "number": "132.8.a.",
    "text": "Tags have no innate rules meaning, but may be referenced by game rules and card effects."
  },
  {
    "number": "132.8.b.",
    "text": "Tags used to link Legends, Champion Units, and Signature cards are known as Champion Tags."
  },
  {
    "number": "133.",
    "text": "Domain"
  },
  {
    "number": "133.1.",
    "text": "Most cards belong to one or more of six Domains, identified by one or more symbols in the lower right corner."
  },
  {
    "number": "133.2.",
    "text": "Each Domain has an associated color, a unique symbol, and a shorthand used to represent that symbol in written text."
  },
  {
    "number": "133.2.a.",
    "text": "Fury is associated with the color red and represented by a circular symbol with three projecting points. Its shorthand is [R]."
  },
  {
    "number": "133.2.b.",
    "text": "Calm is associated with the color green and represented by a symbol resembling a leaf. Its shorthand is [G]."
  },
  {
    "number": "133.2.c.",
    "text": "Mind is associated with the color blue and represented by a symbol resembling a sun and moon. Its shorthand is [B]."
  },
  {
    "number": "133.2.d.",
    "text": "Body is associated with the color orange and represented by a blocky diamond-shaped symbol. Its shorthand is [O]."
  },
  {
    "number": "133.2.e.",
    "text": "Chaos is associated with the color purple and represented by a hexagonal symbol with swirls emanating from its center. Its shorthand is [P]."
  },
  {
    "number": "133.2.f.",
    "text": "Order is associated with the color yellow and represented by an angular winged symbol. Its shorthand is [Y]."
  },
  {
    "number": "134.",
    "text": "Rules Text"
  },
  {
    "number": "134.1.",
    "text": "All cards have a section that describes how they affect the game. This section is known as the Rules Text of the card."
  },
  {
    "number": "134.2.",
    "text": "This section may contain:"
  },
  {
    "number": "134.2.a.",
    "text": "Abilities"
  },
  {
    "number": "134.2.a.1.",
    "text": "Abilities are discrete pieces of text that describe what a card may or must do.\nSee rule 357. Abilities for more information."
  },
  {
    "number": "134.2.a.2.",
    "text": "They may appear on any card."
  },
  {
    "number": "134.2.b.",
    "text": "Instructions"
  },
  {
    "number": "134.2.b.1.",
    "text": "Instructions are a type of text that appears on spells and within abilities."
  },
  {
    "number": "134.2.b.2.",
    "text": "They describe the actions to be taken as the spell or ability resolves."
  },
  {
    "number": "134.2.c.",
    "text": "Keywords"
  },
  {
    "number": "134.2.c.1.",
    "text": "Keywords are short words or phrases that represent longer abilities or instructions.\nSee rule 726. Keywords for more information."
  },
  {
    "number": "134.2.c.2.",
    "text": "Keywords may or may not have reminder text."
  },
  {
    "number": "134.2.d.",
    "text": "Reminder Text"
  },
  {
    "number": "134.2.d.1.",
    "text": "Reminder text appears in italics and parentheses."
  },
  {
    "number": "134.2.d.2.",
    "text": "Its purpose is to summarize relevant rules, including keywords and other rules."
  },
  {
    "number": "134.2.d.3.",
    "text": "The presence, absence, or exact wording of reminder text has no effect on game function."
  },
  {
    "number": "134.2.e.",
    "text": "Symbols"
  },
  {
    "number": "134.2.e.1.",
    "text": "Rules text sometimes contains symbols that express game concepts. Each symbol also has a shorthand used to represent it in written text."
  },
  {
    "number": "134.2.e.2.",
    "text": "The cost of Exhausting a Permanent is represented by the “exhaust symbol,” which resembles a card turning sideways. Its shorthand is [E]. (Some previous rules information has given its shorthand as [T].)"
  },
  {
    "number": "134.2.e.3.",
    "text": "Might is represented by the “Might symbol,” which resembles a sword and shield. Its shorthand is [M]. (Some previous rules information has given its shorthand as [S].)"
  },
  {
    "number": "134.2.e.4.",
    "text": "Power of a specific Domain is represented by its domain symbol and the corresponding shorthand.\nSee rule 133. Domain for more information."
  },
  {
    "number": "134.2.e.5.",
    "text": "Power of any Domain is represented by a swirling rainbow symbol. Its shorthand is [A]."
  },
  {
    "number": "134.2.e.5.a.",
    "text": "When required as a cost, [A] can be paid by Power of any Domain."
  },
  {
    "number": "134.2.e.5.b.",
    "text": "When Added to a player’s Rune Pool, [A] can be spent to pay a Power cost of any Domain."
  },
  {
    "number": "134.2.e.6.",
    "text": "Power of a domain corresponding to a card’s own Domain is not represented by a symbol, but appears in these rules similarly to other symbols. Its shorthand is [C]."
  },
  {
    "number": "134.2.e.6.a.",
    "text": "When a [C] shorthand is printed on a card as reminder text, it assumes that card’s usual Domain, but it still means “one Power of this card’s Domain.”"
  },
  {
    "number": "134.2.e.6.b.",
    "text": "A [C] shorthand on a card with no Domain or with multiple Domains is processed as [A] instead."
  },
  {
    "number": "134.3.",
    "text": "Rules text can be blank."
  },
  {
    "number": "134.4.",
    "text": "A card’s Rules Text is Inactive while that card is Attached to another card.\nSee rule 716 Attachment for more information.\nSee rule 720 Inactive for more information."
  },
  {
    "number": "134.4.a.",
    "text": "The presence of text, rules, Keywords, and other effects can still be referenced and detected by other game effects, even while Rules Text is Inactive."
  },
  {
    "number": "135.",
    "text": "Effect Text"
  },
  {
    "number": "135.1",
    "text": "Some cards have a separate section of text below the Rules Text. This is referred to as the Effect Text."
  },
  {
    "number": "135.2",
    "text": "Effect Text can contain additional Abilities."
  },
  {
    "number": "135.2.a",
    "text": "Effect Text can be blank."
  },
  {
    "number": "135.2.b",
    "text": "Effect Text is inactive unless the card with the Effect Text is Attached to another card.\nSee rule 716 Attachment for more information.\nSee rule 720 Inactive for more information."
  },
  {
    "number": "135.2.c",
    "text": "The abilities in the Effect Text section of a card are appended to the Rules Text of the card to which the card with the Effect Text is Attached."
  },
  {
    "number": "136.",
    "text": "Might Bonus"
  },
  {
    "number": "136.1",
    "text": "Some cards have a Might Bonus in their lower right corner, expressed as an operator plus an integer."
  },
  {
    "number": "136.2",
    "text": "A card’s Might Bonus can be +0."
  },
  {
    "number": "136.3",
    "text": "A card’s Might Bonus modulates the Might of the card to which the card that has the Might Bonus is Attached.\nSee rule 716 Attachment for more information."
  },
  {
    "number": "136.3.a",
    "text": "The Might Bonus is applied while Attached and stops applying as soon as the card with the Might Bonus is no longer Attached."
  },
  {
    "number": "136.3.b",
    "text": "If the card to which a card with a Might Bonus is Attached has no Might value, the Might Bonus is ignored."
  },
  {
    "number": "137.",
    "text": "Flavor Text"
  },
  {
    "number": "137.1.",
    "text": "Flavor text is text that appears at the bottom of some cards to provide aesthetic enjoyment. It conveys no gameplay information.\nExample: The card Void Seeker features a quote from the character Kai'Sa. It does not have the Kai'Sa tag and has no gameplay connection to the Champion unit Kai'Sa."
  },
  {
    "number": "137.2.",
    "text": "Flavor text is located at the bottom of the section provided for rules text, usually in a shaded bar. It appears in italics."
  },
  {
    "number": "138.",
    "text": "Illustration"
  },
  {
    "number": "138.1.",
    "text": "Each card has an illustration. It conveys no gameplay information."
  },
  {
    "number": "139.",
    "text": "Units"
  },
  {
    "number": "140.",
    "text": "Unit is:"
  },
  {
    "number": "140.1.",
    "text": "A Game Object"
  },
  {
    "number": "140.1.a.",
    "text": "While on the Board:"
  },
  {
    "number": "140.1.a.1.",
    "text": "Units are at one of several Locations while on the Board: a Battlefield or their Base."
  },
  {
    "number": "140.1.a.2.",
    "text": "Units and their details are Public Information while on the Board."
  },
  {
    "number": "140.1.a.3.",
    "text": "Units can be chosen, affected, or manipulated by spells, affects, or game actions that specify Units."
  },
  {
    "number": "140.1.a.4.",
    "text": "Units can be Killed.\nSee rule 415. Kill for more information."
  },
  {
    "number": "140.1.b.",
    "text": "While in the Trash:"
  },
  {
    "number": "140.1.b.1.",
    "text": "Units are treated as Cards, similar to when in the Hand."
  },
  {
    "number": "140.1.b.2.",
    "text": "They retain the properties of being a Unit, but are not on the Board and thus cannot take actions or be affected by spells, abilities, or game actions that target Units on the Board."
  },
  {
    "number": "140.1.b.3.",
    "text": "Units can be affected by spells and game effects that target Units in the Trash."
  },
  {
    "number": "140.2.",
    "text": "A Card Type"
  },
  {
    "number": "140.2.a.",
    "text": "This is a unique identifier that some spells or abilities will use to restrict what they can choose or affect."
  },
  {
    "number": "140.2.b.",
    "text": "The card type is relevant in all zones."
  },
  {
    "number": "141.",
    "text": "Damage is a marked value that is applied to Units."
  },
  {
    "number": "141.1.",
    "text": "Damage is not a Game Object."
  },
  {
    "number": "141.2.",
    "text": "Damage is a value tracked per-Unit."
  },
  {
    "number": "141.3.",
    "text": "Damage tracks how close a Unit is to being Killed.\nSee rule 415. Kill for more information."
  },
  {
    "number": "141.4.",
    "text": "Damage can be Healed.\nSee rule 405. Heal for more information."
  },
  {
    "number": "142.",
    "text": "Units have multiple Intrinsic Properties unique to them:"
  },
  {
    "number": "142.1.",
    "text": "Tag: A Unit has zero or more Tags representing one or more champions, regions, factions, or species it belongs to."
  },
  {
    "number": "142.1.a.",
    "text": "These have no intrinsic rules or behaviors by themselves."
  },
  {
    "number": "142.1.b.",
    "text": "Spells, abilities, and game actions can reference these types as part of their execution."
  },
  {
    "number": "142.2.",
    "text": "Might: The combat statistic of a Unit. Used to determine a Unit's contribution to Combat, as well as when it is Killed by damaging effects."
  },
  {
    "number": "142.2.a.",
    "text": "If a Unit ever has nonzero damage marked on it equalling or exceeding its Might, it is Killed."
  },
  {
    "number": "142.2.b.",
    "text": "If a unit's Might is ever less than 0, it is treated as 0 for all purposes."
  },
  {
    "number": "142.3.",
    "text": "Units can have damage marked on them."
  },
  {
    "number": "142.3.a.",
    "text": "When spells, abilities, or other game effects deal damage, Units mark that damage on them temporarily. This can be tracked with coins, dice, or other markers, or by memory."
  },
  {
    "number": "142.3.b.",
    "text": "Damage is Healed from Units at two specific times:"
  },
  {
    "number": "142.3.b.1.",
    "text": "At the end of each player's turn."
  },
  {
    "number": "142.3.b.2.",
    "text": "During a Combat Cleanup.\nSee rule 444.1. for more information about Combat Cleanups."
  },
  {
    "number": "142.4.",
    "text": "Units enter the Board exhausted."
  },
  {
    "number": "142.4.a.",
    "text": "This can be altered by Accelerate or similar game effects.\nSee rule 731. Accelerate for more information."
  },
  {
    "number": "143.",
    "text": "Units have the Inherent Ability to perform a Standard Move."
  },
  {
    "number": "143.1.",
    "text": "This action is limited in when it can be performed."
  },
  {
    "number": "143.1.a.",
    "text": "This action can be done any time during a player's Action Phase."
  },
  {
    "number": "143.1.b.",
    "text": "This action cannot be performed during a Closed State."
  },
  {
    "number": "143.1.c.",
    "text": "This action cannot be performed during a Showdown."
  },
  {
    "number": "143.2.",
    "text": "Exhausting the Unit is the Cost for this action."
  },
  {
    "number": "143.3.",
    "text": "Players may perform multiple Units' standard move simultaneously."
  },
  {
    "number": "143.3.a.",
    "text": "When a Move like this is declared by a player, the units' Destination must be the same."
  },
  {
    "number": "143.3.b.",
    "text": "When a Move like this is declared by a player, the Origins do not need to be the same."
  },
  {
    "number": "143.3.c.",
    "text": "The Costs of Exhausting the Units are also paid Simultaneously."
  },
  {
    "number": "143.4.",
    "text": "The Destinations where Units can Move to with their Standard Move are restricted:"
  },
  {
    "number": "143.4.a.",
    "text": "Units may move from their Base to a Battlefield."
  },
  {
    "number": "143.4.a.1.",
    "text": "Units cannot Move to a Battlefield that already has units from 2 other players present."
  },
  {
    "number": "143.4.b.",
    "text": "Units may move from a Battlefield to their Base."
  },
  {
    "number": "143.4.c.",
    "text": "Ganking is a unique ability that affects a Unit's Standard Move"
  },
  {
    "number": "143.4.c.1.",
    "text": "Units with Ganking may use their Standard Move to Move from Battlefield to Battlefield.\nSee rule 736. Ganking for more information."
  },
  {
    "number": "144.",
    "text": "Units may have Activated Abilities."
  },
  {
    "number": "144.1.",
    "text": "Activated Abilities are Game Effects that are written as Costs followed by a \":\", and then succeeded by an effect.\nSee rule 369. Activated Abilities for more information."
  },
  {
    "number": "144.2.",
    "text": "The Activated Ability of Units may be executed at any time during the controlling player's Action Phase during an Open State, and not during a Showdown."
  },
  {
    "number": "144.2.a.",
    "text": "This follows the same process as playing a card.\nSee rule 346. Playing Cards for more information."
  },
  {
    "number": "144.2.a.1.",
    "text": "This behaves, once activated, like a spell without an associated card."
  },
  {
    "number": "145.",
    "text": "Gear"
  },
  {
    "number": "146.",
    "text": "Gear are:"
  },
  {
    "number": "146.1.",
    "text": "A Game Object"
  },
  {
    "number": "146.1.a.",
    "text": "While on the Board."
  },
  {
    "number": "146.1.a.1.",
    "text": "Gear can only be played to a player's Base."
  },
  {
    "number": "146.1.a.2.",
    "text": "Gear and their details are Public Information while on the Board."
  },
  {
    "number": "146.1.a.3.",
    "text": "Gear can be chosen, affected, or manipulated by spells, effects, or game actions that specify Gear."
  },
  {
    "number": "146.1.a.4.",
    "text": "Gear can be Killed.\nSee rule 415. Kill for more information."
  },
  {
    "number": "146.1.b.",
    "text": "While in the Trash"
  },
  {
    "number": "146.1.b.1.",
    "text": "Gear are treated as Cards before Game Objects, similar to the Hand."
  },
  {
    "number": "146.1.b.2.",
    "text": "They retain the properties of being Gear, but are not on the Board and thus cannot take actions or be affected by spells, abilities, or game actions that affect Gear on the Board."
  },
  {
    "number": "146.1.b.3.",
    "text": "Gear can be affected by spells and game effects that affect Gear in the Trash."
  },
  {
    "number": "146.2.",
    "text": "A Card Type"
  },
  {
    "number": "146.2.a.",
    "text": "This is a unique identifier that some spells or abilities will use to restrict what they can choose or affect."
  },
  {
    "number": "146.2.b.",
    "text": "The card type is relevant in all zones."
  },
  {
    "number": "147.",
    "text": "Gear have several Intrinsic Properties unique to them."
  },
  {
    "number": "147.1.",
    "text": "Gear enters play Ready."
  },
  {
    "number": "147.2.",
    "text": "Gear can only be played to a player's Base."
  },
  {
    "number": "147.3.",
    "text": "If a Gear is at a Battlefield for any reason, then it is immediately recalled to its controller's Base as a corrective action.\nSee rule 432. Recalls for more information."
  },
  {
    "number": "148.",
    "text": "Gear may have Activated Abilities."
  },
  {
    "number": "148.1.",
    "text": "Activated Abilities are Game Effects that are written as Costs followed by a \":\", and then succeeded by an effect.\nSee rule 369. Activated Abilities for more information."
  },
  {
    "number": "148.2.",
    "text": "The Activated Ability of Gear may be executed at any time during the controlling player's Action Phase during an Open State, and not during a Showdown."
  },
  {
    "number": "148.2.a.",
    "text": "This follows the same process as playing a card.\nSee rule 346. Playing Cards for more information."
  },
  {
    "number": "148.2.a.1.",
    "text": "This behaves, once activated, like a spell without an associated card."
  },
  {
    "number": "149.",
    "text": "Spells"
  },
  {
    "number": "150.",
    "text": "Spell is a card type."
  },
  {
    "number": "151.",
    "text": "A spell can be played during an Open State Outside of Showdowns on its controller's turn."
  },
  {
    "number": "152.",
    "text": "A spell is controlled by the player who played it."
  },
  {
    "number": "153.",
    "text": "A spell creates a game effect according to its instructions and is then placed in the Trash of the player who owns it."
  },
  {
    "number": "154.",
    "text": "When a spell is successfully played, a player executes the rules text of the spell. This is called Resolving the spell."
  },
  {
    "number": "154.1.",
    "text": "Spells have their rules text executed from top to bottom when they are Resolved."
  },
  {
    "number": "154.2.",
    "text": "If a later part of a spell applies a Replacement Effect that alters earlier parts of the spell, apply those replacement effects as appropriate. Example: A spell says \"Choose a unit. Kill it the next time it takes damage this turn.\" and \"[Legion] — Kill it now instead. (Get the effect if you've played another card this turn.)\" If the Legion condition is satisfied, the unit is killed immediately and the instruction to kill it the next time it takes damage is ignored, even if the unit remains on the board somehow."
  },
  {
    "number": "154.3.",
    "text": "While a spell or ability on the chain is Resolving, no other spells or abilities can be finalized on the chain or resolved, including triggered abilities or game effects that would occur as a result of the execution of the spell."
  },
  {
    "number": "154.3.a.",
    "text": "Finish resolving all effects of a spell before addressing anything the spell may have triggered or caused through execution."
  },
  {
    "number": "155.",
    "text": "Certain Keywords on spells are not executable rules text, but instead intrinsic properties of the spell."
  },
  {
    "number": "155.1.",
    "text": "These determine inherent properties and behaviors of the spell before being played or while on the chain."
  },
  {
    "number": "155.2.",
    "text": "These keywords are:"
  },
  {
    "number": "155.2.a.",
    "text": "Action"
  },
  {
    "number": "155.2.a.1.",
    "text": "This indicates that, in addition to being able to be played during an Open State, this spell may also be played during Open States during Showdowns."
  },
  {
    "number": "155.2.b.",
    "text": "Reaction"
  },
  {
    "number": "155.2.b.1.",
    "text": "Grants all cases and rules of Action."
  },
  {
    "number": "155.2.b.2.",
    "text": "In addition to all prior cases, may also be played during all forms of Closed State."
  },
  {
    "number": "155.2.b.3.",
    "text": "This will result in this spell resolving before spells and abilities that are already on the chain."
  },
  {
    "number": "156.",
    "text": "Runes"
  },
  {
    "number": "157.",
    "text": "Rune is a Card Type."
  },
  {
    "number": "157.1.",
    "text": "A Rune is not a Main Deck card."
  },
  {
    "number": "157.1.a.",
    "text": "This means, despite remaining on the Board until Recycled or otherwise removed from the board, it is not a Permanent."
  },
  {
    "number": "157.2.",
    "text": "Runes are kept in the Rune Deck."
  },
  {
    "number": "157.2.a.",
    "text": "Exactly 12 Rune cards chosen during Deck Construction.\nSee rule 103.3. Rune Deck for more information."
  },
  {
    "number": "157.2.b.",
    "text": "When a Rune is Recycled it is returned to the Rune Deck, not the Main Deck.\nSee rule 403. Recycle for more information."
  },
  {
    "number": "158.",
    "text": "Runes produce the resources needed to pay costs."
  },
  {
    "number": "159.",
    "text": "Runes produce Energy and Power."
  },
  {
    "number": "159.1.",
    "text": "Energy is used to pay numeric Energy costs."
  },
  {
    "number": "159.1.a.",
    "text": "Energy has no Domain."
  },
  {
    "number": "159.1.b.",
    "text": "Energy has no type."
  },
  {
    "number": "159.2.",
    "text": "Power is used to pay Domain-associated Power Costs."
  },
  {
    "number": "159.2.a.",
    "text": "Power has a Domain."
  },
  {
    "number": "159.2.a.1.",
    "text": "Power's Domain usually corresponds to the Domain of the Rune that produced it."
  },
  {
    "number": "159.2.b.",
    "text": "Some Power is Universal and can be used to pay for costs of any Domain."
  },
  {
    "number": "160.",
    "text": "Basic Runes"
  },
  {
    "number": "160.1.",
    "text": "There are six Basic Runes, each with a Domain corresponding to its name:\nFury Rune\nCalm Rune\nMind Rune\nBody Rune\nChaos Rune\nOrder Rune"
  },
  {
    "number": "160.2.",
    "text": "A Basic Rune always has the following two Abilities:"
  },
  {
    "number": "160.2.a.",
    "text": "[E]: [Reaction] — Add [1]."
  },
  {
    "number": "160.2.b.",
    "text": "Recycle this: [Reaction] — Add [C]."
  },
  {
    "number": "160.2.b.1.",
    "text": "The Power added this way corresponds to the Domain of the Rune that is being Recycled."
  },
  {
    "number": "161.",
    "text": "Rune Pools"
  },
  {
    "number": "162.",
    "text": "The Rune Pool is a conceptual collection of a player's available Energy and Power available to pay Costs."
  },
  {
    "number": "162.1.",
    "text": "When a card adds Energy or Power, it is added to the controlling player's Rune Pool."
  },
  {
    "number": "162.2.",
    "text": "Players must first add Energy and Power to their Rune Pool in order to be able to spend it to play cards or pay for Abilities with costs."
  },
  {
    "number": "162.3.",
    "text": "Energy and Power do not have a physical marker or tracker, although players may wish to use a physical tracker if they are retaining unspent Energy and Power over the course of their turn."
  },
  {
    "number": "163.",
    "text": "Every player's Rune Pool empties at the end of each player's draw phase and the end of each player's turn."
  },
  {
    "number": "163.1.",
    "text": "Any unspent Energy or Power are lost."
  },
  {
    "number": "164.",
    "text": "All Abilities that include the action \"Add\" are abilities that are adding Energy or Power to the Rune Pool.\nSee rule 416. Add for more information."
  },
  {
    "number": "165.",
    "text": "Battlefields"
  },
  {
    "number": "166.",
    "text": "Battlefields are Game Objects."
  },
  {
    "number": "166.1.",
    "text": "Battlefields are Owned by a player."
  },
  {
    "number": "166.2.",
    "text": "Battlefields are not shuffled into Decks at the start of a game."
  },
  {
    "number": "166.2.a.",
    "text": "Battlefields are not played during the course of regular play."
  },
  {
    "number": "166.2.b.",
    "text": "Battlefields are established at the start of a game and remain in place for the duration of regular play."
  },
  {
    "number": "166.3.",
    "text": "Battlefields cannot be Killed during the course of regular play."
  },
  {
    "number": "166.4.",
    "text": "Battlefields cannot be Moved."
  },
  {
    "number": "166.5.",
    "text": "Battlefields are Locations."
  },
  {
    "number": "166.5.a.",
    "text": "Battlefields can be Origins of moves."
  },
  {
    "number": "166.5.b.",
    "text": "Battlefields can be Destinations of moves."
  },
  {
    "number": "166.6.",
    "text": "Any number of Units can be present at a Battlefield."
  },
  {
    "number": "166.7.",
    "text": "Battlefields can be targeted by spells or game effects."
  },
  {
    "number": "166.8.",
    "text": "Battlefields can have Passive Abilities.\nSee rule 360. Passive Abilities for more information."
  },
  {
    "number": "166.9.",
    "text": "Battlefields can have Triggered Abilities.\nSee rule 375. Triggered Abilities for more information."
  },
  {
    "number": "167.",
    "text": "Battlefields are not Permanents."
  },
  {
    "number": "168.",
    "text": "The number of Battlefields on the Board is determined by the Mode of Play."
  },
  {
    "number": "169.",
    "text": "Legends"
  },
  {
    "number": "170.",
    "text": "Legends are Game Objects."
  },
  {
    "number": "170.1.",
    "text": "Legends are Owned by a player."
  },
  {
    "number": "170.2.",
    "text": "Legends are not shuffled into Decks at the start of a game."
  },
  {
    "number": "170.2.a.",
    "text": "Legends are not played during the course of regular play."
  },
  {
    "number": "170.2.b.",
    "text": "Legends are established at the start of a game, and remain in place for the duration of regular play."
  },
  {
    "number": "170.3.",
    "text": "Legends cannot be Killed during the course of regular play."
  },
  {
    "number": "170.4.",
    "text": "Legends cannot be Moved."
  },
  {
    "number": "170.5.",
    "text": "Legends can be targeted by spells or game effects."
  },
  {
    "number": "170.6.",
    "text": "Legends can have Passive Abilities.\nSee rule 360. Passive Abilities for more information."
  },
  {
    "number": "170.7.",
    "text": "Legends can have Triggered Abilities.\nSee rule 375. Triggered Abilities for more information."
  },
  {
    "number": "170.8.",
    "text": "Legends can have Activated Abilities.\nSee rule 369. Activated Abilities for more information."
  },
  {
    "number": "171.",
    "text": "Legends are not Permanents."
  },
  {
    "number": "172.",
    "text": "Legends may have one or more Domains."
  },
  {
    "number": "172.1.",
    "text": "The Legend determines the Domain Identity of cards its owner can include.\nSee rule 101. Deck Construction for more information."
  },
  {
    "number": "173.",
    "text": "Tokens"
  },
  {
    "number": "174.",
    "text": "Tokens are Game Objects created by spells and abilities during play."
  },
  {
    "number": "175.",
    "text": "Tokens can be represented by anything. Printed tokens are included in Riftbound booster packs, but they are not required to play a token."
  },
  {
    "number": "176.",
    "text": "A token's controller is the controller of the spell or ability that created it, unless the token's type innately determines control or that spell or ability specifies that a different player is the token's controller."
  },
  {
    "number": "177.",
    "text": "A token's owner is the player who controlled the effect that created it."
  },
  {
    "number": "178.",
    "text": "The effect that creates a token may specify the conditions or circumstances under which it enters the board. These stipulations may alter the usual steps for playing a card."
  },
  {
    "number": "178.1.",
    "text": "The effect may state that the token enters ready or exhausted, if that state is contrary to the default for the token's type."
  },
  {
    "number": "178.2.",
    "text": "The effect may restrict the location to which the token may be played."
  },
  {
    "number": "178.3.",
    "text": "The effect may grant temporary abilities or modifications to the token."
  },
  {
    "number": "179.",
    "text": "Tokens are not cards."
  },
  {
    "number": "179.1.",
    "text": "Tokens have some properties in common with cards."
  },
  {
    "number": "179.1.a.",
    "text": "Tokens are played by their owner if their card type is played, following all the applicable steps for playing a card plus any restrictions or modifications from the effect that created the token.\nSee rule 346. Playing Cards for more information."
  },
  {
    "number": "179.1.b.",
    "text": "Token units have a Might."
  },
  {
    "number": "179.1.c.",
    "text": "Tokens may have one or more tags."
  },
  {
    "number": "179.1.d.",
    "text": "Tokens have a type. They follow all rules for their type unless otherwise specified. Example: A token unit is a unit. It enters exhausted, can take the standard move action, deals damage equal to its Might in combat, is destroyed if it takes damage equal to or greater than its might, can be chosen or otherwise affected by spells or abilities that choose or affect units, etc."
  },
  {
    "number": "179.2.",
    "text": "Tokens differ from cards in some ways."
  },
  {
    "number": "179.2.a.",
    "text": "Tokens do not have costs."
  },
  {
    "number": "179.2.b.",
    "text": "Tokens do not have domains."
  },
  {
    "number": "180.",
    "text": "Tokens are created on the board and cannot exist elsewhere."
  },
  {
    "number": "180.1.",
    "text": "If a token is put into any Non-Board Zone, it ceases to exist immediately after moving to its new zone."
  },
  {
    "number": "181.",
    "text": "The spell or ability that creates a token specifies some of its characteristics. It may have other characteristics, as listed below."
  },
  {
    "number": "181.1.",
    "text": "A 1[M] Recruit token is a domainless unit token with 1 Might and the Recruit tag."
  },
  {
    "number": "181.2.",
    "text": "A 3[M] Sprite token with Temporary is a domainless unit token with 3 Might, the Fae tag, and the Temporary keyword.\nSee rule 742. Temporary for more information."
  },
  {
    "number": "182.",
    "text": "Control"
  },
  {
    "number": "183.",
    "text": "Control is the concept of a player having influence of a Game Object and applies differently to different card types."
  },
  {
    "number": "184.",
    "text": "Battlefields"
  },
  {
    "number": "184.1.",
    "text": "Control is established over Battlefields through the course of play."
  },
  {
    "number": "184.2.",
    "text": "Control is a binary state for Battlefields and an Identifier for players."
  },
  {
    "number": "184.2.a.",
    "text": "A Battlefield is Controlled or Uncontrolled."
  },
  {
    "number": "184.2.b.",
    "text": "A Battlefield is Controlled by a specific player or Controlled by no one."
  },
  {
    "number": "184.3.",
    "text": "Control can be Contested through the course of play."
  },
  {
    "number": "184.3.a.",
    "text": "Contested is a temporary status applied to the battlefield when a Unit controlled by a Player who does not currently Control that Battlefield Moves or otherwise becomes present there."
  },
  {
    "number": "184.3.a.1.",
    "text": "Units moving to or being played to a battlefield apply Contested status if that battlefield is not already contested and that Unit’s controller does not already control that battlefield."
  },
  {
    "number": "184.3.b.",
    "text": "A Battlefield remains Contested until Control is established or re-established."
  },
  {
    "number": "184.3.c.",
    "text": "While a Battlefield remains Contested, Control of a Battlefield cannot change."
  },
  {
    "number": "184.3.d.",
    "text": "The state of a Battlefield being Contested is used to determine when Combat should occur, when a Showdown without a Combat should occur, and when Control will change."
  },
  {
    "number": "184.3.e.",
    "text": "At this time Game Effects cannot reference this status."
  },
  {
    "number": "184.4.",
    "text": "Control is established by having Units at a Battlefield at the end of a Showdown or Combat after applying the contested status."
  },
  {
    "number": "184.4.a.",
    "text": "If a player controls Units at a Battlefield, outside of Combat, they maintain Control of that Battlefield for as long as they have Units at that Battlefield."
  },
  {
    "number": "184.4.b.",
    "text": "A player maintains control of a Battlefield while it is being Contested by an opponent."
  },
  {
    "number": "184.4.c.",
    "text": "If a player has no Units at a Battlefield, they lose Control of that Battlefield immediately, unless it is Contested."
  },
  {
    "number": "184.5.",
    "text": "Control is a constant state."
  },
  {
    "number": "184.6.",
    "text": "Control of a Battlefield determines Control of its Abilities."
  },
  {
    "number": "184.6.a.",
    "text": "While a Battlefield is Controlled, its Controller controls its Abilities. That player takes responsibility for adding them to the Chain if applicable, and makes all choices required by them unless otherwise specified."
  },
  {
    "number": "184.6.b.",
    "text": "While a Battlefield is Uncontrolled, its Abilities are also Uncontrolled. The Turn Player takes responsibility for adding them to the Chain if applicable, makes all choices required by them unless otherwise specified, and is treated as their Controller if any game rule or effect requires one. Example: The Arena’s Greatest is a battlefield that reads “At the start of each player's first Beginning Phase, that player gains 1 point.” This ability will usually trigger while the battlefield has no controller. If it does, the Turn Player goes through the steps of adding the ability to the chain and receives priority after doing so, exactly as if they controlled the ability."
  },
  {
    "number": "184.6.c.",
    "text": "“You” in a battlefield’s abilities refers to the battlefield’s Controller, as does the implied “you” in instructions like “draw 1.” If the battlefield has no Controller, “you” refers to no one, and all such instructions are ignored."
  },
  {
    "number": "185.",
    "text": "Everything Else"
  },
  {
    "number": "185.1.",
    "text": "When a player Plays a Card or other Game Object, they are established as that Game Object's Controller."
  },
  {
    "number": "185.2.",
    "text": "For Spells, they are the Spell's Controller."
  },
  {
    "number": "185.2.a.",
    "text": "That player chooses targets."
  },
  {
    "number": "185.2.b.",
    "text": "That player chooses modes."
  },
  {
    "number": "185.2.c.",
    "text": "That player pays costs."
  },
  {
    "number": "185.3.",
    "text": "For Permanents and Runes, when they Enter the Board, that player is assigned as that Game Object's Controller."
  },
  {
    "number": "185.3.a.",
    "text": "That player may make decisions about the Game Object's Inherent Abilities."
  },
  {
    "number": "185.3.b.",
    "text": "That player may make decisions about the Game Object's Unique Abilities."
  },
  {
    "number": "185.3.c.",
    "text": "That player may make decisions about any game effects or decisions necessary while the card is being played."
  },
  {
    "number": "185.3.d.",
    "text": "That player may make decisions about any game effects created from \"When you play me\" effects of Permanents."
  },
  {
    "number": "185.4.",
    "text": "For Abilities, they are the Ability’s Controller."
  },
  {
    "number": "185.4.a.",
    "text": "By default, the Controller of an Ability’s Source is the Controller of that Ability."
  },
  {
    "number": "185.4.b.",
    "text": "Changes to Control of an Ability’s Source do not change Control of that Ability."
  },
  {
    "number": "185.4.c.",
    "text": "That player chooses targets."
  },
  {
    "number": "185.4.d.",
    "text": "That player chooses modes."
  },
  {
    "number": "185.4.e.",
    "text": "That player pays costs."
  },
  {
    "number": "186.",
    "text": "When a game effect or rules text refers to the Controller of a specific object, it can be referring to either context interchangeably."
  },
  {
    "number": "186.1.",
    "text": "The method of assignment of control is different, but the status of Control is the same across all Game Objects."
  },
  {
    "number": "300.",
    "text": "Playing the Game"
  },
  {
    "number": "301.",
    "text": "The Turn"
  },
  {
    "number": "302.",
    "text": "Play continues cyclically until one player wins."
  },
  {
    "number": "303.",
    "text": "The phases of a turn are rigid, but the actions taken during those steps can be done in any order, unless otherwise specified."
  },
  {
    "number": "303.1.",
    "text": "Game Actions of any nature are performed one at a time and are executed completely."
  },
  {
    "number": "303.2.",
    "text": "Game Actions cannot be performed simultaneously for any reason."
  },
  {
    "number": "303.2.a.",
    "text": "If one or more actions, game effects, or Triggered Abilities are activated simultaneously, then Turn Order is referenced to organize the sequence of actions.\nSee rule 375. Triggered Abilities for more information."
  },
  {
    "number": "304.",
    "text": "The Turn Player is the player taking the current turn."
  },
  {
    "number": "305.",
    "text": "When there are no items on the Chain and the Turn Player cannot or chooses not to perform any Discretionary Actions, the current phase or step of the turn ends and the next phase, step, or turn begins."
  },
  {
    "number": "306.",
    "text": "The Turn Player changes when the current Turn Player reaches the End of all of the Phases of their Turn."
  },
  {
    "number": "307.",
    "text": "States of the Turn"
  },
  {
    "number": "308.",
    "text": "At any given time, the turn is in either a Neutral State or a Showdown State."
  },
  {
    "number": "308.1.",
    "text": "If a Showdown is in progress, the turn is in a Showdown State."
  },
  {
    "number": "308.1.a.",
    "text": "Only cards and abilities with the Action or Reaction keywords can be played or activated in a Showdown State."
  },
  {
    "number": "308.2.",
    "text": "If no Showdown is in progress, the turn is in a Neutral State."
  },
  {
    "number": "309.",
    "text": "At any given time, the turn is in either an Open State or a Closed State."
  },
  {
    "number": "309.1.",
    "text": "If a Chain exists, the turn is in a Closed State."
  },
  {
    "number": "309.1.a.",
    "text": "Only cards and abilities with the Reaction keyword can be played or activated in a Closed State."
  },
  {
    "number": "309.2.",
    "text": "If no Chain exists, the turn is in an Open State."
  },
  {
    "number": "310.",
    "text": "These descriptions can be combined, such that the turn is always in one of these four states:"
  },
  {
    "number": "310.1.",
    "text": "Neutral Open: There is no Showdown in progress and no Chain exists."
  },
  {
    "number": "310.1.a.",
    "text": "By default, cards can be played and abilities activated only when a player has priority on their turn in a Neutral Open state."
  },
  {
    "number": "310.2.",
    "text": "Neutral Closed: There is no Showdown in progress and a Chain exists."
  },
  {
    "number": "310.3.",
    "text": "Showdown Open: A Showdown is in progress and no Chain exists."
  },
  {
    "number": "310.4.",
    "text": "Showdown Closed: A Showdown is in progress and a Chain exists."
  },
  {
    "number": "311.",
    "text": "Priority and Focus"
  },
  {
    "number": "312.",
    "text": "At any given time, up to one player has Priority."
  },
  {
    "number": "312.1.",
    "text": "Priority is the singular exclusive right to take Discretionary Actions.\nSee rule 398.1. Discretionary Actions for more information."
  },
  {
    "number": "312.1.a.",
    "text": "The player with Priority can take appropriately timed Discretionary Actions."
  },
  {
    "number": "312.1.b.",
    "text": "If no player has Priority, no player can take Discretionary Actions."
  },
  {
    "number": "312.1.b.1.",
    "text": "Players can always take and make choices for Limited Actions when instructed, regardless of Priority."
  },
  {
    "number": "312.2.",
    "text": "A player receives Priority at the following times:"
  },
  {
    "number": "312.2.a.",
    "text": "When the turn is in a Neutral Open State during their Action Phase."
  },
  {
    "number": "312.2.b.",
    "text": "When the turn is in a Showdown State and they gain Focus."
  },
  {
    "number": "312.2.c.",
    "text": "When the turn is in a Closed State and they control the next item on the Chain."
  },
  {
    "number": "312.2.d.",
    "text": "When the turn is in a Closed State, they are the next Player in Turn Order, and the player with Priority passes."
  },
  {
    "number": "312.3",
    "text": "When a player is granted Priority, it is either created if no player has it or taken from the player with Priority."
  },
  {
    "number": "313.",
    "text": "At any given time, up to one player has Focus."
  },
  {
    "number": "313.1.",
    "text": "Focus is the permission to take appropriately timed Discretionary Actions when the turn is in a Showdown Open State.\nSee rule 307. States of the Turn for more information."
  },
  {
    "number": "313.1.a.",
    "text": "The player with Focus must obey any additional restrictions on which Discretionary Actions may be performed.\nExample: A player with Focus may not play spells or activate abilities that don't have the Action or Reaction keywords."
  },
  {
    "number": "313.2.",
    "text": "A player who gains Focus also gains Priority."
  },
  {
    "number": "313.3.",
    "text": "A player who passes Priority retains Focus."
  },
  {
    "number": "313.4",
    "text": "A player may not make discretionary actions with Focus unless they also possess Priority."
  },
  {
    "number": "313.5.",
    "text": "If the turn is in a Neutral State, no player has Focus."
  },
  {
    "number": "314.",
    "text": "Phases of the Turn"
  },
  {
    "number": "315.",
    "text": "Start of Turn"
  },
  {
    "number": "315.1.",
    "text": "Awaken Phase"
  },
  {
    "number": "315.1.a.",
    "text": "The Turn Player readies all Game Objects they control that are able to be readied.\nSee rule 402. Ready for more information."
  },
  {
    "number": "315.2.",
    "text": "Beginning Phase"
  },
  {
    "number": "315.2.a.",
    "text": "Beginning Step"
  },
  {
    "number": "315.2.a.1.",
    "text": "At the start of Beginning Phase game effects take place."
  },
  {
    "number": "315.2.b.",
    "text": "Scoring Step"
  },
  {
    "number": "315.2.b.1.",
    "text": "Holding occurs at this time.\nSee rule 445. Scoring for more information."
  },
  {
    "number": "315.2.b.2.",
    "text": "Reminder: In Modes of Play with Teams, Battlefields held by a Teammate of the Turn Player during this phase are disqualified from being scored this turn by the Turn Player."
  },
  {
    "number": "315.2.c.",
    "text": "Specific game effects or abilities will reference this timing and phase as necessary."
  },
  {
    "number": "315.3.",
    "text": "Channel Phase"
  },
  {
    "number": "315.3.a.",
    "text": "The Turn Player gains their additional runes for the turn."
  },
  {
    "number": "315.3.b.",
    "text": "The Turn Player channels 2 runes from their Rune Deck.\nSee rule 417. Channel for more information."
  },
  {
    "number": "315.3.b.1.",
    "text": "If there are fewer than 2 runes in the Rune Deck, they channel as many as possible."
  },
  {
    "number": "315.3.c.",
    "text": "Perform any actions as instructed by game objects during this time."
  },
  {
    "number": "315.4.",
    "text": "Draw Phase"
  },
  {
    "number": "315.4.a.",
    "text": "The Turn Player gains their additional card for the turn."
  },
  {
    "number": "315.4.b.",
    "text": "The Turn Player draws 1."
  },
  {
    "number": "315.4.b.1.",
    "text": "If there are no cards remaining in their Main Deck to draw, the Turn Player has been Burned Out.\nSee rule 418. Burn Out for more information."
  },
  {
    "number": "315.4.b.2.",
    "text": "After completing the Burn Out the Turn Player still Draws 1."
  },
  {
    "number": "315.4.c.",
    "text": "Perform any actions as instructed by game objects during this time."
  },
  {
    "number": "315.4.d.",
    "text": "As the Draw Phase ends, each player's Rune Pool empties.\nSee rule 161. Rune Pools for more information."
  },
  {
    "number": "316.",
    "text": "Action Phase"
  },
  {
    "number": "316.1.",
    "text": "When all steps of the Start of Turn have been completed, the Action Phase begins."
  },
  {
    "number": "316.2.",
    "text": "The Action Phase has no defined structure."
  },
  {
    "number": "316.2.a.",
    "text": "A player may take any number of Discretionary Actions they are able to perform during this phase.\nSee rule 398.1. Discretionary Actions for more information."
  },
  {
    "number": "316.2.b.",
    "text": "This is denoted as a Neutral Open State, and only the Turn Player has the ability to play spells or activate abilities.\nSee rule 307. States of the Turn for more information."
  },
  {
    "number": "316.2.b.1.",
    "text": "In Modes of Play with teammates, the Turn Player's teammates may play spells and activate abilities, including ones without Action or Reaction."
  },
  {
    "number": "316.2.c.",
    "text": "In Modes of Play with Teammates, spells may be played by Teammates of the Turn Player during this time, but the actions of the Turn Player take precedence."
  },
  {
    "number": "316.3.",
    "text": "As a result of a player taking Discretionary Actions, one or more structured phases may occur."
  },
  {
    "number": "316.4.",
    "text": "Combat"
  },
  {
    "number": "316.4.a.",
    "text": "A Combat phase occurs as a result of Units controlled by opposing players being present at the same Battlefield."
  },
  {
    "number": "316.4.b.",
    "text": "This could be the result of a Standard Move Standard Action, a Spell, or other Game Effect."
  },
  {
    "number": "316.4.c.",
    "text": "The source effect does not change the structure or flow of Combat once initiated."
  },
  {
    "number": "316.4.d.",
    "text": "A Combat can only occur between two players.\nSee rule 437. Combat for more information."
  },
  {
    "number": "316.4.e.",
    "text": "Play proceeds following the steps of combat.\nSee rule 441. Steps of Combat for more information."
  },
  {
    "number": "316.4.f.",
    "text": "Combat will also include a Showdown."
  },
  {
    "number": "316.5.",
    "text": "Showdowns"
  },
  {
    "number": "316.5.a.",
    "text": "A Showdown occurs when a Combat occurs."
  },
  {
    "number": "316.5.a.1.",
    "text": "Showdowns that occur as a result of Combat are a Sub-Phase of Combat."
  },
  {
    "number": "316.5.b.",
    "text": "A Showdown is marked as Staged at a Battlefield when the Contested status is applied to a Battlefield with no current controller."
  },
  {
    "number": "316.5.b.1.",
    "text": "Showdowns that occur as a result of a player moving to an empty Battlefield are a stand-alone Phase and do not create a Combat."
  },
  {
    "number": "316.5.c.",
    "text": "A Showdown is a structured Window of Opportunity where Players may play cards and activate abilities with Action or Reaction.\nSee rule 337. Showdowns for more information."
  },
  {
    "number": "316.6.",
    "text": "When a player has no more Discretionary Actions they wish to execute, they must indicate they are ending their turn."
  },
  {
    "number": "316.6.a.",
    "text": "This ends the Action Phase."
  },
  {
    "number": "316.6.b.",
    "text": "Play proceeds to the End of Turn."
  },
  {
    "number": "317.",
    "text": "End of Turn Phase"
  },
  {
    "number": "317.1.",
    "text": "Ending Step"
  },
  {
    "number": "317.1.a.",
    "text": "At the end of the turn Game Effects take place."
  },
  {
    "number": "317.1.b.",
    "text": "Specific game effects and abilities will reference this timing and phase as necessary."
  },
  {
    "number": "317.2.",
    "text": "End of Turn Cleanup"
  },
  {
    "number": "317.2.a.",
    "text": "Invoke an End of Turn Special Cleanup.\nSee rule 318. Cleanups for more information."
  },
  {
    "number": "317.2.b.",
    "text": "Insert “2c. Heal all Units.”"
  },
  {
    "number": "317.3.",
    "text": "Expiration Step"
  },
  {
    "number": "317.3.a.",
    "text": "All \"this turn\" effects expire simultaneously."
  },
  {
    "number": "317.3.b.",
    "text": "As the Expiration Step ends, all players' Rune Pools empty. Any unspent Energy and Power are lost."
  },
  {
    "number": "317.4.",
    "text": "The Turn Player then becomes the next player in Turn Order."
  },
  {
    "number": "318.",
    "text": "Cleanups"
  },
  {
    "number": "319.",
    "text": "A Cleanup occurs at the following times:"
  },
  {
    "number": "319.1.",
    "text": "After the game transitions to or from an Open or Closed state"
  },
  {
    "number": "319.2.",
    "text": "After the game transitions between Phases"
  },
  {
    "number": "319.3.",
    "text": "After a Pending Item becomes a Legal Item on the Chain"
  },
  {
    "number": "319.4.",
    "text": "After a Chain Item is removed from the Chain for any reason"
  },
  {
    "number": "319.5.",
    "text": "After any number of Game Objects enter or leave the Board"
  },
  {
    "number": "319.6.",
    "text": "After the status of any number of Game Objects changes for any reason"
  },
  {
    "number": "319.7.",
    "text": "After a Move is completed"
  },
  {
    "number": "320.",
    "text": "While a Cleanup is occurring, Chain Items cannot be Resolved."
  },
  {
    "number": "320.1.",
    "text": "New Pending Items can be added, but Legal Items cannot be executed and Priority and Focus are not passed or awarded."
  },
  {
    "number": "321.",
    "text": "If an event occurs during a Cleanup that qualifies for a Cleanup, another Cleanup will occur immediately after the first completes, repeating until a Cleanup occurs with no new change in the game’s state."
  },
  {
    "number": "322.",
    "text": "When a Cleanup occurs, the following steps occur in order:"
  },
  {
    "number": "322.1.",
    "text": "1. If a player has as many points as the Victory Score, that player wins."
  },
  {
    "number": "322.2",
    "text": "2. Handle outstanding board state"
  },
  {
    "number": "322.3",
    "text": "2a. All Units that have non-zero Damage marked on them equalling or exceeding their Might that have Deathknell abilities will trigger their Deathknell ability now, making note of their current location, attributes, and other information relevant to add the trigger as a Pending Item\nSee rule 734 Deathknell for more information."
  },
  {
    "number": "322.4.",
    "text": "2b. All Units that have non-zero Damage marked on them equalling or exceeding their Might are killed and placed in their owners' Trash."
  },
  {
    "number": "322.5.",
    "text": "3. Assign or Remove the Attacker or Defender designation from Units as needed if there is a Combat in progress"
  },
  {
    "number": "322.5.a.",
    "text": "If there are Units present at the Battlefield the Combat is taking place at, but do not have a designation, they gain the same designation as their Controller now"
  },
  {
    "number": "322.5.b.",
    "text": "If there are Units present at the Battlefield the Combat is taking place at, but have the opposite designation of their controller, they lose that designation, and gain the same designation as their controller now"
  },
  {
    "number": "322.5.c.",
    "text": "If there are Units at locations other than the Battlefield that the Combat is taking place at, but have either Attacker or Defender designations, they lose those designations now"
  },
  {
    "number": "322.6.",
    "text": "4. Battlefields with no Units occupying them and no Contested status become Uncontrolled."
  },
  {
    "number": "322.7.",
    "text": "5. Recall all Gear at Battlefields. Remove all Hidden cards from all Battlefields that are not controlled by the same player and place them in their owner's Trash."
  },
  {
    "number": "322.8.",
    "text": "6. Mark a Showdown as Staged at each Battlefield that Contested was applied to that is Uncontrolled."
  },
  {
    "number": "322.8.a",
    "text": "The Showdown remains Staged at each Battlefield that is Contested and has only units present controlled by the player that applied Contested"
  },
  {
    "number": "322.9",
    "text": "6a. If Units of an opposing player are present at a Battlefield that has a Showdown staged before it can be Opened, the Showdown will cease being Staged"
  },
  {
    "number": "322.10.",
    "text": "7. Mark a Combat as Staged at each Battlefield that Contested was applied to that have Units present controlled by opposing players."
  },
  {
    "number": "322.10.a.",
    "text": "The Combat remains Staged at that Battlefield as long as there are Units present from two opposing players there."
  },
  {
    "number": "322.11",
    "text": "7a. If Units of two opposing players are no longer present at a Battlefield that has a Combat Staged before it has opened, the Combat will cease being Staged"
  },
  {
    "number": "322.12.",
    "text": "8. Finalize any Pending Items on the Chain"
  },
  {
    "number": "322.13.",
    "text": "9. If the current state is a Neutral Open State and one or more Showdowns are Staged, the Turn Player chooses one of those Battlefields. A Showdown begins there."
  },
  {
    "number": "322.14.",
    "text": "10. If the current state is a Neutral Open State and Combat is Staged at one or more Battlefields, the Turn Player chooses one of those Battlefields. Combat begins there."
  },
  {
    "number": "323.",
    "text": "Special Cleanups are Cleanup steps invoked at specific times that have additional steps not present in a normal Cleanup."
  },
  {
    "number": "323.1.",
    "text": "When a Special Cleanup is invoked, the unique steps added will be inserted and defined by the sub-section that invokes it.\nExample: When a Combat Cleanup is invoked, the Combat section defines what steps are added to the Cleanup."
  },
  {
    "number": "323.2.",
    "text": "If events during a Special Cleanup require another Cleanup, a normal Cleanup is invoked, not another iteration of the Special Cleanup."
  },
  {
    "number": "324.",
    "text": "Chains and Showdowns"
  },
  {
    "number": "325.",
    "text": "Players can act during the following Windows of Opportunity that occur during the course of regular play:"
  },
  {
    "number": "325.1.",
    "text": "During a Chain"
  },
  {
    "number": "325.2.",
    "text": "During a Showdown"
  },
  {
    "number": "326.",
    "text": "Chains"
  },
  {
    "number": "327.",
    "text": "The Chain is a Non-Board Zone that temporarily exists whenever a card is played or an ability is activated."
  },
  {
    "number": "327.1.",
    "text": "Cards are placed here as part of the process of being played."
  },
  {
    "number": "327.2.",
    "text": "Abilities are queued here as part of the process of resolving.\nSee rule 357. Abilities for more information."
  },
  {
    "number": "328.",
    "text": "Cards and abilities added to the chain are added as Pending Chain Items that become Finalized Chain Items."
  },
  {
    "number": "328.1.",
    "text": "Pending Items are on the Chain."
  },
  {
    "number": "328.2.",
    "text": "Chain Items are Pending until the “Check Legality” step of playing a card.\nSee rule 346. Playing Cards for more information."
  },
  {
    "number": "328.3.",
    "text": "When a Pending Chain Item is no longer Pending it is finalized and becomes a Finalized Chain Item."
  },
  {
    "number": "329.",
    "text": "The Chain exists as long as a Chain Item is on it."
  },
  {
    "number": "329.1.",
    "text": "Only one Chain can exist at a time."
  },
  {
    "number": "329.2.",
    "text": "If a card would begin to be played while a Chain already exists, it is placed on the existing Chain."
  },
  {
    "number": "330.",
    "text": "The State of the Turn is partially determined by whether or not the Chain currently exists."
  },
  {
    "number": "330.1.",
    "text": "The turn is said to be in a Closed State if a Chain exists."
  },
  {
    "number": "330.1.a.",
    "text": "Cards of all Categories, by default, cannot be played during a Closed State."
  },
  {
    "number": "330.1.b.",
    "text": "Card abilities, by default, cannot be played during a Closed State."
  },
  {
    "number": "330.2.",
    "text": "The turn is said to be in an Open State if no Chain exists."
  },
  {
    "number": "331.",
    "text": "Steps of Resolving Chain Items"
  },
  {
    "number": "332.",
    "text": "Whenever a card or token is played or an ability is activated or triggered, a Chain is created."
  },
  {
    "number": "332.1.",
    "text": "The player that created the chain becomes the first Active Player."
  },
  {
    "number": "332.2.",
    "text": "The Active Player is a designator similar to, but distinct from, Turn Player."
  },
  {
    "number": "332.3.",
    "text": "Similar to the Turn Player, this designation will pass between players over the course of play."
  },
  {
    "number": "333.",
    "text": "Step 1: Finalize"
  },
  {
    "number": "333.1.",
    "text": "If one or more Items are Pending, their controllers must complete the steps of Playing those Pending Items until they are Finalized Items or leave the Chain."
  },
  {
    "number": "333.1.a.",
    "text": "This process does not pass Priority."
  },
  {
    "number": "333.1.b.",
    "text": "Each Item is Finalized in the order it was appended to the Chain."
  },
  {
    "number": "333.1.c.",
    "text": "Abilities that Add resources, Units, and Gear resolve immediately when Finalized and do not progress to Step 2: Execute.\nSee rule 346. Playing Cards for more information."
  },
  {
    "number": "333.1.c.1.",
    "text": "If the Chain is empty, play proceeds in an Open State."
  },
  {
    "number": "333.1.c.2.",
    "text": "If the Chain is not empty and there are one or more Pending Items, repeat Step 1."
  },
  {
    "number": "333.1.c.3.",
    "text": "If the Chain is not empty and there are no Pending Items, the controller of the newest item on the chain gains Priority and becomes the Active Player. Proceed to Step 2: Execute."
  },
  {
    "number": "334.",
    "text": "Step 2: Execute"
  },
  {
    "number": "334.1.",
    "text": "The Active Player may do any the following:"
  },
  {
    "number": "334.1.a.",
    "text": "Play a Card that is legally timed."
  },
  {
    "number": "334.1.a.1.",
    "text": "Cards, by default, cannot be played during a Closed State."
  },
  {
    "number": "334.1.a.2.",
    "text": "A Legally Timed Card would be a Card with Reaction."
  },
  {
    "number": "334.1.a.3.",
    "text": "Other exceptions may be created during regular play."
  },
  {
    "number": "334.1.a.4.",
    "text": "The card will be added to the chain as a Pending Item, following the steps of playing a card."
  },
  {
    "number": "334.1.a.5.",
    "text": "This can be an additional card to the item that Started the Chain in the case of the first Active Player after creating the Chain."
  },
  {
    "number": "334.1.a.6.",
    "text": "Whether a Card is legally timed is evaluated during the “Check Legality” step of Playing a Card.\nSee rule 346. Playing Cards for more information."
  },
  {
    "number": "334.1.a.7.",
    "text": "Playing a card will create one or more Pending Items. Return to Step 1: Finalize."
  },
  {
    "number": "334.1.b.",
    "text": "Activate Abilities of Game Objects that are legally timed.\nSee rule 386. Playing or Activating Abilities for more information."
  },
  {
    "number": "334.1.b.1.",
    "text": "All rules for legally timed cards apply to legally timed abilities."
  },
  {
    "number": "334.1.b.2.",
    "text": "Activating abilities will create one or more Pending Items. Return to Step 1: Finalize."
  },
  {
    "number": "334.1.c.",
    "text": "Pass Priority"
  },
  {
    "number": "334.1.c.1.",
    "text": "The Active Player passes Priority to the next Player in Turn Order. Proceed to Step 3: Pass."
  },
  {
    "number": "335.",
    "text": "Step 3: Pass"
  },
  {
    "number": "335.1.",
    "text": "If all players have passed Priority without adding any items to the Chain, proceed to Step 4: Resolve."
  },
  {
    "number": "335.2.",
    "text": "Otherwise, the Active Player passes Priority to the next Player in Turn Order. Return to Step 3: Execute."
  },
  {
    "number": "336.",
    "text": "Step 4: Resolve"
  },
  {
    "number": "336.1.",
    "text": "The newest item on the Chain resolves. Execute its game effects in their entirety.\nSee rule 346. Playing Cards for more information on resolving spells.\nSee rule 386. Playing or Activating Abilities for more information on resolving abilities."
  },
  {
    "number": "336.2.",
    "text": "If the Chain is empty, play proceeds in an Open State."
  },
  {
    "number": "336.3.",
    "text": "If the Chain is not empty and there are one or more Pending Items, return to Step 1: Finalize."
  },
  {
    "number": "336.4.",
    "text": "If the Chain is not empty and there are no Pending Items, the controller of the newest item on the chain gains Priority and becomes the Active Player. Return to Step 2: Execute."
  },
  {
    "number": "337.",
    "text": "Showdowns"
  },
  {
    "number": "338.",
    "text": "A Showdown is a Window of Opportunity in which Players have an Open State in which they may play Spells in an alternating fashion."
  },
  {
    "number": "338.1.",
    "text": "Each spell played this way creates a Chain as normal."
  },
  {
    "number": "339.",
    "text": "The State of the turn is partially determined by whether or not a Showdown is in progress."
  },
  {
    "number": "339.1.",
    "text": "The turn is said to be in a Showdown State if a Showdown is in progress."
  },
  {
    "number": "339.1.a.",
    "text": "Cards of all Categories, by default, cannot be played during a Showdown State."
  },
  {
    "number": "339.1.b.",
    "text": "Card abilities, by default, cannot be played during a Showdown State."
  },
  {
    "number": "339.2.",
    "text": "The turn is said to be in a Neutral State if no Showdown is in progress."
  },
  {
    "number": "340.",
    "text": "A Showdown begins when Control of a Battlefield is Contested and the turn is in a Neutral Open State."
  },
  {
    "number": "340.1.",
    "text": "If Control of a Battlefield is Contested between two players, then a Showdown will be opened as the first step of Combat.\nSee rule 437. Combat for more information."
  },
  {
    "number": "340.2.",
    "text": "If Control of a Battlefield is Contested and the Battlefield in question is uncontrolled when it becomes Contested, a Showdown is opened during the Cleanup at the end of the action that caused the Battlefield to become Contested."
  },
  {
    "number": "341.",
    "text": "As a Showdown begins, the player who applied Contested status to the Battlefield gains Focus."
  },
  {
    "number": "342.",
    "text": "When a Showdown begins, it may or may not begin with an Initial Chain."
  },
  {
    "number": "342.1.",
    "text": "Showdowns that open as a result of Combat may have an Initial Chain of Triggered Abilities."
  },
  {
    "number": "342.1.a.",
    "text": "These Triggered Abilities should be put on the chain first by the player with Focus, then proceeding with players without the Defender designation in Turn Order. Finally, the player with the Defender designation will add their Triggered Abilities, if any, to the Chain."
  },
  {
    "number": "342.1.b.",
    "text": "If there are no such Triggered Abilities present during a Combat-initiated Showdown then no Initial Chain is created, but the Showdown will still proceed."
  },
  {
    "number": "343.",
    "text": "When the last item on the chain resolves during a Showdown, Focus passes, and the next Player gains both Focus and Priority."
  },
  {
    "number": "343.1.",
    "text": "Focus does not pass when the last item on the Initial Chain resolves, if there was one. Instead the player with Focus proceeds with play."
  },
  {
    "number": "344.",
    "text": "During a Showdown, the player with Focus may do one of the following:"
  },
  {
    "number": "344.1.",
    "text": "Play a spell that is legally timed."
  },
  {
    "number": "344.1.a.",
    "text": "The spell will start a Chain as normal."
  },
  {
    "number": "344.2.",
    "text": "Activate Abilities of Game Objects that are legally timed.\nSee rule 357. Abilities for more information."
  },
  {
    "number": "344.3.",
    "text": "Pass."
  },
  {
    "number": "344.3.a.",
    "text": "If all Players have passed once in sequence, the Showdown ends."
  },
  {
    "number": "344.3.a.1.",
    "text": "Perform a Cleanup."
  },
  {
    "number": "344.4.",
    "text": "Otherwise, Focus passes to the next Player in Turn Order."
  },
  {
    "number": "345.",
    "text": "If all players pass Focus without playing a spell or activating an ability, then the Showdown Closes."
  },
  {
    "number": "345.1.",
    "text": "If this Showdown opened as a result of Combat, proceed with the remaining steps of Combat to resolve the phase.\nSee rule 441. The Steps of Combat for more information."
  },
  {
    "number": "345.2.",
    "text": "If this Showdown opened as a result of Contested being applied to a Battlefield without a controller, do one of the following:"
  },
  {
    "number": "345.2.a.",
    "text": "If only one player’s Units remain at the Battlefield, and if that player does not already Control the Battlefield, that player establishes Control over the Battlefield.\nSee rule 179. Control for more information on Control.\nSee rule 446.1. for more information on Conquering."
  },
  {
    "number": "345.2.a.1.",
    "text": "This results in a Conquer if that player has not yet scored that Battlefield this turn."
  },
  {
    "number": "345.2.b.",
    "text": "If two players’ Units remain at the Battlefield, Control cannot be established and the Battlefield remains Contested. This results in a Staged Combat.\nSee rule 437. Combat for more information."
  },
  {
    "number": "345.2.b.1.",
    "text": "The player who applied Contested to the Battlefield will be the Attacker in the subsequent Combat."
  },
  {
    "number": "346.",
    "text": "Playing Cards"
  },
  {
    "number": "347.",
    "text": "Playing a card is the act of a player utilizing their cards."
  },
  {
    "number": "347.1.",
    "text": "A card is Played when it has finished this process in its entirety."
  },
  {
    "number": "347.2.",
    "text": "Tokens are not cards, but can still be Played.\nSee rule 173. Tokens for more information."
  },
  {
    "number": "348.",
    "text": "Cards have different behaviors when played."
  },
  {
    "number": "348.1.",
    "text": "Permanents become Game Objects when Played."
  },
  {
    "number": "348.2.",
    "text": "Spells create game effects that are executed, then the card is placed in the trash when Played."
  },
  {
    "number": "349.",
    "text": "Cards have different states during the process of being played."
  },
  {
    "number": "349.1.",
    "text": "When initially being played cards are Pending, as Pending Chain Items."
  },
  {
    "number": "349.2.",
    "text": "Near the end of the process cards will cease being Pending and become Finalized Chain Items."
  },
  {
    "number": "350.",
    "text": "The Process of Play"
  },
  {
    "number": "351.",
    "text": "1. Remove the card from the zone you are playing it from and put it onto the Chain."
  },
  {
    "number": "351.1.",
    "text": "This Closes the State.\nSee rule 307. States of the Turn for more information."
  },
  {
    "number": "351.2.",
    "text": "This item becomes Pending."
  },
  {
    "number": "351.3.",
    "text": "If another Card Effect or ability is currently resolving, continue resolving it before proceeding with any further steps of this process."
  },
  {
    "number": "352.",
    "text": "2. Make necessary choices."
  },
  {
    "number": "352.1.",
    "text": "If the card is a spell, or has an effect that specifies a choice \"As I am played,\" those choices are made now."
  },
  {
    "number": "352.2.",
    "text": "For Units, choose a valid Location where that Unit will be placed upon being Played."
  },
  {
    "number": "352.2.a",
    "text": "By default, Valid locations include the controller’s Base or a Battlefield the controller controls."
  },
  {
    "number": "352.2.b",
    "text": "Some Game Effects may grant players permission to play Units to locations that are not normally Valid. Such locations become Valid for the purposes of Playing the Unit.."
  },
  {
    "number": "352.3.",
    "text": "For Spells and Abilities that Move one or more Units, choose a valid Location as the Move Destination for each Move that will be performed."
  },
  {
    "number": "352.4.",
    "text": "If a card requires you to specifically choose one or more Game Objects, that choice is made now."
  },
  {
    "number": "352.4.a.",
    "text": "This does not include cards that affect one or more Game Objects based on criteria.\nExample: \"Stun a unit at a battlefield\" is a Choice.\nExample: \"Kill all gear\" is not a Choice."
  },
  {
    "number": "352.4.b.",
    "text": "This does not include making choices for Triggered Abilities of permanents, even if those abilities trigger when the permanent is played.\nExample: A unit with a triggered ability that says \"When I'm played, kill a unit\" does not require you to choose a target as it's played. The target will be chosen when the ability triggers.\nSee rule 375. Triggered Abilities for more information."
  },
  {
    "number": "352.5.",
    "text": "Targeting"
  },
  {
    "number": "352.6.",
    "text": "When a card Chooses one or more specific Game Objects to affect, it is Targeted."
  },
  {
    "number": "352.7.",
    "text": "In order to put a spell or ability on the chain, valid choices must be made for all targets."
  },
  {
    "number": "352.8.",
    "text": "A target is a valid choice if it meets all of the following requirements:"
  },
  {
    "number": "352.8.a.",
    "text": "It is a permanent or rune on the board, a spell or ability on the chain, a player or zone, or specified explicitly or implicitly as being in some other zone.\ne.g., “Kill a unit” targets a unit on the board.\ne.g., “Recycle a unit from your trash” targets a unit card in your trash."
  },
  {
    "number": "352.8.a.1.",
    "text": "“Unit,” “gear,” and “rune” refer to objects on the Board unless specified otherwise."
  },
  {
    "number": "352.8.a.2.",
    "text": "“Spell” and “ability” refer to objects on the Chain unless specified otherwise."
  },
  {
    "number": "352.8.a.3.",
    "text": "“Facedown card” refers to a card in a Facedown Zone unless specified otherwise."
  },
  {
    "number": "352.8.a.4.",
    "text": "“Legend” refers to a legend in the Legend Zone."
  },
  {
    "number": "352.8.a.5.",
    "text": "“Chosen Champion” and “unit in the Champion Zone” refer to a unit in the Champion Zone unless specified otherwise."
  },
  {
    "number": "352.8.b.",
    "text": "It meets all targeting restrictions.\ne.g., A unit is a valid target for a spell that refers to a “unit at a battlefield,” “enemy unit,” “unit you control,” or “unit with Might 4 or greater” only if it meets the appropriate criteria."
  },
  {
    "number": "352.8.c.",
    "text": "It is not the spell or ability itself.\ne.g., A spell that says “Counter a spell” cannot target itself.\ne.g., An ability of a permanent can target that permanent, because abilities and their sources are separate objects."
  },
  {
    "number": "352.9.",
    "text": "If a spell or ability requires one or more players to choose objects, players, or zones that are not targets, those choices are made on resolution."
  },
  {
    "number": "352.9.a.",
    "text": "Passive abilities never have targets."
  },
  {
    "number": "352.9.b.",
    "text": "Replacement effects never have targets."
  },
  {
    "number": "352.9.c.",
    "text": "Units and gear never have targets, although their abilities may."
  },
  {
    "number": "352.10.",
    "text": "A game object, player, or zone mentioned in the text of a spell, activated ability, or triggered ability is a target UNLESS any of the following are true:"
  },
  {
    "number": "352.10.a.",
    "text": "It is in a zone whose information status is not Public.\ne.g., “Ready a legend” targets a legend, because the Legend Zone is Public.\ne.g., “Return a unit from your trash to your hand” targets a unit card in your trash, because your trash is Public.\ne.g., “You may play a unit from your hand, ignoring its costs” does not target a unit card in your hand, because your hand is not a public zone."
  },
  {
    "number": "352.10.a.1.",
    "text": "Public zones are Battlefield Zones, Bases, Trashes, Legend Zones, Champion Zones, and Facedown Zones."
  },
  {
    "number": "352.10.b.",
    "text": "It is included only as part of a targeting restriction for another choice.\ne.g., “Kill a unit at a battlefield” targets a unit, but not a battlefield, because the units are targets and “at a battlefield” is a restriction.\ne.g., “Kill all units at a battlefield” targets a battlefield, but not any units.\ne.g., “Move a unit to a battlefield” targets both a unit and a battlefield."
  },
  {
    "number": "352.10.c.",
    "text": "It is included only as part of a cost, trigger condition, or replacement effect.\ne.g., “As an additional cost to play me, kill a friendly unit” doesn’t target anything.\ne.g., “When a friendly unit dies, kill a gear” targets a gear, but not a friendly unit.\ne.g., “When you play me, the next time a friendly unit would die this turn, return it to your hand instead” doesn’t target anything. The replacement effect applies when any friendly unit dies.\ne.g., “Choose a friendly unit. The next time it would die this turn, return it to your hand instead” targets a friendly unit, because “choose a friendly unit” is not part of the replacement effect."
  },
  {
    "number": "352.10.c.1.",
    "text": "This includes costs within instructions, identified by phrases like “[do X] to [do Y].” The cost within that instruction is “[do X].”\ne.g., “When I hold, you may kill another friendly unit here to draw 1” does not target anything.\ne.g., “When you play me, you may spend a buff to move a friendly unit” targets the friendly unit, but not the buff."
  },
  {
    "number": "352.10.d.",
    "text": "It is programmatically selected based on its characteristics rather than chosen by the spell or ability’s controller.\ne.g., “Kill all units at a battlefield” targets a battlefield, but does not target any units.\ne.g., “Kill all units at battlefields” doesn’t target anything.\ne.g., “Destroy a unit. Its controller draws 2 cards” targets the unit, but not its controller.\ne.g., “Ready your legend” doesn’t target anything, because you can only have one legend.\ne.g., “Ready a friendly legend” targets a legend, because in a 2v2 game there are two friendly legends.\ne.g., “Recycle all cards in your trash” doesn’t target anything, because it affects all cards and you only have one trash."
  },
  {
    "number": "352.10.d.1.",
    "text": "This exception applies solely to objects for which no choice is ever possible."
  },
  {
    "number": "352.10.d.2.",
    "text": "This exception does not apply to objects that are the only valid choice at the moment a spell or ability is placed on the chain, but which would require a choice under other circumstances.\ne.g., “Kill a unit at a battlefield” always targets a unit, even if that unit is the only unit currently at a battlefield."
  },
  {
    "number": "352.10.e.",
    "text": "It is part of a set of objects chosen in whole or in part by other players.\ne.g., “Each player kills a unit they control” does not target. Each player, including the one who played the spell, chooses a unit to kill as the spell or ability resolves."
  },
  {
    "number": "352.10.f.",
    "text": "It is identified in an instruction that a player “must” complete.\ne.g., “You must recycle one of your runes” doesn’t target anything. You choose from among your runes as the spell or ability resolves.\ne.g., “Recycle a rune you control” targets a rune. You choose a rune you control as you put the spell or ability on the chain."
  },
  {
    "number": "352.11.",
    "text": "Some cards identify a group of Targets with Targeting Requirements that must be met by the group as a whole."
  },
  {
    "number": "352.11.a.",
    "text": "As they’re finalized on the chain, such cards can choose any group of valid targets that collectively fulfill the targeting restriction."
  },
  {
    "number": "352.11.b.",
    "text": "If the group of targets no longer collectively fulfill the targeting restriction as the spell or ability resolves, that spell or ability’s controller can choose a subset of the original targets that fulfills the targeting requirement for the spell or ability to affect.\nExample: A player plays Fox-Fire, a spell that says in part “Kill any number of units at a battlefield with total Might 4 or less.” That player chooses four 1 [M] Recruit tokens at a single battlefield. As a Reaction, another player gives two of those Recruits +1 [M], so the Recruits’ Mights are 1, 1, 2, and 2. Then Fox-Fire resolves. The Recruits no longer have total Might 4 or less, so Fox-Fire’s controller must choose a legal subset of the original targets to affect. They could choose to kill the two 2 [M] Recruits, or the two 1 [M] Recruits plus one 2 [M] Recruit. The units they choose are Fox-Fire’s remaining legal targets. They can’t choose to affect units at the same battlefield that weren’t initially chosen as targets, and they can’t affect any units that are no longer at the chosen battlefield."
  },
  {
    "number": "352.12.",
    "text": "If a card specifies that a player may choose some number of Game Objects to be affected by a card, then all choices are considered targeted and chosen independently."
  },
  {
    "number": "352.13.",
    "text": "If a card specifies that a player chooses “any number” or “up to” some number of Game Objects to be affected, they may choose any number of available targets, including zero. If they choose zero, the spell or ability can be played without any targets."
  },
  {
    "number": "352.14.",
    "text": "Splitting"
  },
  {
    "number": "352.14.a.",
    "text": "If a card specifies that an amount of damage may be split among some number of Units, then each Unit chosen is Targeted."
  },
  {
    "number": "352.14.b.",
    "text": "The Targets are chosen when the spell or ability is finalized on the chain."
  },
  {
    "number": "352.14.c.",
    "text": "A number of Targets can only be chosen up to, and not exceeding, the initial amount of damage available when the spell is played. Example: A player playing a spell that instructs them to \"Split 5 damage\" may only choose up to 5 units, but may choose fewer."
  },
  {
    "number": "352.14.d.",
    "text": "Each Target is valid, and contributes to Chosen triggers individually."
  },
  {
    "number": "352.14.e.",
    "text": "The choice of how much damage is divided across the split is not decided until the resolution of the spell or ability."
  },
  {
    "number": "352.14.f.",
    "text": "Each Target must receive a valid amount of damage."
  },
  {
    "number": "352.14.g.",
    "text": "Valid damage is a positive integer amount, greater than or equal to 1 damage."
  },
  {
    "number": "352.14.h.",
    "text": "If, at resolution of the spell or effect, there are more Targets than available damage to divide, then the player who controls the effect dealing damage determines which Targets cease being Targets."
  },
  {
    "number": "352.14.i.",
    "text": "Any costs that were paid, or effects that were triggered as a result of those Game Objects being chosen as Targets remain in effect, paid, or otherwise triggered."
  },
  {
    "number": "352.15.",
    "text": "These choices cannot be changed after this step."
  },
  {
    "number": "352.16.",
    "text": "A player may not make choices during this step that will deterministically result in illegal choices or actions later in this process unless they have no choice.\nExample: A player plays Cruel Patron, which says \"As an additional cost to play me, kill a friendly unit.\" They control exactly one unit, which is at a battlefield. They can't choose to play Cruel Patron to that battlefield, because by the time they have finished paying costs, they will no longer control that battlefield."
  },
  {
    "number": "353.",
    "text": "3. Determine Total Cost."
  },
  {
    "number": "353.1.",
    "text": "If an ability or instruction allows you to \"ignore\" one or more of a card's costs, set the appropriate Base Cost(s) of the card to zero."
  },
  {
    "number": "353.1.a.",
    "text": "If a card allows a player to play a card \"ignoring its cost,\" its base Energy cost and base Power cost are set to zero."
  },
  {
    "number": "353.1.b.",
    "text": "If a card instructs a player to play a card \"ignoring its Energy cost\" or \"ignoring its Power cost,\" only the appropriate cost is set to zero, and the remaining cost still applies."
  },
  {
    "number": "353.1.c.",
    "text": "Further additional costs and/or cost increases applied in subsequent steps may raise the card's Total Cost above zero.\nExample: Legion Rearguard is a Fury unit that costs 2 Energy and 0 Power and has Accelerate. A player plays Legion Rearguard and is instructed to ignore its costs, but chooses to pay the Accelerate cost. They ignore Legion Rearguard's Base Cost of 2 Energy, but the optional additional cost of 1 Energy and 1 Fury Power is added to its Total Cost and must be paid."
  },
  {
    "number": "353.2.",
    "text": "Apply additional costs in any order."
  },
  {
    "number": "353.2.a.",
    "text": "Mandatory Additional Costs"
  },
  {
    "number": "353.2.a.1.",
    "text": "Some Additional Costs specified by Passive Abilities on the card being played or another card are Mandatory, and must be paid to complete playing the card. They use the phrase \"as an additional cost\" and don't include the word \"may.\"\nExample: A unit has the passive ability \"As an additional cost to play me, kill a friendly unit.\" To play that unit, a player must kill a friendly unit.\nSee rule 360. Passive Abilities for more information."
  },
  {
    "number": "353.2.a.2.",
    "text": "The cost imposed by the Deflect keyword is a Mandatory Additional Cost.\nSee rule 735. Deflect for more information."
  },
  {
    "number": "353.2.b.",
    "text": "Optional Additional Costs"
  },
  {
    "number": "353.2.b.1.",
    "text": "Some Optional Costs specified by Passive Abilities on the card being played or another card are Non-Mandatory, and must be paid only if the player made the choice to pay them in rule 352. They use the phrase \"as an additional cost\" and the word \"may.\"\nExample: A unit has the ability \"As you play me, you may discard 1 as an additional cost. If you do, reduce my cost by [2].\" While playing the unit, its controller declares their intention to pay the additional cost in rule 352, applies that additional cost in rule 353.2, applies the discount granted by paying that cost in rule 353.4, and discards a card to pay that additional cost in rule 354.2.\nSee rule 360. Passive Abilities for more information."
  },
  {
    "number": "353.3.",
    "text": "Apply cost increases."
  },
  {
    "number": "353.4.",
    "text": "Apply discounts in any order."
  },
  {
    "number": "353.4.a.",
    "text": "Discounts may be applied by the card being played or by any other card or effect."
  },
  {
    "number": "353.4.b.",
    "text": "Discounts may say that cards \"cost [amount] less\" or that one or more of their costs are \"reduced by [amount].\""
  },
  {
    "number": "353.4.c.",
    "text": "If a discount applies a minimum cost, that minimum applies only to that discount.\nExample: Eager Apprentice says \"While I'm at a battlefield, the Energy costs for spells you play is reduced by [1], to a minimum of [1].\" A player who controls Eager Apprentice and a unit with 7 Might plays Sky Splitter, a spell that costs 8 Energy and says \"This spell's Energy cost is reduced by the highest Might among units you control.\" That player can choose to apply Eager Apprentice's discount first, reducing Sky Splitter's Energy cost to 7, then apply Sky Splitter's discount, reducing its Energy cost to 0. If they applied these discounts in the other order, Sky Splitter's Energy cost would be 1."
  },
  {
    "number": "353.4.d.",
    "text": "Discounts can reduce additional costs, including to 0."
  },
  {
    "number": "353.4.d.1.",
    "text": "An optional additional cost was \"paid\" if the player made the decision in rule 352 to pay it. It doesn't matter how much the player actually paid.\nExample: Clockwork Keeper is a unit that costs 2 Energy and 0 Power and says \"As you play me, you may pay [C] as an additional cost. If you do, draw \" A player controls a card that says \"Units you play cost [A] less.\" That player plays Clockwork Keeper and chooses to pay the optional additional cost of [C]. They will draw a card, even though the optional additional cost was reduced to 0."
  },
  {
    "number": "353.5.",
    "text": "Energy and Power costs can't be reduced below 0."
  },
  {
    "number": "353.6.",
    "text": "Costs may be Energy costs, Power costs, or non-standard costs. Example: A card reads \"As an additional cost to play me, kill a friendly unit.\" Killing a friendly unit is an additional cost to play that card."
  },
  {
    "number": "354.",
    "text": "4. Pay the card's costs."
  },
  {
    "number": "354.1.",
    "text": "In total, pay the combined Energy cost (if any) and Power cost (if any)."
  },
  {
    "number": "354.1.a.",
    "text": "During this step, the spell's controller can use activated abilities with the Reaction tag that Add resources to add Energy and Power to pay the spell's costs.\nSee rule 161. Rune Pools and rule 416. Add for more information."
  },
  {
    "number": "354.2.",
    "text": "In addition, pay any non-standard Cost summed in rule 353.2 in any order."
  },
  {
    "number": "354.2.a.",
    "text": "Costs that are replaced with other events by replacement effects are still considered paid.\nExample: A player plays Cruel Patron, which says \"As an additional cost to play me, kill a friendly unit.\" They also control Zhonya’s Hourglass, which says “If a friendly unit would die, kill this instead. Heal that unit, exhaust it, and recall it.” They choose to kill a friendly unit during rule 353.2, but as they pay the cost in rule 354.2, Zhonya’s Hourglass replaces that unit’s death. The cost is considered paid, and the player can continue playing Cruel Patron."
  },
  {
    "number": "354.3.",
    "text": "A player may not pay costs during this step that will deterministically result in illegal choices or actions later in this process unless they have no choice.\nExample: A player plays Cruel Patron, which says \"As an additional cost to play me, kill a friendly unit.\" They control multiple units, one of which is alone at a battlefield. During rule 352.2., they chose to play Cruel Patron to that battlefield. While paying costs, they can't choose to kill the unit at that battlefield, because then they will no longer control that battlefield and Cruel Patron cannot legally be played there. If they controlled that battlefield with multiple units, any of those units would be a legal choice, because they would still control the battlefield after killing one."
  },
  {
    "number": "355.",
    "text": "5. Check legality."
  },
  {
    "number": "355.1.",
    "text": "Check that all chosen targets are legal."
  },
  {
    "number": "355.2.",
    "text": "Ensure that the outcome of the effect of this card being played would not create an illegal state.\nExample: Check that a spell's execution does not create a state where a Battlefield has Units controlled by 3 different players."
  },
  {
    "number": "355.3.",
    "text": "If the card, if continued to be played, would create an illegal state, or if a choice or action at this state is illegal, the actions taken in this process are undone and the action is cancelled."
  },
  {
    "number": "356.",
    "text": "6. Finalize this card and proceed with the card's category of Play."
  },
  {
    "number": "356.1.",
    "text": "This card is no longer Pending."
  },
  {
    "number": "356.2.",
    "text": "A Permanent leaves the Chain and becomes a Game Object."
  },
  {
    "number": "356.2.a.",
    "text": "Any passive abilities become active."
  },
  {
    "number": "356.2.b.",
    "text": "Execute all rules text on the card, from top to bottom."
  },
  {
    "number": "356.2.c.",
    "text": "If it is a Unit, it enters the Board exhausted at the Location that was chosen."
  },
  {
    "number": "356.2.d.",
    "text": "If it is a Gear, it enters the Board Ready at the player's Base."
  },
  {
    "number": "356.3.",
    "text": "A Spell lingers on the Chain."
  },
  {
    "number": "356.3.a.",
    "text": "This card becomes a Finalized Chain Item."
  },
  {
    "number": "356.3.b.",
    "text": "If there are other Pending Items on the Chain, then the controller of those Pending Items completes Steps 2 through 5 of Playing Cards for those items before continuing.\nSee rule 326. Chains for more information."
  },
  {
    "number": "356.3.c.",
    "text": "Other players have an opportunity to play Reactions before the resolution of spells.\nSee rule 326. Chains for more information."
  },
  {
    "number": "356.3.d.",
    "text": "Otherwise, execute the game effect of the spell, from top to bottom of the rules text of the card and then place the card in the Trash of the owning player."
  },
  {
    "number": "356.3.e.",
    "text": "Handling illegal and impossible instructions"
  },
  {
    "number": "356.3.e.1.",
    "text": "The spell resolves even if some or all of its targets are illegal."
  },
  {
    "number": "356.3.e.2.",
    "text": "A target is illegal as the spell resolves if it no longer meets the targeting requirements of the spell, or if it has changed Zones to or from a Non-Board Zone."
  },
  {
    "number": "356.3.e.3.",
    "text": "If a target ceases to meet the targeting requirements while the spell is on the chain, then meets them again, it's a legal target.\nExample: A spell targets \"a unit at a battlefield.\" A player reacts with a spell that moves the unit to base, then another player reacts with a spell that moves it back to that battlefield, then the original spell resolves. The unit is a legal target."
  },
  {
    "number": "356.3.e.4.",
    "text": "If a target changes Zones to or from a Non-Board Zone and then returns to its original zone, it is no longer a legal target, because it's not treated as the same object.\nExamples:\nAn enemy unit at a battlefield is no longer a legal target if it is no longer an enemy, no longer a unit, or no longer at a battlefield.\nA unit with 3 or less Might is no longer a legal target if it is no longer a unit or if its Might is greater than 3.\nSomething that's exhausted is no longer a legal target if it is no longer exhausted. (It can't stop being \"something.\")\nA spell that's played from hidden can normally only target its own battlefield or something at that battlefield. A target for such a spell may cease to be a legal target if it moves from the battlefield where that spell was played, even if the spell has no location targeting requirement otherwise."
  },
  {
    "number": "356.3.e.5.",
    "text": "If any of the spell's targets are no longer legal, those targets are unaffected by the spell as it resolves.\nExample: A player plays Void Seeker, a spell that says \"Deal 4 to a unit at a battlefield. Draw 1.\" The unit's controller uses a Reaction to move the unit to their base. Since the unit is no longer a legal target, it is not dealt any damage. Void Seeker's controller still draws 1."
  },
  {
    "number": "356.3.e.6.",
    "text": "Instructions that can't be followed, either because of illegal targets or other circumstances, are ignored."
  },
  {
    "number": "356.3.e.7.",
    "text": "If all of an instruction's Targets become Invalid or Unavailable by the time the spell is finished being played, that instruction will not execute."
  },
  {
    "number": "356.3.e.8.",
    "text": "If an instruction has more than one Target and fewer than all of the Targets become Invalid or Unavailable by the time the spell is finished being played, the instruction will execute, with only the Targets available and valid being operated on."
  },
  {
    "number": "356.3.e.9.",
    "text": "The process for a card's choice becoming Invalid or Unavailable is referred to as mistargeting.\nExample: A spell has the instruction \"Deal 2 to a unit at a battlefield.\" Before that instruction can execute, the chosen unit is moved to its base. The instruction will not be executed, because it specifies that the unit it chooses must be at a Battlefield, and by the time it attempted to execute, the unit was no longer valid as a choice."
  },
  {
    "number": "356.3.e.10.",
    "text": "It is possible for none of a spell's instructions to be executed as it resolves, due to all of them requiring targets to act on and all of those targets becoming Invalid or Unavailable. In this case, the spell has no effect but is still considered played.\nExample: A player plays a spell that reads \"Deal 2 to a unit at a battlefield\" with no other instructions, and chooses an enemy unit at a battlefield. They also control a unit with the ability \"When you play a spell, give me +1 [M] this turn.\" Before the spell resolves, the chosen unit is moved to its base. The spell resolves and its only instruction cannot be executed, but the unit's ability still triggers as the spell resolves and gives it +1 [M]."
  },
  {
    "number": "356.3.e.11.",
    "text": "Instructions that can be partially followed are followed as much as possible and ignored otherwise.\nExample: A player plays a spell that says \"Discard 2, then draw 2\" If their hand is empty, the instruction to discard 2 will be ignored. They'll still draw 2. If they had 1 card in hand, they would discard it and draw 2."
  },
  {
    "number": "356.3.e.12.",
    "text": "If the spell checks information about a target that is no longer legal or a card or permanent whose location, zone, or status has changed such that that information is no longer available, that check returns \"null\" and all calculations based on it are ignored.\nExamples:\nA unit that is no longer on the board is treated as having null Might, null cost, etc.\nA unit that is no longer on the board has no location, is neither exhausted nor readied, etc.\nBaited Hook says \"[1][C], [E]: Kill a friendly unit. Look at the top 5 cards of your Main Deck. You may banish a unit from among them that has Might up to 1 more than the killed unit and play it, ignoring its cost. Then recycle the rest.\" While Baited Hook’s ability is on the chain, an opponent reacts with a spell that returns the friendly unit to its owner's hand. Because the friendly unit is no longer a legal target, it can't be killed and its Might is treated as null. Baited Hook’s controller reveals the top 5 cards of their Main Deck, but can’t choose any unit from among them."
  },
  {
    "number": "356.3.e.13.",
    "text": "A spell or ability that moves something to a different zone as a cost or effect can \"look back\" at its characteristics before it changes zones."
  },
  {
    "number": "357.",
    "text": "Abilities"
  },
  {
    "number": "358.",
    "text": "An Ability is the structured rules and capabilities of Game Objects or Spells."
  },
  {
    "number": "358.1.",
    "text": "An Ability has multiple structures.\nPassive Abilities\nReplacement Effects\nActivated Abilities\nTriggered Abilities\nDelayed Abilities"
  },
  {
    "number": "359.",
    "text": "A card can have more than one Ability and more than one type of Ability."
  },
  {
    "number": "360.",
    "text": "Passive Abilities"
  },
  {
    "number": "361.",
    "text": "Conditions, rules, constraints, or statements that affect the course of regular play."
  },
  {
    "number": "361.1.",
    "text": "These abilities have a wide variety of formats to recognize.\nExample: \"I get +1[M] while you have 2 or more cards in your hand.\"\nExample: \"Friendly Yordles at my battlefield have [Shield].\""
  },
  {
    "number": "361.2.",
    "text": "They can be recognized by being statements of fact."
  },
  {
    "number": "361.3.",
    "text": "Passive Abilities can be conditional."
  },
  {
    "number": "361.3.a.",
    "text": "Conditional Passive Abilities can be recognized by the occurrence of \"if\" or \"while\" as part of the statement of the ability.\nExample: \"While I'm attacking or defending alone, I have +2 [M].\"\nExample: \"If an opponent controls a battlefield, I enter ready.\""
  },
  {
    "number": "362.",
    "text": "Presence on Permanents"
  },
  {
    "number": "362.1.",
    "text": "Passive Abilities of Permanents are typically only active while on the Board."
  },
  {
    "number": "363.",
    "text": "Presence on Card outside of the Board"
  },
  {
    "number": "363.1.",
    "text": "Passive Abilities of cards in zones that are outside of the Board will self-describe their context.\nExample: The passive ability \"Play me only during an opponent's turn.\" applies in any zone from which that card can be played."
  },
  {
    "number": "363.2.",
    "text": "Passive Abilities can alter the costs of cards as they are played."
  },
  {
    "number": "363.2.a.",
    "text": "These apply at all times in any zone from which the card with the ability can be played."
  },
  {
    "number": "364.",
    "text": "Replacement Effects"
  },
  {
    "number": "365.",
    "text": "An ability that alters the application of another game effect or game rule."
  },
  {
    "number": "365.1.",
    "text": "Passive Abilities can be Replacement Effects."
  },
  {
    "number": "366.",
    "text": "Replacement Effects intercede during the execution of a Game Effect and alter its execution."
  },
  {
    "number": "366.1.",
    "text": "A Replacement Effect can be identified by the presence of the term \"instead.\"\nExample: Zhonya's Hourglass reads \"The next time a friendly unit would die, kill this instead. Recall that unit exhausted.\" This is a replacement effect that alters the execution of any Game Effect that would kill a friendly unit."
  },
  {
    "number": "367.",
    "text": "A Replacement Effect can alter the typical flow of play, including other cards' executions."
  },
  {
    "number": "368.",
    "text": "If more than one Replacement Effect applies to the same event being executed, then the owner of the object being acted on determines the order the Replacement Effects will apply."
  },
  {
    "number": "368.1.",
    "text": "If it is a player being acted on, that player decides the order the Replacement Effects will apply."
  },
  {
    "number": "368.2.",
    "text": "If the affected object is an Uncontrolled Battlefield then the Current Turn Player decides the order the Replacement Effects will apply."
  },
  {
    "number": "369.",
    "text": "Activated Abilities"
  },
  {
    "number": "370.",
    "text": "Activated Abilities are repeatable effects with a cost. They follow a process of going onto the chain and resolving, similar to Playing a Card.\nSee rule 346. Playing Cards for more information."
  },
  {
    "number": "370.1.",
    "text": "Activated Abilities are recognized by the presence of a \":\" in the text of the card, preceded by a cost and succeeded by an effect.\nExample: \"[2]: Draw 1\" is an activated ability. The cost is 2 energy. The effect is to draw 1 card."
  },
  {
    "number": "370.2.",
    "text": "Activated Abilities use the chain."
  },
  {
    "number": "370.2.a.",
    "text": "Declare activation of the Ability."
  },
  {
    "number": "370.2.a.1.",
    "text": "The ability goes on the chain but has no card to represent it, so players need to take note that it is now a Closed State."
  },
  {
    "number": "370.2.b.",
    "text": "Proceed with executing the Chain."
  },
  {
    "number": "370.2.b.1.",
    "text": "Follow the steps of “Playing or Activating Abilities” in rule 386. This ability will become a Pending Chain Item."
  },
  {
    "number": "370.2.b.2.",
    "text": "Opponents have an opportunity to respond, as appropriate, as if a card was played onto the chain."
  },
  {
    "number": "370.2.b.3.",
    "text": "If no further action is taken, execute the Activated Ability."
  },
  {
    "number": "371.",
    "text": "The controlling player chooses when and whether to activate an Activated Ability."
  },
  {
    "number": "372.",
    "text": "Activated abilities are present on Game Objects and some Spells."
  },
  {
    "number": "373.",
    "text": "Can primarily be activated while on the Board."
  },
  {
    "number": "374.",
    "text": "All Activated Abilities can only be activated on the Controlling Player's Turn and during an Open State."
  },
  {
    "number": "375.",
    "text": "Triggered Abilities"
  },
  {
    "number": "376.",
    "text": "Triggered Abilities are repeatable effects that happen when a Condition is met."
  },
  {
    "number": "376.1.",
    "text": "Triggered Abilities can usually be recognized by the word \"when\" followed by a game action or event; the word \"at\" followed by a point in time during the turn sequence; or the phrase “the [Nth] time” followed by a game action or event.\nExamples:\n\"When you conquer here, you may spend a buff to draw 1.\"\n\"At the end of your turn, ready 2 runes.\"\n“The first time I move each turn, you may ready something else that's exhausted.”"
  },
  {
    "number": "376.1.a.",
    "text": "The phrases that identify triggered abilities do not always appear at the beginning of sentences or abilities."
  },
  {
    "number": "376.1.b.",
    "text": "If an ability triggers “the [Nth] time” something happens and that trigger condition is met multiple times simultaneously, the ability’s controller picks one of those instances to serve as the trigger condition. The ability triggers only once, due to the chosen condition.\nExample: Wraith of Echoes reads “The first time another friendly unit dies each turn, draw 1.” That ability hasn’t triggered yet this turn. Two other friendly units die simultaneously (say, due to combat damage). The Wraith’s controller chooses one of those deaths to trigger Wraith’s ability."
  },
  {
    "number": "376.2.",
    "text": "Triggered Abilities have a Condition and an Effect."
  },
  {
    "number": "376.2.a.",
    "text": "The Condition follows the When."
  },
  {
    "number": "376.2.b.",
    "text": "The Effect is the Instruction that follows the comma after the Condition."
  },
  {
    "number": "376.2.c.",
    "text": "The Condition of a Trigger is evaluated after a potentially inciting event has been processed."
  },
  {
    "number": "376.2.c.1.",
    "text": "If a Game Object with a Triggered Ability that is active in a specific zone, it is evaluated and subsequently triggered if it enters that zone at the same time that its Trigger’s condition is met.\nExample: Immortal Phoenix says “When you kill a unit with a spell, you may pay [1][C] to play me from your trash.” This ability triggers if Immortal Phoenix is in your trash immediately after you kill a unit with a spell, even if the unit you killed with a spell was that Immortal Phoenix."
  },
  {
    "number": "376.2.c.2.",
    "text": "A Game Object will not be able to successfully be able to evaluate its Trigger Condition, however, if it leaves the zone that its Trigger is active from at the same time that its Trigger is satisfied.\nExample: Viktor, Leader says “When another non-Recruit unit you control dies, play a 1 [M] Recruit unit token into your base.” This ability triggers if Viktor is on the board immediately after another non-Recruit unit you control dies. It does not trigger if Viktor and another non-Recruit unit you control die during the same game action (for instance, if they are both killed in the same Cleanup due to the damage dealt by Unchecked Power)."
  },
  {
    "number": "376.3.",
    "text": "When a Condition is met, a Triggered Ability behaves like an Activated Ability and is placed on the Chain."
  },
  {
    "number": "376.3.a.",
    "text": "Triggered Abilities can be put on the Chain during Closed States or Open States on any player's turn."
  },
  {
    "number": "376.3.b.",
    "text": "If more than one Triggered Ability is Triggered simultaneously, then the player that controls the Abilities selects the order to place them on the Chain."
  },
  {
    "number": "376.3.b.1.",
    "text": "If multiple players separately control Triggered Abilities that are Triggered simultaneously, then starting with the Turn Player and proceeding in Turn Order, each player orders their Triggered Abilities on the Chain."
  },
  {
    "number": "376.4.",
    "text": "Some Conditions are commonly used and structured in a way that explicitly defines their use and other properties of the Effect that is associated with it."
  },
  {
    "number": "376.4.a.",
    "text": "Play Effects are Triggered Abilities with the Condition that the Permanent that has the Play Effect being played to the board."
  },
  {
    "number": "376.4.a.1.",
    "text": "These are commonly structured as “When you play me…” for Units and “When you play this…” for Gear."
  },
  {
    "number": "376.4.a.2.",
    "text": "These Triggered Abilities are put on the Chain as Pending Items after the Permanent these effects correspond to is finalized and enters the board."
  },
  {
    "number": "376.4.a.3.",
    "text": "These Triggered Abilities can be referred to as Play Effects."
  },
  {
    "number": "376.4.a.4.",
    "text": "Abilities that trigger when another object is played are not considered Play Effects."
  },
  {
    "number": "376.4.b.",
    "text": "Conquer Effects are Triggered Abilities with a Condition of a Unit participating in, and successfully Conquering a Battlefield."
  },
  {
    "number": "376.4.b.1.",
    "text": "These are commonly structured as “When I conquer…” and “When you conquer…”"
  },
  {
    "number": "376.4.b.2.",
    "text": "This category of Triggered Abilities encompasses only those that are triggered from Units that were present during the Conquer action, or Abilities that reference the player that performed the Conquer action."
  },
  {
    "number": "376.4.b.2.a.",
    "text": "The Conquer Abilities of Units are put on the Chain as Pending Items after the Unit(s) these effects correspond to are present at a Battlefield when a player gains control of it and gains 1 Victory Point from Conquering."
  },
  {
    "number": "376.4.b.2.b.",
    "text": "The Conquer Abilities of anything that references the player Conquering is put on the Chain as a Pending Item when the Condition that the player that controls the triggering source has performed a Conquer and gained 1 Victory Point."
  },
  {
    "number": "376.4.b.2.c.",
    "text": "If the act of gaining one point from Conquering is negated or replaced in any way, the Conquer Effect will still trigger."
  },
  {
    "number": "376.4.b.3.",
    "text": "These Triggered Abilities can be referred to as Conquer Effects."
  },
  {
    "number": "376.4.c.",
    "text": "Hold Effects are Triggered Abilities with a Condition of a Unit being present at a Battlefield during the Beginning phase when a player scores Victory Points from Holding."
  },
  {
    "number": "376.4.c.1.",
    "text": "These are commonly structured as “When I hold…” or “When you hold…”"
  },
  {
    "number": "376.4.c.2.",
    "text": "This category of Triggered Abilities encompasses only those that are triggered from Units that were present during the Hold action, or Abilities that reference the player that performed the Hold action."
  },
  {
    "number": "376.4.c.2.a.",
    "text": "The Hold Abilities of Units are put on the Chain as Pending Items after the Unit these effects correspond to are present at a Battlefield when a player maintains control of it and Gains 1 Victory Point during their Beginning Phase from Holding."
  },
  {
    "number": "376.4.c.2.b.",
    "text": "The Hold Abilities of anything that references the player Holding is put on the Chain as a Pending Item when the Condition that the player that controls the triggering source has performed a Hold and gained 1 Victory Point."
  },
  {
    "number": "376.4.c.2.c.",
    "text": "If the act of gaining one point from Holding is negated or replaced in any way, the Hold Effect will still trigger."
  },
  {
    "number": "376.4.c.3.",
    "text": "These Triggered Abilities can be referred to as Hold Effects."
  },
  {
    "number": "376.4.d.",
    "text": "Attack Triggers are Triggered Abilities that trigger when a Unit gains the Attacker designation for the first time during a combat."
  },
  {
    "number": "376.4.d.1.",
    "text": "These are commonly structured as “When I attack…”"
  },
  {
    "number": "376.4.d.2.",
    "text": "These Triggered Abilities are put on the Chain as Pending Items after the Unit these effects correspond to gains the Attacker designation during Combat."
  },
  {
    "number": "376.4.d.2.a.",
    "text": "These triggers can only become fulfilled once per combat, despite a Unit being able to gain and lose the Attacker designation multiple times in the same combat."
  },
  {
    "number": "376.4.d.3.",
    "text": "These Triggered Abilities can be referred to as Attack Triggers."
  },
  {
    "number": "376.4.e.",
    "text": "Defend Triggers are Triggered Abilities that trigger when a Unit gains the Defender designation for the first time during a combat."
  },
  {
    "number": "376.4.e.1.",
    "text": "These are commonly structured as “When I defend…”"
  },
  {
    "number": "376.4.e.2.",
    "text": "These Triggered Abilities are put on the Chain as Pending Items after the Unit these effects correspond to gains the Defender designation during Combat."
  },
  {
    "number": "376.4.e.2.a.",
    "text": "These triggers can only become fulfilled once per combat, despite a Unit being able to gain and lose the Defender designation multiple times in the same combat."
  },
  {
    "number": "376.4.e.3.",
    "text": "These Triggered Abilities can be referred to as Defend Triggers."
  },
  {
    "number": "377.",
    "text": "Presence on Permanents"
  },
  {
    "number": "377.1.",
    "text": "Typically active while on the Board."
  },
  {
    "number": "377.2.",
    "text": "Triggered Abilities of Permanents are only able to have their Conditions evaluated while on the Board."
  },
  {
    "number": "378.",
    "text": "Presence on Cards outside of the Board"
  },
  {
    "number": "378.1.",
    "text": "Triggered Abilities on cards outside of the Board rely on the Information Level of the zone they are in."
  },
  {
    "number": "378.2.",
    "text": "Triggered Abilities outside of the Board will self-describe their context.\nExample: The triggered ability \"When you conquer, you may discard 1 to return this from your trash to your hand.\" triggers while the card it's on is in the trash, and not anywhere else."
  },
  {
    "number": "379.",
    "text": "Reflexive Triggers"
  },
  {
    "number": "380.",
    "text": "Reflexive Triggers are a type of Triggered Ability that create one or more Chain Items when their condition is met."
  },
  {
    "number": "380.1.",
    "text": "Reflexive Triggers can be recognized by the phrase “Do this:” or “Do one of the following:”."
  },
  {
    "number": "380.1.a.",
    "text": "“Do this” can be followed by “N times.” The Reflexive Trigger will thus be added to the chain N times when its condition is met."
  },
  {
    "number": "380.2.",
    "text": "Reflexive Triggers will be preceded by their conditions, if any. If no condition is present in the ability then the Reflexive Trigger will always be added to the Chain."
  },
  {
    "number": "380.3.",
    "text": "If present, the Condition of a Reflexive Trigger will follow the same format as a Triggered Ability."
  },
  {
    "number": "381.",
    "text": "Reflexive Triggers use the Chain."
  },
  {
    "number": "381.1.",
    "text": "A new ability is created and added to the chain as a Pending Item.\nSee rule 386. Playing or Activating Abilities for more information."
  },
  {
    "number": "381.2.",
    "text": "If a Reflexive Trigger creates more than one Pending Item it creates them all in order, but does not go beyond the first step of adding them to the Chain.\nSee rule 386. Playing or Activating Abilities for more information."
  },
  {
    "number": "382.",
    "text": "Delayed Abilities"
  },
  {
    "number": "383.",
    "text": "Delayed Abilities are a type of Ability whose trigger Condition identifies a specific time during a turn or a specific event that can occur during a specific timeframe."
  },
  {
    "number": "383.1.",
    "text": "Delayed Abilities can be any other type of Ability, and contain all of the properties of that type in addition to the properties of Delayed Abilities."
  },
  {
    "number": "383.2.",
    "text": "Delayed Triggers are Triggered Abilities that can be recognized by describing a specific time of the turn, or by structuring a Triggered Ability with a specific frame of time as a restriction."
  },
  {
    "number": "383.3.",
    "text": "Delayed Replacements are Replacement Effects that can be recognized by specifying the effect they are replacing at a specific time, or “the [Nth] time” in the description of the effect as it resolves."
  },
  {
    "number": "383.4.",
    "text": "Delayed Passive Abilities are Passive Abilities that are applicable only during a specified window of time. The time that the Delayed Passive Ability applies will be recognized in the effect that initiates it."
  },
  {
    "number": "384.",
    "text": "Delayed Abilities will resolve or be active just like the ability they augment, but only during the specified time in the effect that created the Delayed Ability.\nExample: Ravenborn Tome reads “The next spell you play this turn deals 1 Bonus Damage” is a Delayed Passive Ability that passively adds 1 damage to just the next spell played. The next spell is a specific time, and the 1 Bonus Damage is a passive ability.\nExample: Noxian Guillotine reads “Choose a unit. Kill it the next time it takes damage this turn.” When the chosen unit takes damage is the specified time, and killing it is the condition for a Delayed Triggered Ability."
  },
  {
    "number": "385.",
    "text": "Delayed Abilities are not associated with Units or Gear; they are created by other Abilities or Spells. As such they are executed when their condition and/or specified time occurs regardless of whether the source of the Delayed Ability is still on the board or not."
  },
  {
    "number": "386.",
    "text": "Playing or Activating Abilities"
  },
  {
    "number": "387.",
    "text": "Playing or activating Abilities follows the same steps of playing cards."
  },
  {
    "number": "388.",
    "text": "Abilities when added to the Chain become Pending Items until they complete the steps of Playing."
  },
  {
    "number": "388.1.",
    "text": "When an Ability finishes the steps of playing it becomes a Chain Item just like a Spell."
  },
  {
    "number": "388.2.",
    "text": "When an Ability with the [Add] action is finalized it resolves immediately instead of becoming a Chain Item, like a Unit or Gear."
  },
  {
    "number": "389.",
    "text": "1. Activate or trigger the Ability"
  },
  {
    "number": "389.1.",
    "text": "Add a Pending Item to the chain representing the Ability that is either being Activated or Triggered. Notably, although this Chain Item will not have a card representing it, this will create a Closed State.\nSee rule 346. Playing Cards for more information."
  },
  {
    "number": "389.2.",
    "text": "If there is currently a game effect being resolved, continue resolving the game effect instead of continuing the following steps."
  },
  {
    "number": "390.",
    "text": "2. Make relevant choices"
  },
  {
    "number": "390.1.",
    "text": "Make all choices required for this ability, such as targets, options, or other relevant decisions.\nSee rule 346. Playing Cards for more information"
  },
  {
    "number": "390.2.",
    "text": "If legal options are not available for an Activated Ability, it is not legal to activate it."
  },
  {
    "number": "390.3.",
    "text": "If there are not enough options to make legal choices for a Triggered Ability that has been put on the chain, remove it from the Chain now. It ceases to be a Pending Item but never becomes a Chain Item."
  },
  {
    "number": "390.3.a.",
    "text": "This is not an Ability being countered."
  },
  {
    "number": "390.3.b.",
    "text": "If there are legal options to choose, the ability’s controller must choose them. They may not decline this stage of playing a Trigger."
  },
  {
    "number": "391.",
    "text": "3. Determine Total Cost"
  },
  {
    "number": "391.1.",
    "text": "Determine the base cost of the Ability."
  },
  {
    "number": "391.1.a.",
    "text": "Activated Abilities will have a cost listed before the “:” in their text."
  },
  {
    "number": "391.1.b.",
    "text": "Triggered Abilities will typically not have a base cost associated with them when placed on the chain due to their conditions."
  },
  {
    "number": "391.2.",
    "text": "Apply cost increases and decreases as a result of choices made in the prior step.\nSee rule 346. Playing Cards for more information."
  },
  {
    "number": "391.3.",
    "text": "Apply any other cost increases or decreases as necessary.\nSee rule 346. Playing Cards for more information."
  },
  {
    "number": "392.",
    "text": "4. Pay Costs"
  },
  {
    "number": "392.1.",
    "text": "Pay costs as determined in the prior step.\nSee rule 346. Playing Cards for more information."
  },
  {
    "number": "392.2.",
    "text": "At this stage, players may decline to pay for Triggered Abilities that have incurred a cost. If they do, the ability will cease being a Pending Item and be removed from the Chain. It never becomes a Chain Item."
  },
  {
    "number": "392.2.a.",
    "text": "This is not an Ability being countered."
  },
  {
    "number": "393.",
    "text": "5. Check Legality"
  },
  {
    "number": "393.1.",
    "text": "Ensure that the Ability’s targets are still legal."
  },
  {
    "number": "393.2.",
    "text": "Ensure that the Ability’s effect would not create an illegal state. If it would, resolve in the same way you would resolve a Card that creates an illegal state.\nSee rule 346. Playing Cards for more information."
  },
  {
    "number": "394.",
    "text": "6. Proceed with Play"
  },
  {
    "number": "394.1.",
    "text": "This Ability is no longer Pending."
  },
  {
    "number": "394.2.",
    "text": "This Ability becomes a Chain Item."
  },
  {
    "number": "394.3.",
    "text": "If there are other Pending Items on the Chain, their controllers perform the remaining steps of playing now."
  },
  {
    "number": "394.4.",
    "text": "Other players have an opportunity to play Reactions before the resolution of spells.\nSee rule 326. Chains for more information."
  },
  {
    "number": "394.5.",
    "text": "Otherwise, execute the Ability just like a Spell, then clear the Chain Item from the Chain."
  },
  {
    "number": "395.",
    "text": "Game Actions"
  },
  {
    "number": "396.",
    "text": "Game Actions are actions players may perform at any given time during the game."
  },
  {
    "number": "397.",
    "text": "A player, unless otherwise specified or prompted, may only perform actions on their turn."
  },
  {
    "number": "398.",
    "text": "There are two types of Game Actions:"
  },
  {
    "number": "398.1.",
    "text": "Discretionary Actions"
  },
  {
    "number": "398.1.a.",
    "text": "A Discretionary Action is a Game Action that may be performed at any time during a player's turn during a Neutral Open State.\nSee rule 307. States of the Turn for more information."
  },
  {
    "number": "398.1.b.",
    "text": "A player may take any number of Discretionary Actions available to them during their turn."
  },
  {
    "number": "398.1.b.1.",
    "text": "As long as any conditions, if applicable, are met."
  },
  {
    "number": "398.1.b.2.",
    "text": "As long as any costs, if applicable, are paid."
  },
  {
    "number": "398.1.b.3.",
    "text": "As long as it does not result in any forbidden action being taken or game state being created.\nExample: A player can't use the Standard Move discretionary action to move a unit to a Battlefield that's already occupied by Units controlled by two other players."
  },
  {
    "number": "398.2.",
    "text": "Limited Actions"
  },
  {
    "number": "398.2.a.",
    "text": "A Limited Action is a game action that a spell, ability, or circumstance of the turn's progression causes the player to perform. A player cannot perform these actions at-will."
  },
  {
    "number": "398.2.b.",
    "text": "These actions can only be taken when a player is instructed to do so as the execution of an effect or during their specified occasion during the turn.\nExample: A player may Draw during the Draw Step of the Beginning Phase of their turn or when instructed to do so by a spell or ability. They can't choose to Draw at any other time."
  },
  {
    "number": "399.",
    "text": "Types of Actions"
  },
  {
    "number": "400.",
    "text": "Draw"
  },
  {
    "number": "400.1.",
    "text": "Drawing a card takes a single card from the top of the Main Deck and adds it to the player's Hand."
  },
  {
    "number": "400.2.",
    "text": "This is a Limited Action."
  },
  {
    "number": "400.2.a.",
    "text": "Each player draws 1 during the Draw Step of their Beginning Phase."
  },
  {
    "number": "400.2.b.",
    "text": "The player may draw cards when instructed to do so by other game effects."
  },
  {
    "number": "400.3.",
    "text": "This action, when instructed, is formatted as \"Draw X.\""
  },
  {
    "number": "400.4.",
    "text": "If a player attempts to draw more cards than are available in their Main Deck, they do the following:"
  },
  {
    "number": "400.4.a.",
    "text": "Draw as many as possible."
  },
  {
    "number": "400.4.b.",
    "text": "Perform a Burn Out.\nSee rule 418. Burn Out for more information."
  },
  {
    "number": "400.4.c.",
    "text": "Draw the remaining cards needed to complete the Draw action."
  },
  {
    "number": "401.",
    "text": "Exhaust"
  },
  {
    "number": "401.1.",
    "text": "Exhausting is an action that marks a non-spell Game Object as \"spent.\""
  },
  {
    "number": "401.1.a.",
    "text": "To mark it, rotate the card 90 degrees opposite of Readying, so that the orientation of the card is lengthwise in front of you."
  },
  {
    "number": "401.1.b.",
    "text": "A Unit that is already Exhausted cannot be Exhausted again."
  },
  {
    "number": "401.1.c.",
    "text": "If a Unit is instructed to be Exhausted while it is already Exhausted, nothing additional happens."
  },
  {
    "number": "401.2.",
    "text": "\"Exhausted\" is a state for Game Objects that other game effects and rules can reference."
  },
  {
    "number": "401.3.",
    "text": "This is a Limited Action."
  },
  {
    "number": "401.3.a.",
    "text": "Most Exhaust actions will be costs for Activated Abilities or Discretionary Actions. Example: A unit's Standard Move exhausts the unit as a cost."
  },
  {
    "number": "401.4.",
    "text": "When Exhausting is listed as a Cost, then the Action must be able to be completed for the cost to be paid.\nExample: A spell says \"As an additional cost to play this, you may exhaust a friendly unit.\" An exhausted friendly unit may not be exhausted again as the additional cost for the spell, and the additional cost has not been paid."
  },
  {
    "number": "401.5.",
    "text": "In abilities, the Exhaust symbol represents the cost \"Exhaust this\" or \"Exhaust me.\" It resembles a card turning sideways."
  },
  {
    "number": "402.",
    "text": "Ready"
  },
  {
    "number": "402.1.",
    "text": "Readying is an action that marks a non-spell Game Object as available for action."
  },
  {
    "number": "402.1.a.",
    "text": "To mark it, rotate the card 90 degrees opposite of Exhausting, so that it is vertically oriented in front of you."
  },
  {
    "number": "402.1.b.",
    "text": "A Unit that is already Ready cannot be Readied again."
  },
  {
    "number": "402.1.c.",
    "text": "If a Unit is instructed to be Readied while it is already Ready, nothing additional happens."
  },
  {
    "number": "402.2.",
    "text": "\"Ready\" is a state for Game Objects that other game effects and rules can reference."
  },
  {
    "number": "402.3.",
    "text": "This is a Limited Action."
  },
  {
    "number": "402.3.a.",
    "text": "A player Readies all non-spell Game Objects they Control during the Ready Step of the Beginning Phase on their turn."
  },
  {
    "number": "402.3.b.",
    "text": "The player may also Ready their Game Objects when effects or spells instruct them to do so."
  },
  {
    "number": "403.",
    "text": "Recycle"
  },
  {
    "number": "403.1.",
    "text": "Recycling cards is the action in which a player takes one or more cards from a specific zone and then puts it on the bottom of the corresponding deck."
  },
  {
    "number": "403.1.a.",
    "text": "Main Deck cards are Recycled to the Main Deck."
  },
  {
    "number": "403.1.b.",
    "text": "Runes are Recycled to the Rune Deck."
  },
  {
    "number": "403.1.c.",
    "text": "Each player Recycles cards to their own Main Deck and Rune Deck, regardless of which player is instructed to perform the Recycle action."
  },
  {
    "number": "403.2.",
    "text": "This is a Limited Action."
  },
  {
    "number": "403.2.a.",
    "text": "The player must Recycle cards from the specified zones when instructed to do so by game effects or costs."
  },
  {
    "number": "403.3.",
    "text": "When Recycling is listed as a Cost, the action must be able to be completed for the cost to be paid.\nExample: Vi, Destructive has the ability \"Recycle 1 from your trash: Give me +1 [M] this turn.\" Each time a player activates the ability, they must recycle 1 card from their trash to pay its cost. If they have no cards in their trash, they can't activate the ability, because they can't pay its cost."
  },
  {
    "number": "403.4.",
    "text": "When Recycling is part of an effect, a player must Recycle as many cards as possible from the specified zone or zones."
  },
  {
    "number": "403.5.",
    "text": "If 2 or more cards are Recycled to the Main Deck simultaneously, they are placed on the bottom of that deck in a random order.\nExample: Garbage Grabber has the ability \"Recycle 3 from your trash, [1], [E]: Draw \" To pay the cost of activating this ability, its controller chooses 3 cards from their trash and places them on the bottom of their Main Deck in a random order."
  },
  {
    "number": "403.5.a.",
    "text": "If 2 or more cards are Recycled to the Rune Deck simultaneously, they are placed on the bottom of that deck in the order of their owner's choosing."
  },
  {
    "number": "403.6.",
    "text": "This action, when instructed, is sometimes formatted as \"Recycle X from [Zone].\" That means to take X cards of the instructed player's choice from the relevant zone and recycle them.\nExample: Dr. Mundo, Expert has the ability \"At the start of your Beginning Phase, recycle 3 from your trash.\" As that ability resolves, its controller recycles 3 cards from their trash. If there are fewer than 3 cards in that player's trash, they recycle as many as they can."
  },
  {
    "number": "404.",
    "text": "Deal"
  },
  {
    "number": "404.1.",
    "text": "Spells, Units, Abilities, and other game effects may Deal Damage to units."
  },
  {
    "number": "404.1.a.",
    "text": "Assigning Damage during Combat Resolution is not Dealing Damage, but will cause Damage to be Dealt when assignment is complete."
  },
  {
    "number": "404.1.b.",
    "text": "To Deal Damage to Units, mark the specified amount of Damage on the Unit."
  },
  {
    "number": "404.1.c.",
    "text": "Damage is marked on each unit separately."
  },
  {
    "number": "404.1.d.",
    "text": "Damage can be Dealt to more than one Unit at the same time."
  },
  {
    "number": "404.2.",
    "text": "Only Damage can be Dealt."
  },
  {
    "number": "404.3.",
    "text": "Dealing Damage is a Limited Action."
  },
  {
    "number": "404.3.a.",
    "text": "Assigning Damage causes Damage to be dealt outside of being directed to Deal Damage.\nSee rule 437. Combat for more information."
  },
  {
    "number": "404.4.",
    "text": "Dealing can have the intrinsic property of Bonus Damage."
  },
  {
    "number": "404.5.",
    "text": "Bonus Damage is a property granted to the action of Dealing and alters the amount of Damage distributed by this action.\nSee rule 712. Bonus Damage for more information."
  },
  {
    "number": "404.6.",
    "text": "Deal actions can originate from one or more sources."
  },
  {
    "number": "404.6.a.",
    "text": "If a game effect does not specify a source, the game effect describing the Deal action is the source.\nExample: Void Seeker is a spell that reads “Deal 4 to a unit at a battlefield. Draw 1.” The damage that Void Seeker instructs you to deal is dealt by Void Seeker."
  },
  {
    "number": "404.6.b.",
    "text": "If a game effect does specify a source, then that source is what is considered the origin of the Damage for this Deal action."
  },
  {
    "number": "404.6.b.1.",
    "text": "Units and Spells can be the source of Damage for Deal actions."
  },
  {
    "number": "404.6.b.2.",
    "text": "Abilities can be the source of Damage for Deal actions."
  },
  {
    "number": "404.6.b.2.a.",
    "text": "When an Ability is the source of Damage for a Deal action, it is in addition to the Spell or Unit that created that Ability.\nExample: Iron Ballista is a gear that says “[E]: Deal 2 to a unit at a battlefield.” This damage is dealt both by a gear and by an ability."
  },
  {
    "number": "404.6.b.3.",
    "text": "When a spell or ability specifies a Unit as the source of the Damage for the Deal action, it is not in addition to the spell or ability that specified it.\nExample: Challenge is a spell that reads “Choose a friendly unit and an enemy unit. They deal damage equal to their Mights to each other.” The damage that Challenge causes to be dealt is dealt by the chosen units, not by Challenge."
  },
  {
    "number": "404.6.c.",
    "text": "Damage Dealt as a result of being assigned during Combat has the Units as its source."
  },
  {
    "number": "404.6.c.1.",
    "text": "The Damage assigned, and subsequently Dealt, to attackers has the defenders as the source and vice versa."
  },
  {
    "number": "404.7.",
    "text": "Deal actions can distribute Damage as part of combat actions or non-combat actions."
  },
  {
    "number": "405.",
    "text": "Heal"
  },
  {
    "number": "405.1.",
    "text": "Damage being cleared from Units is Healing."
  },
  {
    "number": "405.1.a.",
    "text": "If Damage is cleared for any reason it is considered Healing."
  },
  {
    "number": "405.2.",
    "text": "More than one Unit can be Healed at the same time."
  },
  {
    "number": "405.3.",
    "text": "Healing is a Limited Action."
  },
  {
    "number": "405.3.a.",
    "text": "Players may only Heal units when game effects instruct them to, or at specific points in the turn."
  },
  {
    "number": "406.",
    "text": "Play"
  },
  {
    "number": "406.1.",
    "text": "A player Plays cards by paying costs associated with that card.\nSee rule 346. Playing Cards for more information."
  },
  {
    "number": "406.2.",
    "text": "This is a Discretionary Action."
  },
  {
    "number": "406.2.a.",
    "text": "As long as a player has the resources to pay the costs associated with the card, they may play cards."
  },
  {
    "number": "406.3.",
    "text": "Game effects may result in cards being played as part of their resolution."
  },
  {
    "number": "406.3.a.",
    "text": "This treats Play as a Limited Action."
  },
  {
    "number": "406.3.b.",
    "text": "Treat all steps of Play as normal, except as noted by the game effect creating this Limited Play Effect."
  },
  {
    "number": "406.3.c.",
    "text": "If there are no eligible cards to Play when instructed to Play in this manner like this, then nothing happens and resolution continues."
  },
  {
    "number": "406.4.",
    "text": "Some Abilities trigger when cards are played or otherwise check whether cards have been played."
  },
  {
    "number": "406.4.a.",
    "text": "These abilities trigger when the act of playing the card has been completed by the resolution of the card."
  },
  {
    "number": "406.4.b.",
    "text": "If a game effect prevents the resolution of the card—for example, because the card was countered—the card wasn't played and no abilities that trigger on playing cards trigger.\nSee rule 412. Counter for more information."
  },
  {
    "number": "407.",
    "text": "Move"
  },
  {
    "number": "407.1.",
    "text": "Moving is the act of a Game Object moving between two Locations on The Board."
  },
  {
    "number": "407.2.",
    "text": "Moving is a Limited Action."
  },
  {
    "number": "407.2.a.",
    "text": "Players may only move Game Objects when instructed to do so by Game Effects or costs."
  },
  {
    "number": "407.2.b.",
    "text": "The Standard Move inherent to Units may also cause Movement.\nSee rule 142 for more information on the Standard Move."
  },
  {
    "number": "407.3.",
    "text": "The Standard Move inherent to Units is a Discretionary Action."
  },
  {
    "number": "407.3.a.",
    "text": "The Cost is Exhausting one or more Units."
  },
  {
    "number": "407.3.b.",
    "text": "The Effect is Moving those Unit."
  },
  {
    "number": "408.",
    "text": "Hide"
  },
  {
    "number": "408.1.",
    "text": "Hiding a card is the act of placing a card facedown at a Battlefield you control."
  },
  {
    "number": "408.2.",
    "text": "Hiding is a Discretionary Action."
  },
  {
    "number": "408.2.a.",
    "text": "The Hidden keyword allows a player to pay a cost to Hide a card any time they have a Hidden card in their hand or Champion Zone and meet the prerequisites.\nSee rule 737. Hidden for more information."
  },
  {
    "number": "408.3.",
    "text": "Cards that are facedown at Battlefields have their gameplay properties and permissions defined by the effect that put them there.\nExample: Cards that players Hide with the Hidden keyword can be Played for [0] on any subsequent turn as a property of the Hidden keyword."
  },
  {
    "number": "408.4.",
    "text": "If a facedown card would be put into a zone whose Privacy is Private or Secret, or if the game ends, its owner reveals it to all players.\nSee rule 127. Privacy for more information."
  },
  {
    "number": "409.",
    "text": "Discard"
  },
  {
    "number": "409.1.",
    "text": "Discarding a card is moving it from a player's hand directly into their trash without activating or executing its normal rules text."
  },
  {
    "number": "409.1.a.",
    "text": "The player who is performing the action chooses which cards to send to their Trash, and may use Private Information to do so."
  },
  {
    "number": "409.1.b.",
    "text": "“When I am discarded” abilities or other Triggered Abilities that trigger on discarding are executed after discarding has occurred."
  },
  {
    "number": "409.2.",
    "text": "Discarding is a Limited Action."
  },
  {
    "number": "409.2.a.",
    "text": "A player must Discard cards when instructed to do so by game effects or costs."
  },
  {
    "number": "409.3.",
    "text": "When Discarding is listed as a Cost, then the Action must be able to be completed for the cost to be paid.\nExample: A card has the ability \"Discard 2: Deal 2 damage to a unit at a battlefield.\" To activate the ability, the card's controller must have at least 2 cards in hand and must be able to discard them."
  },
  {
    "number": "409.4.",
    "text": "When Discarding is part of an effect, then a player must Discard as many cards as possible from their hand. If instructed to discard more cards than they have in their hand, further discard instructions are ignored.\nExample: Undercover Agent has the ability \"[Deathknell] — Discard 2, then draw 2. (When I die, get the effect.)\" If Undercover Agent's controller has 2 or more cards in hand, they must discard 2. If they have 1 card in hand, they discard 1, and the rest of the discard instruction is ignored. If they have no cards in hand, the entire discard instruction is ignored. Regardless of how many cards they discard, they then draw 2."
  },
  {
    "number": "409.5.",
    "text": "This action is formatted as \"Discard X.\""
  },
  {
    "number": "410.",
    "text": "Stun"
  },
  {
    "number": "410.1.",
    "text": "Stunning is the act of selecting one or more Units on the Board and rendering them Stunned."
  },
  {
    "number": "410.1.a.",
    "text": "Stunned is a binary state. A Unit is Stunned or it isn't."
  },
  {
    "number": "410.1.a.1.",
    "text": "A Stunned Unit can not be Stunned again.\nExample: Eclipse Herald has the ability \"When you stun an enemy unit, ready me and give me +1 [M] this turn.\" Its controller plays a spell that reads \"Stun a unit.\" They may choose a unit that's already stunned, but if they do, Eclipse Herald will not trigger."
  },
  {
    "number": "410.1.a.2.",
    "text": "Stunned Units lose the Stunned status at the beginning of the next Ending Step."
  },
  {
    "number": "410.1.b.",
    "text": "A Stunned Unit does not contribute its might to damage in combat."
  },
  {
    "number": "410.1.c.",
    "text": "A Stunned Unit must still have damage applied to it equal to, or greater than, its full might value to be killed."
  },
  {
    "number": "410.2.",
    "text": "Stunning is a Limited Action."
  },
  {
    "number": "410.2.a.",
    "text": "Players may only Stun Units when directed to by Game Effects."
  },
  {
    "number": "411.",
    "text": "Reveal"
  },
  {
    "number": "411.1.",
    "text": "Revealing is the act of presenting a card to all players from a zone that one or more players do not have access to the information of."
  },
  {
    "number": "411.1.a.",
    "text": "Revealed is a temporary state and is not a zone."
  },
  {
    "number": "411.1.a.1.",
    "text": "Other cards, including the card being revealed, can reference the act of being Revealed."
  },
  {
    "number": "411.1.a.2.",
    "text": "Cards remain in the zone they are being Revealed from. Example: If a card is being Revealed from the top of a player's Main Deck, it is still the top card of that player's Main Deck."
  },
  {
    "number": "411.1.b.",
    "text": "Unless otherwise described, Revealed cards do nothing else beyond become temporarily known information to all players."
  },
  {
    "number": "411.2.",
    "text": "Revealing is a Limited Action."
  },
  {
    "number": "411.2.a.",
    "text": "Players may only Reveal cards from Private or Secret zones when instructed to do so by Game Effects."
  },
  {
    "number": "411.2.b.",
    "text": "During the course of a game of Riftbound, a player may choose to show Private information to one or more other players. This does not count as revealing and does not trigger any effects that trigger when cards are revealed."
  },
  {
    "number": "411.3.",
    "text": "This action is formatted as \"Reveal cards from [zone].\"\nExample: \"Reveal 2 cards from the top of your Main Deck\" would be executed by taking the two cards from the top of your Main Deck, and then presenting them to all players to clearly read and understand at the table. Then, when all players have had a chance to understand the revealed information, return them to the top of the deck in the same order."
  },
  {
    "number": "411.4.",
    "text": "Game Effects can manipulate or modify the cards Revealed while they are Revealed"
  },
  {
    "number": "411.4.a.",
    "text": "While cards are Revealed, those cards can be further manipulated, or accessed. They can even have their destination modified for when the Reveal ends.\nExample: \"Reveal 2 cards from the top of your Main Deck. Put one into your hand and Recycle the other\" would be executed by taking the top two cards from your Main Deck to the table, and once every player present has had a chance to understand them you would make the selection of one of them to add to your hand. The one you did not select would then be Recycled to the bottom of the Main Deck."
  },
  {
    "number": "412.",
    "text": "Counter"
  },
  {
    "number": "412.1.",
    "text": "Countering is the act of negating the execution, activation, or otherwise playing of a card by a player."
  },
  {
    "number": "412.1.a.",
    "text": "A card that is Countered does nothing and is then placed in the Trash."
  },
  {
    "number": "412.1.b.",
    "text": "A card that is Countered is not considered to have been played."
  },
  {
    "number": "412.1.c.",
    "text": "Countering does not refund any costs paid to play a card."
  },
  {
    "number": "412.1.c.1.",
    "text": "This includes additional costs."
  },
  {
    "number": "412.2.",
    "text": "Countering is a Limited Action."
  },
  {
    "number": "412.2.a.",
    "text": "Players may only Counter cards when directed to by Game Effects."
  },
  {
    "number": "412.3.",
    "text": "This action is formatted as \"Counter [a card or ability on the chain].\""
  },
  {
    "number": "413.",
    "text": "Buff"
  },
  {
    "number": "413.1.",
    "text": "Buffing is the action of placing a Buff counter on a Unit.\nSee rule 701. Buffs for more information."
  },
  {
    "number": "413.1.a.",
    "text": "A Buff is also an object."
  },
  {
    "number": "413.1.b.",
    "text": "To Buff a unit, place a Buff Counter on it if it does not have one already"
  },
  {
    "number": "413.1.b.1.",
    "text": "If the unit already has a Buff Counter on it, it does not get another one."
  },
  {
    "number": "413.1.c.",
    "text": "Units with Buff Counters can still be chosen for actions that Buff units, but will not be Buffed as part of the execution.\nExample: A spell reads \"Buff a unit. Then, if it was buffed this way, draw a card.\" It will place a buff counter on a unit that has no buff counter, and then its controller will draw a card. However, if the player chooses a unit with a buff counter on it already, then the card will not be drawn."
  },
  {
    "number": "413.2.",
    "text": "Buffing is a Limited Action."
  },
  {
    "number": "413.2.a.",
    "text": "Players may only Buff units when Game Effects direct them to do so."
  },
  {
    "number": "413.3.",
    "text": "This action is formatted as \"Buff [one or more units].\"\ne.g., \"Buff a unit.\"\ne.g., \"Buff a friendly unit.\"\ne.g., \"Buff two friendly units at the same battlefield.\""
  },
  {
    "number": "414.",
    "text": "Banish"
  },
  {
    "number": "414.1.",
    "text": "Banishing is the action of placing a card from any zone to Banishment. See 107.5. Banishment for more information."
  },
  {
    "number": "414.2.",
    "text": "When a card is Banished it is placed directly into the Banishment zone from its origin."
  },
  {
    "number": "414.2.a.",
    "text": "Banish is not a subset of Kill."
  },
  {
    "number": "414.2.b.",
    "text": "Banish is not a subset of Discard."
  },
  {
    "number": "414.3.",
    "text": "Cards and effects can refer to cards that were banished by the same object."
  },
  {
    "number": "414.3.a.",
    "text": "Separate instances of an object or effect banishing cards do not reference other banished cards by objects of the same name or effects originating from cards of the same name.\nExample: A spell reads \"Banish the top card of your Main Deck. When you conquer this turn, draw it.\" This card effect allows you to draw the banished card from banishment if a condition is met. If more than one of these effects is played, each one triggers separately. Each card will be drawn separately. If the turn player passes the turn without playing the card, the card remains in banishment indefinitely. If the same player plays another copy of the same spell, banishes another card, and satisfies its condition, they could play the new banished card, but not the original banished card."
  },
  {
    "number": "414.4.",
    "text": "Banishing is a Limited Action."
  },
  {
    "number": "414.4.a.",
    "text": "Players may only Banish cards or permanents when Game Effects direct them to do so."
  },
  {
    "number": "414.5.",
    "text": "This action is formatted as \"Banish [one or more permanents or cards].\"\ne.g., \"Banish a card from your hand.\"\ne.g., \"Banish 2 cards from your trash.\"\ne.g., \"Look at the top 2 cards of your Main Deck. Draw one of them and banish the other.\""
  },
  {
    "number": "415.",
    "text": "Kill"
  },
  {
    "number": "415.1.",
    "text": "Killing is the action of a Permanent going to the trash from the board."
  },
  {
    "number": "415.1.a.",
    "text": "This can be Active or Passive."
  },
  {
    "number": "415.1.a.1.",
    "text": "Active Kill is when the action is taken when instructed by a game effect or as a cost for a card or ability."
  },
  {
    "number": "415.1.a.1.a.",
    "text": "This is referred to as a Kill Instruction."
  },
  {
    "number": "415.1.a.1.b.",
    "text": "When a unit with a Deathknell is to be put in the Trash due to a Kill Instruction, it first has its Deathknell added to the chain as a Pending Item. Note the unit’s location, attributes, and other relevant information to process its Deathknell when finalized before completing this Kill Instruction."
  },
  {
    "number": "415.1.a.2.",
    "text": "Passive Kill is when the action is taken as a result of Lethal Damage or as a consequence for any other state."
  },
  {
    "number": "415.2.",
    "text": "When a permanent is killed it is placed directly in the trash from its place of origin."
  },
  {
    "number": "415.2.a.",
    "text": "It is only considered Killed if its origin was any zone on the board."
  },
  {
    "number": "415.2.b.",
    "text": "This is not a subset of Move."
  },
  {
    "number": "415.3.",
    "text": "Killing is a Limited Action."
  },
  {
    "number": "415.3.a.",
    "text": "Players may only Kill units when Game Effects direct them to do so."
  },
  {
    "number": "415.4.",
    "text": "Killing can also be the result of resolving a Cleanup."
  },
  {
    "number": "415.5.",
    "text": "Killing can be attributed to one or more Game Objects."
  },
  {
    "number": "415.5.a.",
    "text": "The Killed Unit or Gear is said to be Killed by that Game Object."
  },
  {
    "number": "415.5.b.",
    "text": "A spell or ability that contains a Kill instruction is responsible for Killing the Unit or Gear."
  },
  {
    "number": "415.5.c.",
    "text": "When one or more Units is killed due to a Cleanup, the spell or ability that resolved immediately prior to that Cleanup that applied damage to the Unit or Units is responsible for that Kill action."
  },
  {
    "number": "415.5.d.",
    "text": "Abilities originating from Game Objects that are responsible for Kill Actions are responsible in addition to the Game Object that created them.\nExample: Falling Star is a spell that says “Do this twice: Deal 3 to a unit.” Immortal Phoenix is a unit that says “When you kill a unit with a spell, you may pay [1][C] to play me from your trash.” A player plays Falling Star while Immortal Phoenix is in their trash. The “do this” phrasing on Falling Star means that it has a reflexive triggered ability, which places two triggered abilities on the chain. As each of those triggered abilities resolve, it deals damage to the unit chosen for that ability. If one of these abilities deals lethal damage to a unit, both Falling Star and its ability are considered sources of the damage, and so both Falling Star and its ability are responsible for killing the unit. This means that Falling Star’s controller killed a unit with a spell, so Immortal Phoenix’s ability will trigger."
  },
  {
    "number": "415.6.",
    "text": "This action is formatted as \"Kill [one or more permanents].\"\ne.g., \"Kill an enemy unit.\"\ne.g., \"Kill this, [2]: Draw 1.\"\ne.g., \"Kill all gear.\""
  },
  {
    "number": "416.",
    "text": "Add"
  },
  {
    "number": "416.1.",
    "text": "Adding is the action of putting resources into a player's Rune Pool."
  },
  {
    "number": "416.2.",
    "text": "Spells, triggered abilities, and activated abilities that Add resources finalize immediately."
  },
  {
    "number": "416.2.a.",
    "text": "Priority and Focus will not pass from Add abilities being finalized, and will resolve before any other outstanding items on the chain are finalized."
  },
  {
    "number": "416.3.",
    "text": "Activated abilities that Add resources and have the Reaction tag can be activated during the playing or resolution of other spells and abilities, any time that those spells or abilities require that resources be paid.\nExample: A player can add Energy and Power through any means before initiating the process of playing a spell. After initiating that process, in the Pay Costs step, they may activate Add Reactions to add Energy or Power to pay costs."
  },
  {
    "number": "416.4.",
    "text": "Adding is a Limited Action."
  },
  {
    "number": "416.4.a.",
    "text": "Players may only Add resources when Game Effects direct them to do so."
  },
  {
    "number": "416.5.",
    "text": "This action is formatted as \"Add [one or more resources].\"\ne.g., \"Add [2].\" means \"Add 2 Energy.\"\ne.g., \"[E]: Add [Y].\" means \"Add 1 Power of the Order domain.\"\ne.g., \"Add [1][G].\" means \"Add 1 Energy and 1 Power of the Calm domain.\""
  },
  {
    "number": "417.",
    "text": "Channel"
  },
  {
    "number": "417.1.",
    "text": "Channeling is the action of taking one or more Runes from the top of a player's Rune Deck and putting them on the board."
  },
  {
    "number": "417.2.",
    "text": "The Game Effect that instructs a player to channel 1 or more runes may specify the conditions or circumstances under which those runes enter the board. Example: A spell reads \"Channel 1 rune exhausted.\" As that spell resolves, its controller puts the top rune of their rune deck onto the board and that rune enters the board exhausted rather than ready."
  },
  {
    "number": "417.3.",
    "text": "Channeling is a Limited Action."
  },
  {
    "number": "417.3.a.",
    "text": "Players may only channel runes when Game Effects direct them to do so."
  },
  {
    "number": "417.4.",
    "text": "This action is formatted as \"Channel X rune(s),\" optionally followed by conditions or stipulations.\ne.g., \"Channel 1 rune.\"\ne.g., \"When you play me, channel 1 rune exhausted.\"\ne.g., \"Channel 2 runes exhausted. If you couldn't channel 2 runes this way, draw 1.\""
  },
  {
    "number": "418.",
    "text": "Burn Out"
  },
  {
    "number": "418.1.",
    "text": "Burning Out is an action a player must perform if they attempt to move one or more cards from their Main Deck to any other zone in excess of the number of cards remaining in their Main Deck:"
  },
  {
    "number": "418.1.a.",
    "text": "If a player must Draw cards in excess to the number of cards in their deck, they will Draw as many as possible, perform this action, then Draw the remaining amount instructed."
  },
  {
    "number": "418.1.b.",
    "text": "If a player must put one or more cards from their Main Deck in any other zone, such as the Trash, in excess of the number of cards in their deck they will do so as much as possible, perform this action, and then complete the remaining number required by the instruction."
  },
  {
    "number": "418.1.c.",
    "text": "If an instruction directs a player to look at or reveal cards in excess to the number of cards in a player’s Main Deck, that player looks at or Reveals as many as possible, but does not Burn Out, then proceeds with the rest of the instruction."
  },
  {
    "number": "418.1.c.1.",
    "text": "If there are insufficient cards among the looked at or revealed cards to perform subsequent actions to the revealed or looked at cards, any further instructions are ignored. This does not cause a Burn Out, even if those instructions would cause those cards to change zones.\nReminder: Cards are considered in the zone of origin while being looked at or revealed, in this case the Main Deck."
  },
  {
    "number": "418.2.",
    "text": "To Burn Out, a player does the following in sequence:"
  },
  {
    "number": "418.2.a.",
    "text": "Performs as much of the prescribed action as possible."
  },
  {
    "number": "418.2.b.",
    "text": "Recycles their trash into their Main Deck.\nReminder: When multiple cards are Recycled to the Main Deck at the same time, those cards must be randomized"
  },
  {
    "number": "418.2.c.",
    "text": "Chooses an opponent to gain 1 point."
  },
  {
    "number": "418.2.d.",
    "text": "Completes the remainder of the action that caused them to burn out.\nExample: A player attempts to draw 1 during their Draw Phase while their Main Deck is empty. That player instead recycles their trash into their Main Deck, randomizing it as normal, then chooses an opponent to gain 1 point, and then draws 1."
  },
  {
    "number": "418.3.",
    "text": "A player's Main Deck may remain empty as they Burn Out, usually because their trash is also empty. When they attempt to perform the original action again, it will cause another Burn Out."
  },
  {
    "number": "418.3.a.",
    "text": "Unless some effect intervenes, this will result in them burning out repeatedly, giving 1 point to an opponent each time, until an opponent passes the Victory Score and wins the game."
  },
  {
    "number": "418.4.",
    "text": "Burning Out is a Limited Action."
  },
  {
    "number": "418.4.a.",
    "text": "Players may only burn out when Game Effects direct them to do so."
  },
  {
    "number": "418.5.",
    "text": "Burning Out is a Replacement Effect.\nSee rule 364. Replacement Effects for more information."
  },
  {
    "number": "419.",
    "text": "Double"
  },
  {
    "number": "419.1.",
    "text": "Doubling is the act of increasing a numeric attribute by an amount equal to that attribute’s current value."
  },
  {
    "number": "419.1.a.",
    "text": "This creates an effect that modulates that attribute by that specific amount for the duration specified by the Game Effect that instructed the player to perform this action.\nExample: A unit with 3 base Might and Shield 2 is in combat as a Defender. Since Shield applies, its current Might is 5. A player chooses it as the target for Last Stand, a spell that reads in part “Double a friendly unit's Might this turn.” Its current Might is 5, so it gets +5 Might this turn, for a current Might of 10. After combat, Shield no longer applies, but the +5 Might from Last Stand does, so the unit’s Might is 8."
  },
  {
    "number": "419.2",
    "text": "Doubling is a Limited Action."
  },
  {
    "number": "419.2.a.",
    "text": "Players may only Double when Game Effects direct them to do so."
  },
  {
    "number": "420.",
    "text": "Swap"
  },
  {
    "number": "420.1.",
    "text": "Swapping is the act of increasing one numeric value and decreasing another numeric value on some number of Game Objects such that their values are reversed."
  },
  {
    "number": "420.1.a.",
    "text": "Swapping creates two different effects that apply to each attribute. One that Increases one value and one that Decreases the other."
  },
  {
    "number": "420.1.b.",
    "text": "To accomplish this, determine the difference between these values and then apply an Increase for that amount to the lower value of the two attributes, and a Decrease of that amount to the higher value of the two attributes."
  },
  {
    "number": "420.1.c",
    "text": "If both attributes are the same numeric value, Swapping has no effect."
  },
  {
    "number": "420.2.",
    "text": "Swapping is a Limited Action."
  },
  {
    "number": "420.2.a",
    "text": "Players may only swap when Game Effects direct them to do so."
  },
  {
    "number": "421.",
    "text": "Attach"
  },
  {
    "number": "421.1.",
    "text": "Attaching is the act of linking two cards on the board together to combine their effects in some way. This causes one or more cards to become Attached and at least one card to become a Top-Most Card.\nSee rule 716 Attachment for more information."
  },
  {
    "number": "421.1.a.",
    "text": "Attaching affects two cards at once."
  },
  {
    "number": "421.1.a.1.",
    "text": "One card will be designated as the one being Attached, and thus become Attached. The other will become the Top-Most Card."
  },
  {
    "number": "421.1.b.",
    "text": "This is represented by physically laying the Top-Most card on top of the other or others such that all Effect Texts and Might Bonuses are showing, but nothing else from the card or cards Attached."
  },
  {
    "number": "421.1.b.1.",
    "text": "In the situation where there is more than one card attached to the Top-Most card, they should be stacked in such a way that all Effect Text boxes and Might Bonuses are readable. The order of the Attached cards has no bearing on the application of effects."
  },
  {
    "number": "421.1.c.",
    "text": "The Top-Most card has all Effect Text of all cards Attached to it appended to its Rules Text."
  },
  {
    "number": "421.1.d.",
    "text": "The Top-Most Card has its Might modulated by the Might Bonus of all cards Attached to it."
  },
  {
    "number": "421.1.e.",
    "text": "Attaching one or more cards will cause those cards’ Rules Text to become Inactive for as long as they remain Attached.\nSee rule 716 Attachment for more information."
  },
  {
    "number": "421.1.f.",
    "text": "Attaching a card will cause it to Detach from any card to which it is currently Attached."
  },
  {
    "number": "421.2.",
    "text": "Attaching is a Limited Action."
  },
  {
    "number": "421.2.a.",
    "text": "Players may only Attach cards when directed to by Game Effects."
  },
  {
    "number": "421.3.",
    "text": "Attaching cards does not inherently choose or specify a target. However, Game Effects that Attach cards may do so."
  },
  {
    "number": "421.4.",
    "text": "When a card Attaches to a card, its location becomes the same as the new Top-Most Card."
  },
  {
    "number": "421.4.a.",
    "text": "This is not a Move."
  },
  {
    "number": "422.",
    "text": "Detach"
  },
  {
    "number": "422.1.",
    "text": "Detaching is the act of unlinking two cards that are currently linked through the act of Attaching. This causes one to cease being Attached, and potentially causes the other to cease being a Top-Most card."
  },
  {
    "number": "422.1.a.",
    "text": "Detaching affects only cards that are currently Attached to another card."
  },
  {
    "number": "422.1.a.1.",
    "text": "Game effects that instruct a player to Detach a card that is currently not Attached to anything will do nothing."
  },
  {
    "number": "422.1.b.",
    "text": "When one or more cards become Detached, they cease to be in the Attached state."
  },
  {
    "number": "422.1.b.1.",
    "text": "To represent this, these cards should no longer be placed under the card they were previously placed under as Top-Most Card."
  },
  {
    "number": "422.1.b.2.",
    "text": "If the Top-Most Card no longer has any cards Attached to it after this, it is no longer a Top-Most Card."
  },
  {
    "number": "422.1.c.",
    "text": "The card being Detached has its Effect Text become Inactive and its Rules Text cease being Inactive."
  },
  {
    "number": "422.1.d.",
    "text": "The Top-Most Card ceases to have the Effect Text of the card being Detached appended to its Rules Text."
  },
  {
    "number": "422.1.e.",
    "text": "The Top-Most Card ceases to have its Might modulated by the Might Bonus of the card being Detached."
  },
  {
    "number": "422.2.",
    "text": "Detaching is a Limited Action."
  },
  {
    "number": "422.2.a.",
    "text": "Players may only Detach cards when directed to by Game Effects."
  },
  {
    "number": "422.3.",
    "text": "Detaching cards does not inherently choose, or specify a target. However, Game Effects that Detach cards may."
  },
  {
    "number": "422.4.",
    "text": "When a card Detaches from a Top-Most Card, its location is the same as the Top-Most Card from which it Detached."
  },
  {
    "number": "422.4.a.",
    "text": "If the Detached card was a Gear and this causes it to become present at a Battlefield, it will be Recalled during the next Cleanup."
  },
  {
    "number": "422.4.b.",
    "text": "If the Attached card was Detached because the Top-Most Card changed zones from a board zone to a non-board zone, then the location that the Attached Card will Detach to is the last location the Top-Most Card was at before changing from a board zone to a non-board zone."
  },
  {
    "number": "423.",
    "text": "Movement"
  },
  {
    "number": "424.",
    "text": "Moving is a Limited Action."
  },
  {
    "number": "424.1.",
    "text": "A Permanent changing its position from any space on the Board to another space on the Board is a Move, unless it is caused by a corrective Recall.\nSee rule 407. Move for more information."
  },
  {
    "number": "424.2.",
    "text": "A card changing game zones does not in itself constitute a Move."
  },
  {
    "number": "424.3.",
    "text": "Moving is instantaneous."
  },
  {
    "number": "424.3.a.",
    "text": "There is no state for Permanents between locations."
  },
  {
    "number": "424.3.b.",
    "text": "Permanents are either at their Origin before Moving or their Destination after Moving."
  },
  {
    "number": "424.3.c.",
    "text": "Moving does not use the Chain, nor is it able to be Reacted to."
  },
  {
    "number": "425.",
    "text": "Moving is defined by the Origin and Destination of the Permanent that is changing locations."
  },
  {
    "number": "425.1.",
    "text": "The Origin is where the Permanent is starting from."
  },
  {
    "number": "425.2.",
    "text": "The Destination is where the Permanent is going to."
  },
  {
    "number": "425.2.a.",
    "text": "In Modes of Play with more than two players, Battlefields with Staged Combats or Combats in Progress are Invalid Destinations for Moves of all kinds (Standard Moves or otherwise) by Units controlled by Players who don't already have permanents at that Battlefield."
  },
  {
    "number": "425.2.b.",
    "text": "If an action would require a Move that would cause a Unit to become present in a Location where it cannot move for any reason, such as a Battlefield with two players that are not the controller of the Unit performing this Move action are in a Combat or such a Combat is Staged, it instead Recalls.\nSee rule 432. Recalls for more information."
  },
  {
    "number": "425.3.",
    "text": "Units are the only Permanents that can Move."
  },
  {
    "number": "426.",
    "text": "Players may choose to move their Units with the Standard Move.\nSee rule 142. for more information on the Standard Move."
  },
  {
    "number": "427.",
    "text": "Spells, Abilities, or other effects may cause a Move to occur."
  },
  {
    "number": "427.1.",
    "text": "The source of the Move will provide details on any restrictions on legality for Destination."
  },
  {
    "number": "427.2.",
    "text": "Units cannot Move to a Battlefield that already has units from 2 other players present by any means."
  },
  {
    "number": "428.",
    "text": "The Destination becomes Contested if it is a Battlefield not controlled by the controller of the Unit or Units that moved."
  },
  {
    "number": "429.",
    "text": "Units may cause a Showdown without a Combat when they Move."
  },
  {
    "number": "429.1.",
    "text": "A Showdown is opened when a Move causes a Battlefield to become Contested while it has no Units present from any player other than those that just moved."
  },
  {
    "number": "430.",
    "text": "Units may cause Combat when they Move."
  },
  {
    "number": "430.1.",
    "text": "A Combat is triggered when a Move causes a Battlefield to become Contested and Units controlled by opposing players.\nSee rule 437. Combat for more information."
  },
  {
    "number": "431.",
    "text": "When a Move action is complete, perform a Cleanup."
  },
  {
    "number": "432.",
    "text": "Recalls"
  },
  {
    "number": "433.",
    "text": "A Recall is when a Permanent is relocated from anywhere to its Base without it being a Move."
  },
  {
    "number": "434.",
    "text": "Recalls are not Moves."
  },
  {
    "number": "434.1.",
    "text": "They do not cause Triggered Abilities to trigger that are triggered by Move actions."
  },
  {
    "number": "434.2.",
    "text": "A Recall causes a Permanent to change locations."
  },
  {
    "number": "434.3.",
    "text": "A Recall cannot be prevented by actions and Game Effects that restrict or block Movement."
  },
  {
    "number": "435.",
    "text": "Gear can be Recalled."
  },
  {
    "number": "435.1.",
    "text": "When an un-attached Gear is created or played at a battlefield, or is at a battlefield for any other reason, it is Recalled to its controller's base during the next Cleanup.\nExample: An Equipment is attached to a unit at a battlefield, so the Equipment is present at that battlefield. If the unit dies, the Equipment will be recalled during the next cleanup."
  },
  {
    "number": "436.",
    "text": "Recalls do not affect the state of the Permanent being recalled."
  },
  {
    "number": "436.1.",
    "text": "Unless otherwise stated by the source of the Recall, Damage, Exhausted Status, Buffed Status, and applied Layer alterations will all remain unaffected by a Recall."
  },
  {
    "number": "437.",
    "text": "Combat"
  },
  {
    "number": "438.",
    "text": "A Combat occurs when a Cleanup occurs, there are no items on the Chain, and a Battlefield has Units controlled by two opposing players."
  },
  {
    "number": "439.",
    "text": "Combat is considered Staged if there are units controlled by two opposing players at a Battlefield but the Steps of Combat have not been initiated."
  },
  {
    "number": "439.1.",
    "text": "If more than one Battlefield has Units controlled by opposing players at it at the same time, the Turn Player decides which Combat to resolve first."
  },
  {
    "number": "439.2.",
    "text": "If Staged Combats stop being Staged before the Steps of Combat are initiated, they are not resolved or executed."
  },
  {
    "number": "440.",
    "text": "Combat can only occur between Units controlled by exactly two players."
  },
  {
    "number": "440.1.",
    "text": "In Modes of Play with more than two players, Battlefields with Staged Combats or Combats in Progress are Invalid Destinations for Moves of all kinds (Standard Moves or otherwise) by Units controlled by Players who don't already have Units at that Battlefield.\nSee rule 425.2.a. for more information on Invalid Destinations."
  },
  {
    "number": "440.2.",
    "text": "In Modes of Play with more than two players, Battlefields with Staged Combats or Combats in Progress are Invalid to be chosen as a location to play one or more Units by a player not involved in that Combat by any means,"
  },
  {
    "number": "440.2.a.",
    "text": "If an effect would require a Unit be played to a Battlefield with a Staged Combat or a Combat in Progress, where the controller of the played unit is not a participant, instead the Unit is played to its controller's Base."
  },
  {
    "number": "440.2.b.",
    "text": "Any subsequent reference to \"here\" in the corresponding effect is reassigned to the Controller's Base, where the Unit was played. Any further effects that may be invalidated are invalidated as if the effect was mistargeted.\nSee rule 352.5. Targeting for more information on Mistargeting."
  },
  {
    "number": "440.3.",
    "text": "All choices that would result in a Combat occurring between more than two players simultaneously are invalid and ineligible to be completed."
  },
  {
    "number": "441.",
    "text": "The Steps of Combat"
  },
  {
    "number": "442.",
    "text": "Step 1: The Showdown Step"
  },
  {
    "number": "442.1.",
    "text": "A Showdown opens at this time."
  },
  {
    "number": "442.1.a.",
    "text": "Establish who is Attacker and who is Defender."
  },
  {
    "number": "442.1.a.1.",
    "text": "The Attacker is the player whose unit(s) applied the Contested status to the Battlefield. They gain the Attacker designation now."
  },
  {
    "number": "442.1.a.1.a.",
    "text": "This player gains Focus as this Showdown begins."
  },
  {
    "number": "442.1.a.2.",
    "text": "The Defender is the player who did not apply the Contested status to the Battlefield. They gain the Defender designation now."
  },
  {
    "number": "442.1.a.3.",
    "text": "Units at the Contested Battlefield controlled by the Attacker gain the Attacker designation now."
  },
  {
    "number": "442.1.a.3.a.",
    "text": "If a Unit controlled by the Attacker becomes present at this Battlefield after this moment, it will gain the Attacker designation during the Cleanup phase following the action that caused it to become present"
  },
  {
    "number": "442.1.a.4.",
    "text": "Units at the Contested Battlefield controlled by the Defender gain the Defender designation now."
  },
  {
    "number": "442.1.a.4.a.",
    "text": "If a Unit controlled by the Defender becomes present at this Battlefield after this moment it will gain the Defender designation during the Cleanup phase following the action that caused it to become present"
  },
  {
    "number": "442.1.b.",
    "text": "Finalize items on the Initial Chain if establishing Attacker and Defender has caused Triggered Abilities to become Pending."
  },
  {
    "number": "442.1.b.1.",
    "text": "The Attacking player, who has Focus, places Triggered Abilities on the Chain first, followed by all non-Defender players in Turn Order, followed by the Defending Player."
  },
  {
    "number": "442.1.c.",
    "text": "The State Closes if an Initial Chain was created."
  },
  {
    "number": "442.1.c.1.",
    "text": "Otherwise the Showdown continues, with the State Open as normal."
  },
  {
    "number": "442.1.d.",
    "text": "Players proceed with any play on the Chain as normal."
  },
  {
    "number": "442.1.e.",
    "text": "Focus does not pass upon closure of the Initial Chain, if any."
  },
  {
    "number": "443.",
    "text": "Step 2: The Combat Damage Step"
  },
  {
    "number": "443.1.",
    "text": "When the Showdown closes, Attackers and Defenders resolve Combat Damage at the Battlefield that was attacked, using their current Might."
  },
  {
    "number": "443.1.a.",
    "text": "The Combat Damage Step only occurs if both Attacking and Defending units remain at the location."
  },
  {
    "number": "443.1.a.1.",
    "text": "If neither Attacking Units nor Defending Units remain at this stage, the Combat Damage Step is skipped."
  },
  {
    "number": "443.1.b.",
    "text": "Sum the Might of all Attacking Units."
  },
  {
    "number": "443.1.c.",
    "text": "Sum the Might of all Defending Units."
  },
  {
    "number": "443.1.d.",
    "text": "Starting with the Attacker, each player assigns an amount of damage equal to their summed Might among the other's Units."
  },
  {
    "number": "443.1.d.1.",
    "text": "Assigning Damage is not Dealing Damage."
  },
  {
    "number": "443.1.d.1.a.",
    "text": "When all Damage is assigned, it will be Dealt simultaneously. These actions are not synonymous."
  },
  {
    "number": "443.1.d.2.",
    "text": "Abilities or effects may influence the order in which damage is assigned. Reminder: Lethal Damage is non-zero damage equaling or exceeding the Might of a Unit."
  },
  {
    "number": "443.1.d.3.",
    "text": "Units must have lethal damage assigned to them in full before damage is assigned to a different Unit.\nExample: If a player has 5 damage to distribute among four 3 Might units, they may not choose to assign 2 damage to one of the units and 1 damage to each of the remaining 3. They must assign at least 3 damage to one, and the remaining 2 to another."
  },
  {
    "number": "443.1.d.4.",
    "text": "Units cannot have more damage assigned to them than the minimum required to constitute lethal damage unless no further units remain to have damage assigned to them."
  },
  {
    "number": "443.1.d.5.",
    "text": "A player must obey all requirements and restrictions on damage assignment if able.\nExample: A player is assigning damage to the following units: a unit with Tank (\"I must be assigned combat damage first.\"); Caitlyn, Patrolling (\"I must be assigned combat damage last.\"); and another unit without any abilities. That player must assign combat damage first to the unit with Tank, then to the unit with no abilities, then to Caitlyn."
  },
  {
    "number": "443.1.d.6.",
    "text": "If multiple Units have abilities or effects that require a player to assign them damage with the same priority, that player may assign damage to those units in any order.\nExample: A player is assigning damage to the following units: two units with Tank (\"I must be assigned combat damage first.\") and one unit with no abilities. That player chooses one of the units with Tank and assigns combat damage to it. Then they must assign any remaining damage first to the other unit with Tank, then to the unit with no abilities."
  },
  {
    "number": "443.1.d.7.",
    "text": "If a Unit has one or more Abilities or effects applying to it that demand it be assigned damage in a specific way that is exclusionary, then the assigning player chooses only one of those abilities to apply when assigning damage.\nExample: Caitlyn, Patrolling (\"I must be assigned combat damage last.\") has been given the Tank ability (\"I must be assigned combat damage first.\"). A player is assigning damage to this Caitlyn with Tank and two units with no abilities. That player can’t fulfill both of Caitlyn’s damage requirements, so they may choose to assign damage to Caitlyn first, fulfilling the Tank requirement, or last, fulfilling Caitlyn’s printed requirement. They can’t choose to apply damage to Caitlyn in between the other two units, because that wouldn’t fulfill either requirement."
  },
  {
    "number": "443.1.d.8.",
    "text": "If there is more than one unit in which this situation applies to, each unit is dealt with individually. The assigning player chooses which ability or effect applies, and then resolves the assignment. If this creates a situation where now more than one unit must be assigned with the same priority, those units may be assigned damage in any order as normal within that priority.\nExample: Two copies of Caitlyn, Patrolling (\"I must be assigned combat damage last.\") have been given the Tank ability (\"I must be assigned combat damage first.\"). A player assigning damage to these two Caitlyns and one unit with no abilities could choose to fulfill both Caitlyns’ Tank requirements by assigning them both damage before the other unit."
  },
  {
    "number": "443.1.d.9.",
    "text": "If a unit cannot be dealt damage, then no amount of damage can be considered lethal. Such a unit is exempt from any considerations of mandatory assignment.\nExample: Kayn, Unleashed says “If I have moved twice this turn, I don't take damage.” While Kayn can’t take damage, it is ignored for the purposes of assigning lethal damage in combat."
  },
  {
    "number": "443.1.e.",
    "text": "Deal Damage to each unit equal to the amount assigned to it."
  },
  {
    "number": "444.",
    "text": "Step 3: The Resolution Step"
  },
  {
    "number": "444.1.",
    "text": "1. Perform a Combat Cleanup."
  },
  {
    "number": "444.1.a.",
    "text": "Invoke a Combat Special Cleanup."
  },
  {
    "number": "444.1.a.1.",
    "text": "Insert “2c. Heal all Units.”"
  },
  {
    "number": "444.1.a.2.",
    "text": "Insert “2d. Recall Attackers present at the Battlefield if Defenders are still present.”\nSee rule 432. Recalls for more information."
  },
  {
    "number": "444.1.a.3.",
    "text": "Insert “2e. Remove Attacker and Defender Designation from all Units and Players.”"
  },
  {
    "number": "444.2.",
    "text": "2. If no Showdown or Combat is staged at this location, the player with Units remaining here Establishes Control."
  },
  {
    "number": "444.2.a.",
    "text": "Clear the Contested Status."
  },
  {
    "number": "444.2.b.",
    "text": "This results in a Conquer if that player has not yet scored that Battlefield this turn.\nSee rule 182. Control for more information on Control.\nSee rule 446.1. for more information on Conquering."
  },
  {
    "number": "444.2.c.",
    "text": "This does not have to be the player that applied Contested to the Battlefield."
  },
  {
    "number": "444.2.d.",
    "text": "If there are no Units remaining here controlled by any player, the Battlefield becomes Uncontrolled."
  },
  {
    "number": "445.",
    "text": "Scoring"
  },
  {
    "number": "446.",
    "text": "A player Scores in one of two ways:"
  },
  {
    "number": "446.1.",
    "text": "Conquer: A player gains Control of a Battlefield they did not yet Score this turn."
  },
  {
    "number": "446.1.a.",
    "text": "In Modes of Play with teammates, Battlefields under the Control of a teammate during the Beginning Phase are also disqualified from being Scored through Conquer by any means."
  },
  {
    "number": "446.1.b.",
    "text": "A player will gain control of a Battlefield after establishing Control by applying Contested first."
  },
  {
    "number": "446.2.",
    "text": "Hold: A player maintains Control of a Battlefield during their Beginning Phase."
  },
  {
    "number": "447.",
    "text": "A player may only Score, from either method, once per Battlefield per turn."
  },
  {
    "number": "448.",
    "text": "When a player Scores, two things occur:"
  },
  {
    "number": "448.1.",
    "text": "The player earns up to one Point, depending on their current score."
  },
  {
    "number": "448.1.a.",
    "text": "The Final Point has additional restrictions."
  },
  {
    "number": "448.1.a.1.",
    "text": "Notably, points earned from sources that are not Conquer or Hold are not beholden to these restrictions."
  },
  {
    "number": "448.1.b.",
    "text": "When a player tries to earn a Point through a Score, and their current Point Total is 1 point from the Victory Score of the Mode of Play, the following occurs:"
  },
  {
    "number": "448.1.b.1.",
    "text": "If the player has Scored through Hold, that player scores the Final Point."
  },
  {
    "number": "448.1.b.2.",
    "text": "If the player has Scored through a Conquer and has Scored every Battlefield through either method this turn, that player scores the Final Point. If the player has Scored through a Conquer and has not Scored every Battlefield this turn, that player draws a card."
  },
  {
    "number": "448.2.",
    "text": "Trigger Score abilities at the Battlefield that Scored."
  },
  {
    "number": "448.2.a.",
    "text": "Conquer abilities trigger at a Battlefield that was Conquered."
  },
  {
    "number": "448.2.b.",
    "text": "Hold abilities trigger at a Battlefield that was Held."
  },
  {
    "number": "448.2.c.",
    "text": "These will only trigger when the Battlefield is Scored; I.E. These cannot be triggered more than once per turn for a player."
  },
  {
    "number": "449.",
    "text": "When a player accrues Points equal to the Victory Score for their Mode of Play, they Win the Game immediately."
  },
  {
    "number": "450.",
    "text": "Layers"
  },
  {
    "number": "451.",
    "text": "Layers are the mechanism in which Game Effects alter the Traits, Intrinsic Abilities, or other properties of Game Objects."
  },
  {
    "number": "452.",
    "text": "Layers are an organizational structure."
  },
  {
    "number": "452.1.",
    "text": "Layers only serve to structure the application and order that Game Effects apply to Game Objects to maintain consistency."
  },
  {
    "number": "453.",
    "text": "The layers are applied repeatedly until all effects operating on objects have been applied once and no changes have been processed."
  },
  {
    "number": "453.1.",
    "text": "Layers are applied in sequence. Each effect in them is applied as soon as able, and only a single time across all sequences."
  },
  {
    "number": "453.2.",
    "text": "When a sequence of applications completes, recur the process, and evaluate each layer again applying any effects that may now be applicable."
  },
  {
    "number": "453.3.",
    "text": "The removal or disqualification of an effect is separate from the application of the effect, but still can only be applied once.\nExample: Fiora, Victorious has printed Might 4 and says “While I'm Mighty, I have Deflect, Ganking, and Shield.” If a player places a buff on Fiora, her Might is increased in the Arithmetic layer, after the layer for Ability-Altering Effects. The Ability-Altering Effect layer is then re-checked and the abilities Deflect, Ganking, and Shield applied. Since each effect has been applied once and there are no other effects to apply, Fiora’s characteristics are finalized as 5 Might with Deflect, Ganking, and Shield. While a buffed Fiora, Victorious is in combat as a defender, an additional +1 Might will be applied in the Arithmetic layer, giving her 6 Might and the 3 keywords.\nExample: A buffed Fiora, Victorious is in combat as a defender when her buff is removed. Reevaluating the layers in sequence, she no longer gains Deflect, Ganking, and Shield during the Ability-Altering Effect layer, so when the Arithmetic layer is evaluated, neither the buff (which is gone) nor Shield (which she no longer has) apply. She goes directly from 6 Might with three keywords to 4 Might with no keywords.."
  },
  {
    "number": "454.",
    "text": "Layers are applied in the following order:"
  },
  {
    "number": "454.1.",
    "text": "1. Trait-Altering Effects"
  },
  {
    "number": "454.1.a.",
    "text": "This layer deals with effects that grant, remove, or replace inherent traits of Game Objects.\nName\nSuper Type\nType\nTags\nController\nCost\nDomain"
  },
  {
    "number": "454.1.a.1.",
    "text": "Assignment of Might is dealt with in this layer.\nExample: A spell reads \"A unit's Might becomes 4 this turn.\" The unit's Might is set to 4 in this layer."
  },
  {
    "number": "454.1.b.",
    "text": "One Game Object becoming a copy of another."
  },
  {
    "number": "454.1.b.1.",
    "text": "All Traits, including the Rules Text, replace or are added to those of the original Game Object as specified by the Game Effect directing the Copy. This is applied in this layer."
  },
  {
    "number": "454.1.c.",
    "text": "Effects for this layer can be identified by the phrase \"become(s)\", \"give,\" \"is,\" or \"are\" in the text.\nExample: A permanent has the ability \"Other friendly units are Yordles.\" Other friendly units gain the Yordle tag in this layer."
  },
  {
    "number": "454.2.",
    "text": "2. Ability-Altering Effects"
  },
  {
    "number": "454.2.a.",
    "text": "This layer deals with effects that grant, remove, or replace the abilities or rules text of Game Objects.\nKeywords\nPassive Abilities\nAppending rules text\nRemoving rules text\nDuplicating Rules Text from one Game Object to another"
  },
  {
    "number": "454.2.b.",
    "text": "Effects for this layer can be identified by the phrase \"become(s),\" \"give,\" \"lose(s),\" \"have,\" \"has,\" \"is,\" or \"are\" in the text.\nExample: A permanent has the ability \"Other friendly units have [Vision].\" Other friendly units gain the Vision keyword in this layer."
  },
  {
    "number": "454.2.c.",
    "text": "Abilities of Effect Text of Attached cards are appended in this layer."
  },
  {
    "number": "454.3.",
    "text": "3. Arithmetic"
  },
  {
    "number": "454.3.a.",
    "text": "This layer deals with the mathematics of increasing and decreasing the numeric values of the traits of Game Objects.\nMight\nEnergy Cost\nPower Cost"
  },
  {
    "number": "454.3.b.",
    "text": "When an arithmetic effect has a limitation that applies, it is limited at the time of its application, and is “remembered” at that limited level for the duration of its effect. This process is called “snapshotting.”\nExample: If an effect gives a unit “-4 [M] to a min of 1 until end of turn” choosing a unit with 2 [M], then the effect will generate -1 [M] until end of turn."
  },
  {
    "number": "454.3.c.",
    "text": "Might Bonuses of Attached cards are applied in this layer."
  },
  {
    "number": "454.3.d.",
    "text": "This layer applies arithmetic in the following way."
  },
  {
    "number": "454.3.d.1.",
    "text": "1. Increases"
  },
  {
    "number": "454.3.d.1.a.",
    "text": "Positive values, or increases, to Might are applied first."
  },
  {
    "number": "454.3.d.1.b",
    "text": "If there is a restriction or limitation to this increase, the limitation is “snapshotted” for the duration of the effect."
  },
  {
    "number": "454.3.d.2.",
    "text": "2. Decreases"
  },
  {
    "number": "454.3.d.2.a.",
    "text": "Negative values, or decreases, to Might are applied last."
  },
  {
    "number": "454.3.d.2.b.",
    "text": "If there is a restriction or limitation to this decrease, the limitation is snapshotted for the duration of the effect."
  },
  {
    "number": "455.",
    "text": "If more than one effect applies to the same Game Object in the Same Layer, or to each other in the same layer, then both effects will apply but their order may be determined by Dependency."
  },
  {
    "number": "455.1.",
    "text": "A Dependency is established if:"
  },
  {
    "number": "455.1.a.",
    "text": "Applying one of the effects alters the existence of the other; or"
  },
  {
    "number": "455.1.b.",
    "text": "Applying one of the effects alters the number of objects the other effect can influence"
  },
  {
    "number": "455.1.c.",
    "text": "Applying one of the effects alters the outcome when applying the other non- deterministically"
  },
  {
    "number": "456.",
    "text": "To determine which effect Depends on another, determine which of the prior criteria applies, and then also which effect’s evaluation is altered by the sequence of applications. That effect is said to Depend on the other."
  },
  {
    "number": "456.1.",
    "text": "To resolve a dependency, the effects within the same layer that created the dependency must be applied such that:\n1. Identify which effect Depends on the other within the Layer.\n2. Apply the effect that is depended on first.\n3. Immediately apply the effect that Depends on the first effect next."
  },
  {
    "number": "457.",
    "text": "If more than one effect applies in the same layer but no dependency is established, then Timestamp order is applied to the effects within that layer and sublayer"
  },
  {
    "number": "457.1.",
    "text": "When an effect begins applying, it establishes a time for which it is compared against other Game Effects for purposes of resolving Layered effects as its Timestamp."
  },
  {
    "number": "457.1.a.",
    "text": "Timestamps are not rote values."
  },
  {
    "number": "457.1.b.",
    "text": "Timestamps are relative comparisons between effects and when they began applying to the game."
  },
  {
    "number": "457.1.c.",
    "text": "Timestamps are not referenced by Game Effects in any way. They are only used to finalize layered effects."
  },
  {
    "number": "457.2.",
    "text": "When Rules Text becomes Inactive for any reason, it loses its Timestamp. When it ceases to be Inactive, a new Timestamp is established."
  },
  {
    "number": "457.3.",
    "text": "Effects are applied such that the earliest Timestamp within each Layer and Sublayer applies first, followed by other Effects in that Layer and Sublayer in chronological order."
  },
  {
    "number": "458.",
    "text": "Modes of Play"
  },
  {
    "number": "459.",
    "text": "There are multiple methods of playing Riftbound."
  },
  {
    "number": "460.",
    "text": "A Mode of Play must define several variables for the game."
  },
  {
    "number": "460.1.",
    "text": "Number of Players: How many people are playing the game."
  },
  {
    "number": "460.2.",
    "text": "Formation of Players: How the players are organized while playing."
  },
  {
    "number": "460.2.a.",
    "text": "This defines if a player is alone or on a team."
  },
  {
    "number": "460.2.b.",
    "text": "This defines the number of opponents."
  },
  {
    "number": "460.3.",
    "text": "Victory Score: The point total a player or team must reach to win."
  },
  {
    "number": "460.3.a.",
    "text": "Victory Scores can be any positive number."
  },
  {
    "number": "460.4.",
    "text": "Battlefield Count: Determines how many Battlefields are in play, contributed by players, during play."
  },
  {
    "number": "460.4.a.",
    "text": "This may influence deck building requirements in competitive settings."
  },
  {
    "number": "460.4.b.",
    "text": "This may involve utilizing less Battlefields than there are players."
  },
  {
    "number": "460.5.",
    "text": "Setup: Any changes to initial setup required for this mode."
  },
  {
    "number": "460.6.",
    "text": "Format: Conditions to win or additional rules added over play."
  },
  {
    "number": "460.7.",
    "text": "First Turn Process: Adjustments to each player's first turn."
  },
  {
    "number": "460.8.",
    "text": "Unique Rules"
  },
  {
    "number": "460.8.a.",
    "text": "If any, they will be appended here."
  },
  {
    "number": "461.",
    "text": "Sanctioned Modes"
  },
  {
    "number": "462.",
    "text": "1v1 (Duel)"
  },
  {
    "number": "462.1.",
    "text": "2 Players"
  },
  {
    "number": "462.2.",
    "text": "1v1\n1 opponent each\nNo teams"
  },
  {
    "number": "462.3.",
    "text": "Victory Score: 8"
  },
  {
    "number": "462.4.",
    "text": "Battlefield Count: 2"
  },
  {
    "number": "462.4.a.",
    "text": "Each player provides three (3) Battlefields, included in their deck during deck building. Only 1 will be used, chosen during setup."
  },
  {
    "number": "462.5.",
    "text": "Setup: Each player randomly selects one (1) of their three (3) Battlefields. The other two are removed and will not be used for this game. The selected Battlefields are placed in the Battlefield Zone."
  },
  {
    "number": "462.6.",
    "text": "Format: Best of 1. The first player to reach the Victory Score in Points wins the Match."
  },
  {
    "number": "462.7.",
    "text": "First Turn Process: The player going second channels an extra Rune from their Rune Deck during their first Channel Phase of the game."
  },
  {
    "number": "463.",
    "text": "1v1 (Match)"
  },
  {
    "number": "463.1.",
    "text": "2 Players"
  },
  {
    "number": "463.2.",
    "text": "1v1\n1 opponent each\nNo teams"
  },
  {
    "number": "463.3.",
    "text": "Victory Score: 8"
  },
  {
    "number": "463.4.",
    "text": "Battlefield Count: 2"
  },
  {
    "number": "463.4.a.",
    "text": "Each player provides three (3) Battlefields, included in their deck during deck building. Only 1 will be used, chosen during setup."
  },
  {
    "number": "463.5.",
    "text": "Setup: Each player selects one (1) of their three (3) Battlefields. The other two are set aside and will not be used for this round of play. The selected Battlefields are placed in the Battlefield Zone. After this game, the Battlefields that were used are to be removed and not selected again for this Match. One of the remaining Battlefields that were set aside must be chosen instead."
  },
  {
    "number": "463.6.",
    "text": "Format: Best of 3. The first player to reach the Victory Score in Points wins the game. The winner of that game earns One Set Point. Players then reset the game state, remove the Battlefields in play from the game, choose new Battlefields from those set aside, and play again. The first player to earn Two Set Points wins."
  },
  {
    "number": "463.7.",
    "text": "First Turn Process: The player going second channels an extra Rune from their Rune Deck during their first Channel Phase of the game."
  },
  {
    "number": "464.",
    "text": "FFA3 (Skirmish)"
  },
  {
    "number": "464.1.",
    "text": "3 Players"
  },
  {
    "number": "464.2.",
    "text": "FFA\n2 opponents each\nNo teams"
  },
  {
    "number": "464.3.",
    "text": "Victory Score: 8"
  },
  {
    "number": "464.4.",
    "text": "Battlefield Count: 3"
  },
  {
    "number": "464.4.a.",
    "text": "Each player provides three (3) Battlefields, included in their deck during deck building. Only 1 will be used, chosen during setup."
  },
  {
    "number": "464.5.",
    "text": "Setup: Each player randomly selects one (1) of their three (3) Battlefields. The other two are discarded and will not be used for this game. The selected Battlefields are placed between the three Players before play and will be used for this game."
  },
  {
    "number": "464.6.",
    "text": "Format: Best of 1. The first player to reach the Victory Score in Points wins the Match."
  },
  {
    "number": "464.7.",
    "text": "First Turn Process: The player going first does not draw a card during their first Draw Phase of the game. The player going last channels an extra Rune from their Rune Deck during their first Channel Phase of the game."
  },
  {
    "number": "465.",
    "text": "FFA4 (War)"
  },
  {
    "number": "465.1.",
    "text": "4 Players"
  },
  {
    "number": "465.2.",
    "text": "FFA\n3 opponents each\nNo teams"
  },
  {
    "number": "465.3.",
    "text": "Victory Score: 8"
  },
  {
    "number": "465.4.",
    "text": "Battlefield Count: 3"
  },
  {
    "number": "465.4.a.",
    "text": "Each player provides three (3) Battlefields, included in their deck during deck building."
  },
  {
    "number": "465.4.b.",
    "text": "The player who is taking the first turn removes their Battlefields. They will not be used."
  },
  {
    "number": "465.5.",
    "text": "Setup: Each player who is not going first randomly selects one (1) of their three (3) Battlefields. The other two are removed and will not be used for this game. The selected Battlefields are placed between the players before play and will be used for this game."
  },
  {
    "number": "465.6.",
    "text": "Format: Best of 1. The first player to reach the Victory Score in Points wins the Match."
  },
  {
    "number": "465.7.",
    "text": "First Turn Process: The player going first does not draw a card during their first Draw Phase of the game. The player going last channels an extra Rune from their Rune Deck during their first Channel Phase of the game."
  },
  {
    "number": "466.",
    "text": "2v2 (Magma Chamber)"
  },
  {
    "number": "466.1.",
    "text": "4 Players"
  },
  {
    "number": "466.2.",
    "text": "2v2\n2 opponents each\n1 teammate"
  },
  {
    "number": "466.3.",
    "text": "Victory Score: 11"
  },
  {
    "number": "466.4.",
    "text": "Battlefield Count: 3"
  },
  {
    "number": "466.4.a.",
    "text": "Each player provides one (1) Battlefield, included in their deck during deck building."
  },
  {
    "number": "466.4.b.",
    "text": "The player who is taking the first turn removes their Battlefields. They will not be used."
  },
  {
    "number": "466.5.",
    "text": "Setup:"
  },
  {
    "number": "466.5.a.",
    "text": "Each player who is not going first randomly selects one (1) of their three (3) Battlefields. The other two are removed and will not be used for this game. The selected Battlefields are placed between the players before play and will be used for this game."
  },
  {
    "number": "466.5.b.",
    "text": "Turn order alternates teams."
  },
  {
    "number": "466.5.b.1.",
    "text": "The first player will be followed by an opponent, then the first player's teammate, then the first opponent's teammate, and so on."
  },
  {
    "number": "466.5.b.2.",
    "text": "If allies are sitting across from each other, turn order proceeds clockwise as normal."
  },
  {
    "number": "466.5.b.3.",
    "text": "If allies are sitting next to each other, turn order is passed across the table."
  },
  {
    "number": "466.6.",
    "text": "Format: Best of 1. The first team to reach the Victory Score in Points wins the Match."
  },
  {
    "number": "466.6.a.",
    "text": "Teammates win or lose together."
  },
  {
    "number": "466.6.a.1.",
    "text": "If one player Concedes, then the entire team loses."
  },
  {
    "number": "466.6.a.2.",
    "text": "If one player Loses, then the entire team loses."
  },
  {
    "number": "466.6.a.3.",
    "text": "If one player Wins, then the entire team wins."
  },
  {
    "number": "466.7.",
    "text": "First Turn Process: The player going first does not draw a card during their first Draw Phase of the game. The player going last channels an extra Rune from their Rune Deck during their first Channel Phase of the game."
  },
  {
    "number": "466.8.",
    "text": "Unique Rules"
  },
  {
    "number": "466.8.a.",
    "text": "Players may play spells during their Teammate's Turn."
  },
  {
    "number": "466.8.b.",
    "text": "Battlefields controlled during the Beginning Phase of a player's turn by that player's teammate are disqualified from being scored by that Team, that turn. Example: A player may not induce their partner to retreat, and then conquer a Battlefield their teammate was controlling."
  },
  {
    "number": "466.8.c.",
    "text": "Control is not shared."
  },
  {
    "number": "466.8.c.1.",
    "text": "Players may not Hide cards at Battlefields controlled by their Teammate."
  },
  {
    "number": "466.8.c.2.",
    "text": "Players may not issue Standard Movement to their Teammate's Units."
  },
  {
    "number": "466.8.d.",
    "text": "Friendly describes controlled Game Objects by a player or their Teammate. Example: \"When I am played, ready a friendly unit\" could target a player's own Units or their teammate's Units."
  },
  {
    "number": "466.8.e.",
    "text": "Hands are still Private Information."
  },
  {
    "number": "466.8.e.1.",
    "text": "Players are not restricted in what they say to their Teammate, however."
  },
  {
    "number": "466.8.e.1.a.",
    "text": "Feel free to openly communicate, honestly or cryptically."
  },
  {
    "number": "466.8.e.1.b.",
    "text": "Revealing Cards is still a game action and cannot be done unless instructed.\nSee rule 411. Reveal for more information."
  },
  {
    "number": "466.8.f.",
    "text": "The Final Point has an adjustment to the criteria when scoring."
  },
  {
    "number": "466.8.f.1.",
    "text": "When scoring the Final Point from Conquer, a player must Score each Battlefield in the same turn, excepting any that were occupied by their ally during that turn’s Beginning Phase."
  },
  {
    "number": "466.8.f.2.",
    "text": "No other changes to Final Point restrictions."
  },
  {
    "number": "466.8.g.",
    "text": "Teammates may not utilize the same Champion Legend."
  },
  {
    "number": "466.8.h.",
    "text": "Teammates may not utilize the same Battlefields."
  },
  {
    "number": "649.",
    "text": "Conceding"
  },
  {
    "number": "650.",
    "text": "A player may concede at any time."
  },
  {
    "number": "651.",
    "text": "When a player concedes, they are removed from the game in progress."
  },
  {
    "number": "651.1.",
    "text": "If only one other player is remaining after a player has conceded, the player remaining Wins."
  },
  {
    "number": "651.2.",
    "text": "If more than one player remains after a concession, follow the steps for the Removal of a Player."
  },
  {
    "number": "651.3.",
    "text": "Removal of a player involves them no longer being able to make choices or otherwise influence the game."
  },
  {
    "number": "651.4.",
    "text": "If the player has Teammates due to the Mode of Play, that player’s Teammates also lose and are removed from the game."
  },
  {
    "number": "652.",
    "text": "If the game continues, follow these steps for Removal of a Player."
  },
  {
    "number": "652.1.",
    "text": "Banish all permanents and runes they currently control and all permanents and runes they own."
  },
  {
    "number": "652.2.",
    "text": "Remove the Battlefield they contributed to the game if it is in use."
  },
  {
    "number": "652.2.a.",
    "text": "If it was in use, replace it with a token battlefield with no abilities."
  },
  {
    "number": "652.2.b.",
    "text": "Any units or hidden cards there do not move and are otherwise unaffected by this process."
  },
  {
    "number": "652.2.c.",
    "text": "If the removed battlefield was applying any continuous effects, those continuous effects immediately cease, which may cause changes in the characteristics of units or hidden cards there.\nExample: A battlefield reads \"Units here have +1 [M].\" If that battlefield's owner concedes and the battlefield is removed from the game as a result, units there immediately cease to get +1 [M]."
  },
  {
    "number": "652.3.",
    "text": "Remove all cards they own from the game."
  },
  {
    "number": "652.4.",
    "text": "Counter all spells and abilities of all types controlled by the player that has conceded."
  },
  {
    "number": "652.5.",
    "text": "Proceed with the game."
  },
  {
    "number": "652.5.a.",
    "text": "Turn"
  },
  {
    "number": "652.5.a.1.",
    "text": "If the removed player was the Turn Player, play proceeds in Turn Order to the next available player in order."
  },
  {
    "number": "652.5.b.",
    "text": "Focus"
  },
  {
    "number": "652.5.b.1.",
    "text": "If the removed player had Focus in a Showdown, the next Player in order receives Focus."
  },
  {
    "number": "652.5.b.2.",
    "text": "If the player being removed creates a state where all Players have Passed their Focus, the Showdown ends and play proceeds as necessary, E.G. Combat is resolved or a Cleanup is completed."
  },
  {
    "number": "652.5.c.",
    "text": "Priority"
  },
  {
    "number": "652.5.c.1.",
    "text": "If the removed player had Priority during a Chain, the next Player in order receives Priority."
  },
  {
    "number": "652.5.c.2.",
    "text": "If the player being removed creates a state where all Players have passed Priority, then the most recent spell or ability on the Chain will resolve with Priority being re-established as appropriate for the state after the resolution of that spell or ability."
  },
  {
    "number": "700.",
    "text": "Additional Rules"
  },
  {
    "number": "701.",
    "text": "Buffs"
  },
  {
    "number": "702.",
    "text": "Buffs are objects placed on Units."
  },
  {
    "number": "702.1.",
    "text": "Buffs can be tracked with a buff reminder card from a Riftbound booster pack or with any spare object in your surroundings."
  },
  {
    "number": "702.2.",
    "text": "Buffs can be added or spent."
  },
  {
    "number": "702.2.a.",
    "text": "To Buff a Unit, a player chooses a Unit and then places a buff on it. That Unit is Buffed for as long as the buff remains on it."
  },
  {
    "number": "702.2.b.",
    "text": "Spending a Buff removes a single Buff counter from a Unit."
  },
  {
    "number": "702.2.b.1.",
    "text": "A buff cannot be spent from a Unit that does not have a buff."
  },
  {
    "number": "702.2.b.2.",
    "text": "A player can only spend buffs on units they control."
  },
  {
    "number": "702.3.",
    "text": "There can only be one Buff on a Unit at a time."
  },
  {
    "number": "702.3.a.",
    "text": "If a Buff is added, or instructed to be added, on a Unit that already has a Buff, it is not placed instead."
  },
  {
    "number": "703.",
    "text": "Each Buff individually contributes +1 Might to a Unit."
  },
  {
    "number": "704.",
    "text": "Buffs are Game Objects and may be referenced, counted, or targeted by other effects as specified."
  },
  {
    "number": "705.",
    "text": "If a Unit leaves play, remove all Buffs from it."
  },
  {
    "number": "705.1.",
    "text": "Champions do not retain Buffs in the Champion Zone, even if they return there somehow."
  },
  {
    "number": "706.",
    "text": "Mighty"
  },
  {
    "number": "707.",
    "text": "Mighty is a description that applies to some units. Other game effects can check whether a unit is Mighty."
  },
  {
    "number": "708.",
    "text": "A Unit \"is Mighty\" as long as its Might is 5 or greater."
  },
  {
    "number": "709.",
    "text": "A Unit \"becomes Mighty\" at the moment its Might changes from being less than 5 to being 5 or greater.\nExample: A Unit with Might 4 that gets +1 [M] becomes Mighty.\nExample: A Unit with Might 5 that gets +1 [M] does not become Mighty, because it was already Mighty."
  },
  {
    "number": "710.",
    "text": "Units on the board are evaluated according to their current Might.\nExample: A unit with a base Might of 3 is targeted by a spell that reads \"A unit gets +3 [M] this turn.\" As that spell resolves, its Might changes from 3 to 6, and it becomes Mighty. When that effect expires at the end of the turn, it will no longer be Mighty."
  },
  {
    "number": "711.",
    "text": "Units in Non-Board Zones are evaluated according to their inherent Might.\nExample: A unit in the trash is Mighty if its printed Might is 5 or greater. It doesn't matter if there were effects raising or lowering its might while it was on the board."
  },
  {
    "number": "712.",
    "text": "Bonus Damage"
  },
  {
    "number": "713.",
    "text": "Bonus Damage is an intrinsic property that can be granted to Deal actions that influence the amount of Damage that the action is distributing."
  },
  {
    "number": "714.",
    "text": "If more than one instance of Bonus Damage is applied or granted to a Deal action, all instances are summed and applied once."
  },
  {
    "number": "714.1.",
    "text": "Bonus Damage can only be a positive value, and can only increase the amount of Damage being distributed."
  },
  {
    "number": "714.2.",
    "text": "If, for any reason, Bonus Damage would be a negative number, then no Bonus Damage is applied to the action."
  },
  {
    "number": "715.",
    "text": "Bonus Damage applies to the total damage Dealt by one instance of the action."
  },
  {
    "number": "715.1.",
    "text": "If the Deal action has a single target, the amount of Damage to that target will be increased by the Bonus Damage granted to it."
  },
  {
    "number": "715.2.",
    "text": "If the Deal action has multiple targets, the amount of Damage dealt to each target is increased by Bonus Damage individually and separately.\nExample: Singularity is a spell that says “Deal 6 to each of up to two units.” A player plays Singularity while they also control Annie, Fiery, a unit that says “Your spells and abilities deal 1 Bonus Damage.” Singularity deals 1 Bonus Damage to both of its targets, dealing 7 to each."
  },
  {
    "number": "715.3.",
    "text": "If the Deal action Splits damage, then the Bonus Damage applies to the amount of Damage that will be Split. This can alter the number of targets eligible to be chosen.\nExample: Volibear, Furious is a unit that says in part “When I attack, deal 5 damage split among any number of enemy units here.” A player attacks with Volibear, Furious while they also control Annie, Fiery, a unit that says “Your spells and abilities deal 1 Bonus Damage.” Volibear, Furious now deals 6 damage split among any number of enemy units at its location, and can choose to split that damage among up to 6 units rather than the usual 5."
  },
  {
    "number": "716.",
    "text": "Attachment"
  },
  {
    "number": "717.",
    "text": "Attaching is a limited action that causes cards to become linked to each other to combine their effects in some way. This causes one card to become Attached and the other to become A Top-Most Card.\nSee rule 421 Attach for more information."
  },
  {
    "number": "718.",
    "text": "Attached is the state of a card being linked to another card in this way."
  },
  {
    "number": "718.1.",
    "text": "A card remains in this state until Detached."
  },
  {
    "number": "718.2.",
    "text": "While in this state, the card’s Rules Text is Inactive.\nSee rule 720 Inactive for more information."
  },
  {
    "number": "718.3.",
    "text": "While in this state, Abilities in the card’s Effect Text are appended to the Rules Text of the Top-Most Card."
  },
  {
    "number": "718.4.",
    "text": "While in this state, the card’s Might Bonus modulates the Top-Most Card’s Might by the value listed."
  },
  {
    "number": "718.5.",
    "text": "Attached cards still have all properties of being a card on the board while in this state."
  },
  {
    "number": "718.5.a.",
    "text": "Attached cards still have all Types and Tags while Attached."
  },
  {
    "number": "718.5.b.",
    "text": "Attached cards still can be chosen or targeted by game effects while Attached."
  },
  {
    "number": "718.6.",
    "text": "Attached cards cannot be moved separately from the Top-Most Card they are Attached to."
  },
  {
    "number": "718.7.",
    "text": "A card may be Attached only to a single Top-Most card at a time."
  },
  {
    "number": "718.8.",
    "text": "Attached cards may have different Controllers from their Top-Most card."
  },
  {
    "number": "718.8.a.",
    "text": "Changes in Control of the Top-Most card do not impact Control of Attached cards and vice versa."
  },
  {
    "number": "718.8.b.",
    "text": "An Attached card still appends the abilities in its Effect Text to the Rules Text of the Top-Most card and modulates the Top-Most Card’s Might by its Might Bonus."
  },
  {
    "number": "719.",
    "text": "A Top-Most Card is a card that has one or more cards linked to it through the process of Attaching."
  },
  {
    "number": "719.1.",
    "text": "The Effect Text of all cards Attached to this card are appended to the Rules Text of this card for as long as they remain Attached."
  },
  {
    "number": "719.2.",
    "text": "This card ceases being a Top-Most Card when there are no longer any cards Attached to it."
  },
  {
    "number": "719.3.",
    "text": "A Top-Most Card and all cards Attached to it are at the same location."
  },
  {
    "number": "719.3.a.",
    "text": "When the Top-Most Card moves, all Attached cards move with it."
  },
  {
    "number": "719.4.",
    "text": "The Exhausted and Ready state of the Top-Most card does not affect nor change the status of the Attached cards and vice versa."
  },
  {
    "number": "719.5.",
    "text": "When a Top-Most Card changes zones from a board zone to a non-board zone, all Attached cards Detach from it, remaining in their current zones."
  },
  {
    "number": "719.5.a.",
    "text": "The player that controls the Top-Most Card that changed zones decides the order these cards Detach in, and thus the order of any relevant effects that occur due to the Detach occurring."
  },
  {
    "number": "720.",
    "text": "Inactive"
  },
  {
    "number": "721.1.",
    "text": "Card text can occasionally be assigned to be ignored, disregarded, or otherwise rendered as not applicable during the course of play. This state is referred to as Inactive."
  },
  {
    "number": "721.1.a.",
    "text": "Text marked this way is not applied at all while in this state."
  },
  {
    "number": "721.1.b.",
    "text": "Inactive Abilities do not trigger, do not apply, and cannot be activated. Inactive instructions are not processed."
  },
  {
    "number": "722.",
    "text": "Inactive text is still present on cards."
  },
  {
    "number": "722.1.",
    "text": "Cards with Inactive text still have keywords for the sake of Game Effects that want to reference or see if a card has a keyword."
  },
  {
    "number": "722.2.",
    "text": "Game Effects that parse or interpret text to determine target eligibility may still parse Inactive text for the sake of eligibility.\nExample: Spinning Axe is a gear with [Temporary]. While it’s attached and its rules text is inactive, its [Temporary] ability doesn’t trigger. However, a spell that reads “Destroy a gear with [Temporary]” could still choose and destroy Spinning Axe."
  },
  {
    "number": "723.",
    "text": "Rules Text is never Inactive by default."
  },
  {
    "number": "724.",
    "text": "Effect Text is Inactive unless the card with the Effect Text is Attached."
  },
  {
    "number": "725.",
    "text": "Inactive text can partially cease to be Inactive under specific circumstances and exceptions."
  },
  {
    "number": "725.1.",
    "text": "If an Attached card has a Passive or Replacement ability that applies during the process of Attaching or a Triggered ability that triggers off of Attaching, that text exists and can be processed as it Attaches."
  },
  {
    "number": "725.2.",
    "text": "If an Attached card has a Passive or Replacement ability that applies during the process of Detaching or a Triggered ability that triggers off of Detaching, that text exists and can be processed as it Detaches."
  },
  {
    "number": "725.3.",
    "text": "If an Attached card has an Equip ability, the Weaponmaster keyword can reference that Equip ability and any abilities that passively modify that Equip ability."
  },
  {
    "number": "726.",
    "text": "Keywords"
  },
  {
    "number": "727.",
    "text": "A Keyword is a specific term that appears on Cards that acts as a shorthand for a specific game effect, or ability of any variety."
  },
  {
    "number": "727.1.",
    "text": "A Keyword can be an ability."
  },
  {
    "number": "727.2.",
    "text": "Keywords can be identified by having a colored highlight behind them."
  },
  {
    "number": "727.2.a.",
    "text": "The color of the highlight has no effect on gameplay."
  },
  {
    "number": "727.3.",
    "text": "Keywords can be referenced or specified by other Game Effects."
  },
  {
    "number": "727.3.a.",
    "text": "Other effects may grant Keywords."
  },
  {
    "number": "727.3.a.1.",
    "text": "The definition and rules of the specific Keyword will determine the behavior if a Keyword is granted while it is already present."
  },
  {
    "number": "727.3.a.2.",
    "text": "The effect that granted the Keyword will specify the duration for which it is granted."
  },
  {
    "number": "727.3.a.3.",
    "text": "If an effect that grants a Keyword does not specify a duration, the duration is as long as that Game Object remains on the Board or in its current Non-Board Zone."
  },
  {
    "number": "727.3.b.",
    "text": "Other effects may remove Keywords."
  },
  {
    "number": "727.3.b.1.",
    "text": "The effect that removed the Keyword will specify the duration it is removed."
  },
  {
    "number": "727.3.b.2.",
    "text": "If an effect that removes a Keyword does not specify a duration, the duration is as long as that Game Object remains on the Board or in its current Non-Board Zone."
  },
  {
    "number": "728.",
    "text": "A card can have any number of Keywords."
  },
  {
    "number": "729.",
    "text": "Similar to other rules text, execute any effects of Keywords in the order listed when reading the card from top to bottom of the rules text."
  },
  {
    "number": "730.",
    "text": "Keyword Glossary"
  },
  {
    "number": "731.",
    "text": "Accelerate"
  },
  {
    "number": "731.1.",
    "text": "Accelerate is a Unit ability."
  },
  {
    "number": "731.1.a.",
    "text": "Accelerate is functionally short for \"As you play me, you may pay [1] and 1 Power as an additional cost. If you do, I enter ready.\""
  },
  {
    "number": "731.1.a.1.",
    "text": "If the unit has a single domain, the Power portion of the Accelerate cost can be paid only with a Power that matches the domain of the unit."
  },
  {
    "number": "731.1.a.2.",
    "text": "If the unit has no domain or more than one domain, the Power portion of the Accelerate cost can be paid with [A] (a Power of any domain)."
  },
  {
    "number": "731.2.",
    "text": "Accelerate is an Optional Additional Cost to be paid as a player plays the unit with the ability."
  },
  {
    "number": "731.2.a.",
    "text": "Accelerate costs cannot be paid while the unit is on the board, only as part of the steps of playing a card."
  },
  {
    "number": "731.3.",
    "text": "Accelerate has no function while on the board."
  },
  {
    "number": "731.4.",
    "text": "Multiple instances of Accelerate are redundant."
  },
  {
    "number": "731.5.",
    "text": "Accelerate, and whether or not a unit has Accelerate, is a characteristic of the Unit and may be checked or referenced by other Game Effects."
  },
  {
    "number": "731.6.",
    "text": "Accelerate influences the state of the unit entering the Board. It does not enter exhausted and then become ready."
  },
  {
    "number": "731.6.a.",
    "text": "Accelerate will not interact with, or trigger, abilities that are affected by units becoming ready."
  },
  {
    "number": "732.",
    "text": "Action"
  },
  {
    "number": "732.1.",
    "text": "Action is a Permissive keyword."
  },
  {
    "number": "732.1.a.",
    "text": "It can be present on Spells, Units, Rune Abilities, Legend Abilities or Permanent Abilities."
  },
  {
    "number": "732.1.b.",
    "text": "Action grants the corresponding card or effect permission to be played or activated during Showdowns, even when it is not the Controlling player's turn."
  },
  {
    "number": "732.1.c.",
    "text": "Action is functionally short for the following:"
  },
  {
    "number": "732.1.c.1.",
    "text": "On Spells and Units: \"This can be played during showdowns on any player's turn.\""
  },
  {
    "number": "732.1.c.2.",
    "text": "On Rune, Legend, or Permanent Abilities: \"This can be activated during showdowns on any player's turn.\""
  },
  {
    "number": "732.2.",
    "text": "The card or effect with this keyword is not restricted to showdowns. This permission is inclusive of all other timings and options available to the ability as written or by default."
  },
  {
    "number": "732.3.",
    "text": "Action does not alter the function of any instruction of the corresponding card or effect it is on. It is only permission.\nExample: Playing a Unit with Action still has the inherent restrictions of playing Units without Action. It can only be played to the controlling player's base or a battlefield they control."
  },
  {
    "number": "732.4.",
    "text": "Action is a referenceable characteristic."
  },
  {
    "number": "732.4.a.",
    "text": "Whether or not a Game Object has Action is a characteristic of that Game Object and may be checked or referenced by other Game Effects."
  },
  {
    "number": "732.4.b.",
    "text": "Whether or not a Spell has Action is a characteristic of that Spell and may be checked or referenced by other Game Effects."
  },
  {
    "number": "732.4.c.",
    "text": "Whether or not an Ability has Action is a characteristic of that Ability and may be checked or referenced by other Game Effects."
  },
  {
    "number": "733.",
    "text": "Assault"
  },
  {
    "number": "733.1.",
    "text": "Assault is a Passive Ability keyword."
  },
  {
    "number": "733.1.a.",
    "text": "It is present on Units."
  },
  {
    "number": "733.1.b.",
    "text": "Assault is formatted as \"Assault [X]\"."
  },
  {
    "number": "733.1.b.1.",
    "text": "The X is referenced in the functional text of the ability."
  },
  {
    "number": "733.1.b.2.",
    "text": "The X is referred to as the Assault Value."
  },
  {
    "number": "733.1.b.3.",
    "text": "If X is omitted, it is presumed to be 1."
  },
  {
    "number": "733.1.c.",
    "text": "It is functionally short for \"While I am an attacker, I have +X [M].\""
  },
  {
    "number": "733.1.d.",
    "text": "Being an attacker means the Unit has gained the Attacker designation during Combat.\nSee rule 437. Combat for more information."
  },
  {
    "number": "733.1.d.1.",
    "text": "Assault remains in effect as long as the Unit maintains the Attacker designation."
  },
  {
    "number": "733.2.",
    "text": "If a Unit has Assault or has been granted Assault and is granted Assault by an additional source, the Assault Value of all granted Assault keywords is summed.\nExample: Petty Officer has Assault. It is chosen as the target of Cleave, which says \"Give a unit [Assault 3] this turn.\" After Cleave resolves, Petty Officer has Assault 4 this turn."
  },
  {
    "number": "733.3.",
    "text": "Assault, and whether or not a unit has Assault, is a characteristic of the Unit and may be checked or referenced by other Game Effects."
  },
  {
    "number": "734.",
    "text": "Deathknell"
  },
  {
    "number": "734.1.",
    "text": "Deathknell is a Triggered Ability keyword."
  },
  {
    "number": "734.1.a.",
    "text": "It is present on Permanents."
  },
  {
    "number": "734.1.b.",
    "text": "It is formatted as \"Deathknell — [Effect]\"."
  },
  {
    "number": "734.1.b.1.",
    "text": "[Effect] is the rules text for the specific instance of Deathknell. This is referred to as the Deathknell effect."
  },
  {
    "number": "734.1.c.",
    "text": "It is functionally short for \"When I die, [Effect].\""
  },
  {
    "number": "734.1.c.1.",
    "text": "[Effect] is the rules text of the Deathknell effect."
  },
  {
    "number": "734.1.d.",
    "text": "The Trigger for this effect is the Permanent being Killed and sent to the Trash."
  },
  {
    "number": "734.1.d.1.",
    "text": "If the Permanent with the effect is not sent to the Trash, for example because its \"killed\" event was replaced with a recall, the Deathknell will not occur."
  },
  {
    "number": "734.1.d.2.",
    "text": "The trigger will be added to the chain as a Pending Item before the card with Deathknell is moved to the trash due to a Kill instruction or a Cleanup."
  },
  {
    "number": "734.1.d.3.",
    "text": "Before the card with Deathknell is moved to the Trash, note its location, its attributes, and any other details related to the effect of its Deathknell to process the trigger after it has been Finalized."
  },
  {
    "number": "734.2.",
    "text": "Each instance of Deathknell a Permanent may have will trigger separately."
  },
  {
    "number": "734.2.a.",
    "text": "The controller will choose the order to add these Triggers to the chain."
  },
  {
    "number": "734.3.",
    "text": "Deathknell, and whether or not a permanent has Deathknell, is a characteristic of the permanent and may be checked or referenced by other Game Effects."
  },
  {
    "number": "735.",
    "text": "Deflect"
  },
  {
    "number": "735.1.",
    "text": "Deflect is a Passive Ability keyword."
  },
  {
    "number": "735.1.a.",
    "text": "It is present on Permanents."
  },
  {
    "number": "735.1.b.",
    "text": "It is formatted as \"Deflect [X]\"."
  },
  {
    "number": "735.1.b.1.",
    "text": "The X is referenced in the functional text of the ability."
  },
  {
    "number": "735.1.b.2.",
    "text": "The X is referred to as the Deflect Value."
  },
  {
    "number": "735.1.b.3.",
    "text": "If X is omitted, it is presumed to be 1."
  },
  {
    "number": "735.1.c.",
    "text": "It is functionally short for \"Spells and abilities an opponent controls that choose me cost an amount of Power equal to [Deflect Value] more to play as an additional cost.\""
  },
  {
    "number": "735.1.c.1.",
    "text": "The Power used to pay this cost may always be of any Domain.\nExample: A Fury spell targets an Order unit with Deflect. The Power used to pay the Deflect cost can be any Domain; it does not need to match the Domain of the spell or the target."
  },
  {
    "number": "735.1.d.",
    "text": "It is an effect that imposes a Mandatory Additional Cost on Spells and Abilities that choose the permanent that has this ability.\nSee rule 346. Playing Cards for more information."
  },
  {
    "number": "735.2.",
    "text": "If a Unit has Deflect, or has been granted Deflect, and is granted Deflect by an additional source, the Deflect Value of all granted Deflect keywords is summed."
  },
  {
    "number": "735.3.",
    "text": "Deflect, and whether or not a permanent has Deflect, is a characteristic of the permanent and may be checked or referenced by other Game Effects."
  },
  {
    "number": "736.",
    "text": "Ganking"
  },
  {
    "number": "736.1.",
    "text": "Ganking is a Passive Ability keyword."
  },
  {
    "number": "736.1.a.",
    "text": "It is present on Units."
  },
  {
    "number": "736.1.b.",
    "text": "It is functionally short for \"I may move to a battlefield from another battlefield.\""
  },
  {
    "number": "736.1.c.",
    "text": "It is a passive ability that adds permissions to the Unit's Standard Move."
  },
  {
    "number": "736.1.c.1.",
    "text": "It does not restrict or remove options from the Unit's Standard Move."
  },
  {
    "number": "736.1.c.2.",
    "text": "It does not have an activation cost."
  },
  {
    "number": "736.1.c.3.",
    "text": "It does not give additional abilities or activations of Movement, only new options for the Standard Move."
  },
  {
    "number": "736.2.",
    "text": "Multiple instances of Ganking are redundant."
  },
  {
    "number": "736.3.",
    "text": "Ganking, and whether or not a unit has Ganking, is a characteristic of the Unit and may be checked or referenced by other Game Effects."
  },
  {
    "number": "737.",
    "text": "Hidden"
  },
  {
    "number": "737.1.",
    "text": "Hidden is a keyword that acts as a prerequisite to perform the Hide Discretionary Action."
  },
  {
    "number": "737.1.a.",
    "text": "It is present on Spells, Units, and Gear."
  },
  {
    "number": "737.1.b.",
    "text": "It is functionally short for \"While this card is in your hand or in the Champion Zone on your turn during an Open State, you may pay [A] to hide this facedown at a battlefield you control that doesn't already have a facedown card hidden there for as long as you control that battlefield. Beginning on the next turn, this gains [Reaction] and you may play this, ignoring its base cost.\""
  },
  {
    "number": "737.1.c.",
    "text": "It allows the player to take the Discretionary Action Hide."
  },
  {
    "number": "737.1.c.1.",
    "text": "Hide is not a subset of Play."
  },
  {
    "number": "737.1.c.2.",
    "text": "Hiding a card does not open a chain."
  },
  {
    "number": "737.1.c.3.",
    "text": "Playing a card from facedown (or \"from Hidden\") does open a chain."
  },
  {
    "number": "737.1.d.",
    "text": "Some choices made while playing a card from Hidden are restricted to the battlefield where it was hidden. A card cannot be played from Hidden if it is a spell with no valid targets under these restrictions.\nSee rule 352.5. Targeting for more information."
  },
  {
    "number": "737.1.d.1.",
    "text": "A hidden unit must be played to that battlefield."
  },
  {
    "number": "737.1.d.2.",
    "text": "If a hidden spell or a play effect of a hidden permanent chooses any targets, those targets must be chosen from among options at that battlefield, unless the ability explicitly restricts targeting in a way that makes this impossible.\nExample: Blastcone Fae is a unit with Hidden and “When you play me, give a unit -2 [M] this turn, to a minimum of 1 [M].” Because this is a play effect, its target must be chosen from among units at the same battlefield if Blastcone Fae was played from Hidden.\nExample: Tideturner is a unit with Hidden and “When you play me, you may choose a unit you control at another location. Move me to its location and it to my original location.” Because its play ability has a targeting restriction that can never be fulfilled by a unit at its battlefield, its target may be chosen freely from among the available options."
  },
  {
    "number": "737.1.d.3.",
    "text": "If a hidden spell or a play effect of a hidden permanent causes you to play a unit, you must choose to play that unit at that battlefield."
  },
  {
    "number": "737.2.",
    "text": "Abilities and instructions of hidden cards other than the choices listed above function as normal.\nExample: Stand United is a spell that has Hidden and says “Buff a friendly unit. Buffs give an additional +1 might to friendly units this turn.” If it’s played from Hidden, the first part of its ability must choose a friendly unit at the same battlefield, but the second part of its ability affects all friendly units with buffs, no matter where they are."
  },
  {
    "number": "737.3.",
    "text": "Instead of being hidden, a card with Hidden may be played for its cost as normal, at its normal timing with no restrictions on targeting."
  },
  {
    "number": "737.4.",
    "text": "Multiple instances of Hidden are redundant."
  },
  {
    "number": "737.5.",
    "text": "Hidden, and whether or not a card has Hidden, is a characteristic of the card and may be checked or referenced by other Game Effects."
  },
  {
    "number": "737.5.a.",
    "text": "This is independent of the state of being facedown."
  },
  {
    "number": "737.6.",
    "text": "A card that is Hidden gains Reaction while facedown, and may be played any time a card with Reaction may be played as a result."
  },
  {
    "number": "737.6.a.",
    "text": "The property is granted to the card in its facedown state, and is not publicly known."
  },
  {
    "number": "738.",
    "text": "Legion"
  },
  {
    "number": "738.1.",
    "text": "Legion is a Conditional Keyword."
  },
  {
    "number": "738.1.a.",
    "text": "It can be present on Spells, Units, Rune Abilities, Legend Abilities and Permanent Abilities."
  },
  {
    "number": "738.1.b.",
    "text": "It is formatted as \"Legion — [Text]\"."
  },
  {
    "number": "738.1.c.",
    "text": "Starting from the Keyword to the end of the clause, the entire statement is the Legion Ability."
  },
  {
    "number": "738.1.c.1.",
    "text": "On spells and on play effects of permanents, it is functionally short for “If you have played another Main Deck card before this one already this turn, apply [Text].”"
  },
  {
    "number": "738.1.c.2.",
    "text": "On other abilities and instructions, it is functionally short for “If you have played a Main Deck card this turn, apply [Text].”"
  },
  {
    "number": "738.1.c.3.",
    "text": "This is called the Legion condition."
  },
  {
    "number": "738.1.c.4.",
    "text": "Legion's conditional can apply to passive abilities, activated abilities, spell instructions, or even abilities active in zones outside of the board."
  },
  {
    "number": "738.2.",
    "text": "All instances of Legion on cards a player controls are satisfied by that player playing a single card.\nExample: One card has three different Legion Abilities. The Legion Text of all three abilities apply as long as one card has been played by the card's controller earlier in the same turn."
  },
  {
    "number": "738.3.",
    "text": "Legion, and whether or not a card has Legion, is a characteristic of the card and may be checked or referenced by other Game Effects."
  },
  {
    "number": "739.",
    "text": "Reaction"
  },
  {
    "number": "739.1.",
    "text": "Reaction is a Permissive keyword."
  },
  {
    "number": "739.1.a.",
    "text": "It can be present on Spells, Units, Rune Abilities, Legend Abilities and Permanent Abilities."
  },
  {
    "number": "739.1.b.",
    "text": "Reaction grants the corresponding card or effect all abilities and permissions of Action."
  },
  {
    "number": "739.1.c.",
    "text": "Reaction, additionally, is functionally short for the following:"
  },
  {
    "number": "739.1.c.1.",
    "text": "On Spells: \"This can be played during Closed States on any player's turn.\""
  },
  {
    "number": "739.1.c.2.",
    "text": "On Units: \"This can be played during Closed States on any player's turn.\""
  },
  {
    "number": "739.1.c.3.",
    "text": "On Rune, Legend, or Permanent Abilities: \"This can be activated during Closed States on any player's turn.\""
  },
  {
    "number": "739.2.",
    "text": "The corresponding card or effect with this keyword is not restricted to Closed States or Showdowns. This permission is inclusive of all other timings and options available to the ability as written, Action's permissions, or by default."
  },
  {
    "number": "739.3.",
    "text": "Reaction does not alter the function of any instruction of the Card, Rune, or Effect it is on. It is only Permission."
  },
  {
    "number": "739.3.a.",
    "text": "Playing Units with Reaction still has the inherent restrictions of playing Units without Reaction. It can only be played to the controlling player's base or a battlefield they control."
  },
  {
    "number": "739.4.",
    "text": "Reaction is a referencable characteristic."
  },
  {
    "number": "739.4.a.",
    "text": "Whether or not a Game Object has Reaction is a characteristic of that Game Object and may be checked or referenced by other Game Effects."
  },
  {
    "number": "739.4.b.",
    "text": "Whether or not a Spell has Reaction is a characteristic of that Spell and may be checked or referenced by other Game Effects."
  },
  {
    "number": "739.4.c.",
    "text": "Whether or not an Ability has Reaction is a characteristic of that Ability and may be checked or referenced by other Game Effects."
  },
  {
    "number": "740.",
    "text": "Shield"
  },
  {
    "number": "740.1.",
    "text": "Shield is a Passive Ability keyword."
  },
  {
    "number": "740.1.a.",
    "text": "It is present on Units."
  },
  {
    "number": "740.1.b.",
    "text": "Shield is formatted as \"Shield [X]\"."
  },
  {
    "number": "740.1.b.1.",
    "text": "The X is referenced in the functional text of the ability."
  },
  {
    "number": "740.1.b.2.",
    "text": "The X is referred to as the Shield Value."
  },
  {
    "number": "740.1.b.3.",
    "text": "If X is omitted, it is presumed to be 1."
  },
  {
    "number": "740.1.c.",
    "text": "It is functionally short for \"While I am a defender, I have +X [M].\""
  },
  {
    "number": "740.1.d.",
    "text": "Being a defender means the Unit has gained the Defender designation during Combat.\nSee rule 437. Combat for more information."
  },
  {
    "number": "740.1.d.1.",
    "text": "Shield remains in effect as long as the Unit maintains the Defender designation."
  },
  {
    "number": "740.2.",
    "text": "If a Unit has Shield, or has been granted Shield, and is granted Shield by an additional source, the Shield Value of all granted Shield keywords is summed.\nExample: Stalwart Poro has Shield. It is chosen as the target of Block, which says \"Give a unit [Shield 3] and [Tank] this turn.\" After Block resolves, Stalwart Poro has Shield 4 this turn."
  },
  {
    "number": "740.3.",
    "text": "Shield, and whether or not a unit has Shield, is a characteristic of the Unit and may be checked or referenced by other Game Effects."
  },
  {
    "number": "741.",
    "text": "Tank"
  },
  {
    "number": "741.1.",
    "text": "Tank is a Passive Ability keyword."
  },
  {
    "number": "741.1.a.",
    "text": "It is present on Units."
  },
  {
    "number": "741.1.b.",
    "text": "It is functionally short for \"I must be assigned lethal damage before any other unit with the same controller as me that does not have [Tank] during combat resolution.\""
  },
  {
    "number": "741.1.c.",
    "text": "It alters how players can elect to assign combat damage during combat."
  },
  {
    "number": "741.1.c.1.",
    "text": "Players must still assign lethal damage to a unit before moving to the next when assigning their damage."
  },
  {
    "number": "741.1.c.2.",
    "text": "If more than one unit with Tank is present with the same controller in Combat, damage may be assigned to any of them. Units without Tank are invalid assignments until all units with Tank have lethal damage assigned to them."
  },
  {
    "number": "741.2.",
    "text": "Multiple instances of Tank are redundant."
  },
  {
    "number": "741.3.",
    "text": "Tank, and whether or not a unit has Tank, is a characteristic of the Unit and may be checked or referenced by other Game Effects."
  },
  {
    "number": "742.",
    "text": "Temporary"
  },
  {
    "number": "742.1.",
    "text": "Temporary is a Triggered Ability keyword."
  },
  {
    "number": "742.1.a.",
    "text": "It is present on Permanents."
  },
  {
    "number": "742.1.b.",
    "text": "It is functionally short for \"At the start of this permanent's controller's Beginning Phase, before scoring, kill this.\""
  },
  {
    "number": "742.1.c.",
    "text": "The Trigger Condition is the controller of the permanent's Beginning Phase occurring."
  },
  {
    "number": "742.2.",
    "text": "Multiple instances of Temporary are redundant."
  },
  {
    "number": "742.3.",
    "text": "Temporary, and whether or not a permanent has Temporary, is a characteristic of the permanent and may be checked or referenced by other Game Effects."
  },
  {
    "number": "743.",
    "text": "Vision"
  },
  {
    "number": "743.1.",
    "text": "Vision is a Triggered Ability keyword."
  },
  {
    "number": "743.1.a.",
    "text": "It is present on Permanents."
  },
  {
    "number": "743.1.b.",
    "text": "It is functionally short for \"When this is played, look at the top card of your Main Deck. You may recycle it.\""
  },
  {
    "number": "743.1.c.",
    "text": "The trigger is the permanent entering the Board."
  },
  {
    "number": "743.2.",
    "text": "Multiple instances of Vision trigger separately."
  },
  {
    "number": "743.2.a.",
    "text": "The player may choose to recycle or not recycle for each instance of Vision separately."
  },
  {
    "number": "743.2.b.",
    "text": "If the player does not recycle the top card and nothing else happens in between the triggers resolving, each instance of Vision will see the same card."
  },
  {
    "number": "743.3.",
    "text": "Vision, and whether or not a permanent has Vision, is a characteristic of the permanent and may be checked or referenced by other Game Effects."
  },
  {
    "number": "744.",
    "text": "Equip"
  },
  {
    "number": "744.1.",
    "text": "Equip is an Activated Ability keyword."
  },
  {
    "number": "744.1.a.",
    "text": "Equip is normally present on Gear with the tag Equipment."
  },
  {
    "number": "744.1.b.",
    "text": "Equip has a cost to activate and Attaches the card with Equip to a chosen Unit when the cost is paid."
  },
  {
    "number": "744.1.b.1.",
    "text": "Equip’s choice is a Target."
  },
  {
    "number": "744.1.b.2.",
    "text": "The chosen Unit will become the Top-Most Card for the Attach action."
  },
  {
    "number": "744.1.c.",
    "text": "Equip is formatted as “Equip [Cost]”"
  },
  {
    "number": "744.1.c.1.",
    "text": "If paying costs or making choices for this ability causes triggered abilities to trigger, they will be placed on the chain above this ability in a Pending state.\nSee rule 369 Activated Abilities for more information."
  },
  {
    "number": "744.1.c.2.",
    "text": "Equip is functionally short for “[Cost]: Attach this gear to a unit you control.”"
  },
  {
    "number": "744.1.c.3.",
    "text": "Equip costs may include both resource costs and non-resource costs."
  },
  {
    "number": "744.1.c.4.",
    "text": "Equip abilities may also include text that alters the Equip cost. Such text is taken into account when determining a card’s Equip cost for any reason."
  },
  {
    "number": "744.1.c.5.",
    "text": "Equip abilities may include text that alters the timing or targeting of the Equip ability."
  },
  {
    "number": "744.2.",
    "text": "When the Attach action completes from this keyword, the Unit that was chosen is considered to have been Equipped by the Gear with this ability."
  },
  {
    "number": "744.2.a.",
    "text": "This is an event other Game Effects and Triggered Abilities can reference."
  },
  {
    "number": "744.3.",
    "text": "Equipped is the state of a Top-Most Card being Attached by one or more cards that are Equipment."
  },
  {
    "number": "744.3.a.",
    "text": "The state of being Equipped is synchronous with that of the Attached state of the Equipment."
  },
  {
    "number": "744.3.b.",
    "text": "A Top-Most Card is Equipped as long as one or more of its Attached cards are Equipment."
  },
  {
    "number": "744.3.c.",
    "text": "The state of being Equipped corresponds to a Top-Most card having a card with Equip that is Attached to it."
  },
  {
    "number": "744.4.",
    "text": "Multiple instances of Equip are equivalent to multiple Activated Abilities and can each be activated separately by paying the corresponding costs."
  },
  {
    "number": "744.5.",
    "text": "Equip, and whether or not a Gear has Equip, is a characteristic of the Gear and may be checked or referenced by other Game Effects."
  },
  {
    "number": "744.5.",
    "text": "Whether or not a Gear has Equip may be referenced even if the Rules Text of the Gear is Inactive.\nSee rule 716 Attachment for more information."
  },
  {
    "number": "745.",
    "text": "Quick-Draw"
  },
  {
    "number": "745.1.",
    "text": "Quick-Draw is a Triggered Ability keyword. It is also a Permissive keyword."
  },
  {
    "number": "745.1.a.",
    "text": "Quick-Draw is present on Gear with Equip abilities."
  },
  {
    "number": "745.1.b.",
    "text": "Cards with Quick-Draw have Reaction inherently."
  },
  {
    "number": "745.1.c.",
    "text": "Quick-Draw allows cards to be played and Attached using Reaction timing."
  },
  {
    "number": "745.1.d.",
    "text": "Quick-Draw is functionally short for “[Reaction]” and “When you play this, attach it to a Unit you control.”\nSee rule 716 Attachment for more information."
  },
  {
    "number": "745.2.",
    "text": "Multiple instances of Quick-Draw do not trigger separately and have no effect beyond the first."
  },
  {
    "number": "745.3.",
    "text": "Quick-Draw has no function while on the board."
  },
  {
    "number": "745.4.",
    "text": "Quick-Draw, and whether or not a gear has Quick-Draw, is a characteristic of the Gear and may be checked or referenced by other Game Effects."
  },
  {
    "number": "746.",
    "text": "Repeat"
  },
  {
    "number": "746.1.",
    "text": "Repeat is an Optional Additional Cost keyword."
  },
  {
    "number": "746.1.a.",
    "text": "Repeat is present on Spells."
  },
  {
    "number": "746.1.b.",
    "text": "Repeat is an optional cost that player may pay to execute the effect of their spells a second time."
  },
  {
    "number": "746.1.c.",
    "text": "Repeat is formatted as “Repeat [Cost]”"
  },
  {
    "number": "746.1.c.1.",
    "text": "The Cost is an Additional Cost to be paid during the steps of playing the spell."
  },
  {
    "number": "746.1.c.2.",
    "text": "If a spell has more than one instance of Repeat, each Cost may be paid or not paid individually."
  },
  {
    "number": "746.1.c.3.",
    "text": "Each Repeat Cost can be paid only a single time."
  },
  {
    "number": "746.1.d.",
    "text": "Repeat is functionally short for “You may pay [Cost] as an additional cost as you play this spell. If you do, execute the instructions of this spell one additional time.”"
  },
  {
    "number": "746.1.d.1.",
    "text": "When the additional cost is paid, the effect of the spell, upon resolution, will be performed an additional time.\nExample: Desert’s Call is a spell with [Repeat] [2] and “Play a 2 [S] Sand Soldier unit token.” If its controller pays its Repeat cost as they play it, the card’s instruction to play a Sand Soldier is executed twice, as though the card says “Play a 2 [S] Sand Soldier unit token. Play a 2 [S] Sand Soldier unit token.”"
  },
  {
    "number": "746.2.",
    "text": "When a spell’s effect is performed an additional time with Repeat, choices must be made at the usual time during the Make Relevant Choices step of Playing a Card.\nSee rule 346 Playing Cards for more information."
  },
  {
    "number": "746.2.a.",
    "text": "Choices made for the additional execution do not have to be the same as the choices made for the initial execution.\nExample: Rocket Barrage is a spell with [Repeat] [4][C] and “Choose one — Deal 4 to a unit in a base. [or] Kill a gear.” If Rocket Barrage’s controller pays its Repeat cost as they play it, they may choose the same mode or a different one, and if they choose the same mode, may choose the same target or a different one. If they choose “Kill a gear” twice and choose two different gear, they must specify which gear is the first target and which is the second. As the spell resolves, those two gear will be killed in the chosen order."
  },
  {
    "number": "746.3.",
    "text": "Multiple instances of Repeat can be paid for separately. The spell’s instructions will be executed an additional time for each instance of Repeat that is paid for."
  },
  {
    "number": "746.3.a.",
    "text": "Regardless of the number of times a spell's instructions are executed with this keyword, the spell is only Played once."
  },
  {
    "number": "746.4.",
    "text": "Repeat, and whether or not a spell has Repeat, is a characteristic of the Spell and may be checked or referenced by other Game Effects."
  },
  {
    "number": "747.",
    "text": "Weaponmaster"
  },
  {
    "number": "747.1.",
    "text": "Weaponmaster is a Triggered Ability keyword."
  },
  {
    "number": "747.1.a.",
    "text": "Weaponmaster is present on Units."
  },
  {
    "number": "747.1.b.",
    "text": "Weaponmaster is a Play Effect that chooses an Equipment you control and allows you to pay its Equip cost at a discount, regardless of the usual timing of the Equip ability, to Attach that Equipment to the unit with Weaponmaster."
  },
  {
    "number": "747.1.c.",
    "text": "Weaponmaster is functionally short for: “When you play me, choose a Card you control with the Equipment tag. Necessary portions of its Rules Text are no longer Inactive if they are currently Inactive. Pay the cost of its Equip ability, reduced by [A], to attach it to this unit.”\nSee rule 716 Attachment for more information."
  },
  {
    "number": "747.1.c.1.",
    "text": "Weaponmaster can choose an Equipment whether it has an Equip ability or not."
  },
  {
    "number": "747.1.c.2.",
    "text": "The cost of the Equip ability is determined as though that Equip ability was being activated choosing the unit with the Weaponmaster ability, as modulated by any abilities that alter Equip costs."
  },
  {
    "number": "747.1.c.3.",
    "text": "If the chosen card’s Equip cost does not contain [A], it can still be paid, but will not be reduced."
  },
  {
    "number": "747.1.c.4.",
    "text": "If the chosen card doesn’t have an Equip cost, it can’t be paid."
  },
  {
    "number": "747.1.c.5.",
    "text": "If the chosen card’s Equip cost can’t be paid, if it can’t be detached from its current Top-Most card, or if it can’t be attached to the unit with the Weaponmaster ability, it stays in its current location, Attached to anything it was already Attached to."
  },
  {
    "number": "747.1.c.6.",
    "text": "The Equip ability is not activated this way, and the unit with the Weaponmaster ability is not chosen."
  },
  {
    "number": "747.2.",
    "text": "Multiple instances of Weaponmaster trigger separately, and can choose different targets."
  },
  {
    "number": "747.2.a.",
    "text": "If you choose the same target with multiple instances of Weaponmaster, each will resolve separately."
  },
  {
    "number": "747.3.",
    "text": "Weaponmaster has no function while on the board."
  },
  {
    "number": "747.4",
    "text": "Weaponmaster, and whether or not a unit has Weaponmaster, is a characteristic of the Unit and may be checked or referenced by other Game Effects."
  }
]